{
  "total_generated": 10,
  "mcqs": [
    {
      "question_en": "According to the provided caution about Oinc environment settings, what is the primary risk if default settings are manually changed without a clear understanding of each setting's impact?",
      "question_mn": "Өгөгдсөн Oinc орчны тохиргооны сэрэмжлүүлгийн дагуу, хэрэв анхдагч тохиргоог тухайн тохиргоо бүрийн нөлөөллийг ойлгохгүйгээр гараар өөрчилбөл үүсэх гол эрсдэл юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Your record retrieval speed may decrease significantly.",
          "text_mn": "Таны бичлэг татаж авах хурд мэдэгдэхүйц буурах магадлалтай.",
          "is_correct": true,
          "source": "Page 71",
          "explanation": "The caution explicitly states, 'Your record retrieval speed may decrease significantly if the wrong settings are used.' This directly addresses the performance impact of incorrect manual changes to default settings."
        },
        {
          "id": "B",
          "text_en": "The Oinc system may operate illegally under tax laws.",
          "text_mn": "Oinc систем нь татварын хуулийн дагуу хууль бусаар ажиллах магадлалтай.",
          "is_correct": false,
          "source": "Page 71",
          "explanation": "The text mentions legal risks concerning 'country settings,' but the specific caution about 'default settings' (not country-specific) focuses solely on performance degradation, not legality."
        },
        {
          "id": "C",
          "text_en": "There is a risk of losing data or damaging equipment.",
          "text_mn": "Мэдээлэл алдах эсвэл тоног төхөөрөмжийг гэмтээх эрсдэлтэй.",
          "is_correct": false,
          "source": "Page 71",
          "explanation": "While the general 'Warnings' section mentions risks like data loss or equipment damage, the specific caution given for changing 'default settings' only highlights the decrease in record retrieval speed."
        },
        {
          "id": "D",
          "text_en": "Only new user profiles will be affected by the changes.",
          "text_mn": "Зөвхөн шинэ хэрэглэгчийн профайлд өөрчлөлт нөлөөлнө.",
          "is_correct": false,
          "source": "Page 71",
          "explanation": "The caution about default settings implies a system-wide performance impact ('Oinc environment'), not just a limitation to new user profiles or specific user accounts."
        }
      ],
      "concept": "Managing default settings and potential performance impacts of manual changes",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly warns, 'Caution: Do not change the default settings manually unless you are sure how each setting affects the performance of your Oinc environment. Your record retrieval speed may decrease significantly if the wrong settings are used.' This directly indicates that a significant decrease in record retrieval speed is the main risk associated with incorrect manual changes to default settings. Other options refer to risks mentioned in different contexts (like country settings or general warning types) or are not supported by the specific caution regarding default settings.",
      "explanation_mn": "Анхдагч агуулгад тодорхой анхааруулсан байдаг: 'Анхааруулга: Хэрэв та тохиргоо бүр таны Oinc орчны гүйцэтгэлд хэрхэн нөлөөлөхийг мэдэхгүй бол анхдагч тохиргоог гараар бүү өөрчил. Буруу тохиргоо хийвэл таны бичлэг татаж авах хурд мэдэгдэхүйц буурах магадлалтай.' Энэ нь анхдагч тохиргоонд буруу гараар өөрчлөлт хийснээр бичлэг татаж авах хурд мэдэгдэхүйц буурах нь гол эрсдэл болохыг шууд заана. Бусад сонголтууд нь өөр нөхцөл байдалд (тухайлбал, улсын тохиргоо эсвэл ерөнхий анхааруулгын төрөл) дурдагдсан эрсдлүүдийг илэрхийлдэг эсвэл анхдагч тохиргоотой холбоотой тусгай анхааруулгаар дэмжигддэггүй.",
      "question_number": 1,
      "page_reference": "100-150"
    },
    {
      "question_en": "According to the provided text, what is the primary purpose of a 'Caution' notice in user guidance?",
      "question_mn": "Өгөгдсөн текстийн дагуу, хэрэглэгчийн гарын авлага дахь 'Анхааруулга' (Caution) мэдэгдлийн үндсэн зорилго юу вэ?",      
      "choices": [
        {
          "id": "A",
          "text_en": "To help users solve problems when using the software.",
          "text_mn": "Програм хангамжийг ашиглах үед хэрэглэгчдэд асуудлыг шийдвэрлэхэд туслах.",
          "is_correct": true,
          "source": "FIGURE 3.7 Cautions",
          "explanation": "The text explicitly states, 'Notices of caution can help users solve problems when using the software.'"
        },
        {
          "id": "B",
          "text_en": "To inform users about potential risks of losing data or damaging equipment.",
          "text_mn": "Өгөгдөл алдах эсвэл тоног төхөөрөмжийг гэмтээх эрсдэлийн талаар хэрэглэгчдэд мэдээлэх.",
          "is_correct": false,
          "source": "FIGURE 3.8 Warnings",
          "explanation": "This describes the purpose of 'Warnings,' not 'Cautions,' as stated in the text: 'Use warnings when users face a risk of losing data, damaging equipment, or, in this case, breaking the law.'"
        },
        {
          "id": "C",
          "text_en": "To discourage users from manually altering default settings unless certain of their impact.",
          "text_mn": "Хэрэглэгчдийг өгөгдмөл тохиргоог гаргаар өөрчлөхөөс сэргийлэх, ялангуяа тэдгээр нь ямар нөлөө үзүүлэхийг мэдэхгүй бол.",
          "is_correct": false,
          "source": "Chapter 3: Writing to Guide—Procedures 71",
          "explanation": "While the text advises against manually changing default settings without certainty, this is a general recommendation regarding settings. The specific purpose of a 'Caution' *notice* is defined as helping users solve problems, not primarily to prevent changes to default settings."
        },
        {
          "id": "D",
          "text_en": "To ensure users specify the legal residence of their server for tax compliance.",
          "text_mn": "Татварын хуулийг дагаж мөрдөхийн тулд хэрэглэгчид серверийнхээ хууль ёсны байршлыг заавал тодорхойлохыг баталгаажуулах.",
          "is_correct": false,
          "source": "FIGURE 3.8 Warnings",
          "explanation": "This information pertains to 'Warnings' regarding country settings and legal/tax implications, not 'Cautions' for general problem-solving. The text states: 'Warning: Use only the country setti. ng appropria. te for the area where your server environment will reside... The Oinc system operates under the tax laws of the country in which the server resides...'"
        }
      ],
      "concept": "Purpose and use of Caution notices in user guidance for problem-solving",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly states under 'FIGURE 3.7 Cautions' that 'Notices of caution can help users solve problems when using the software.' Distractors relate to 'Warnings' (risks of data loss, legal/tax compliance) or general advice about default settings, which are distinct from the stated purpose of 'Cautions.'",
      "explanation_mn": "Үндсэн контекст дэх 'Зураг 3.7 Анхааруулгууд' хэсэгт 'Анхааруулга мэдэгдлүүд нь програм хангамжийг ашиглах үед хэрэглэгчдэд асуудлыг шийдвэрлэхэд тусалдаг' гэж тодорхой заасан байдаг. Бусад хувилбарууд нь 'Сэрэмжлүүлэг' (өгөгдөл алдах эрсдэл, хууль эрх зүй/татварын зохицуулалт) эсвэл өгөгдмөл тохиргооны талаарх ерөнхий зөвлөгөөтэй холбоотой бөгөөд эдгээр нь 'Анхааруулга'-ын зорилгоос ялгаатай.",   
      "question_number": 2,
      "page_reference": "100-150"
    },
    {
      "question_en": "According to the provided text, which statement accurately describes the function of 'Preferences' within the Oinc system?",
      "question_mn": "Өгөгдсөн текстийн дагуу, Oinc системийн 'Тохиргоо (Preferences)'-ны үүргийг аль мэдэгдэл зөв тодорхойлж байна вэ?",     
      "choices": [
        {
          "id": "A",
          "text_en": "Preferences are properties common to all user profiles and remain unchanged even when switching between profiles.",     
          "text_mn": "Тохиргоо (Preferences) нь бүх хэрэглэгчийн профайлд нийтлэг шинж чанартай бөгөөд профайл солиход ч өөрчлөгддөггүй.",    
          "is_correct": true,
          "source": "Page 71",
          "explanation": "The text explicitly states: 'On the Preferences page you can set properties which are common for all your user profiles. These settings will remain unchanged even if you switch to using another profile.'"
        },
        {
          "id": "B",
          "text_en": "Preferences are unique settings specific to an individual user profile and must be reconfigured for each new profile.", 
          "text_mn": "Тохиргоо (Preferences) нь хувийн хэрэглэгчийн профайл тус бүрд өвөрмөц тохиргоо бөгөөд шинэ профайл бүрд дахин тохируулах шаардлагатай.",
          "is_correct": false,
          "source": "Distractor",
          "explanation": "This contradicts the text, which states preferences are 'common for all your user profiles' and 'remain unchanged even if you switch to using another profile,' indicating they are not specific to individual profiles."
        },
        {
          "id": "C",
          "text_en": "Preferences primarily govern the system's tax law operations, automatically retrieving information based on the server's country.",
          "text_mn": "Тохиргоо (Preferences) нь үндсэндээ системийн татварын хуулийн үйл ажиллагааг зохицуулдаг бөгөөд серверийн байрлаж буй улсад үндэслэн мэдээллийг автоматаар татаж авдаг.",
          "is_correct": false,
          "source": "Distractor",
          "explanation": "While the 'country setting' which impacts tax laws is mentioned as an option on the Preferences page, this is a specific *setting* within Preferences, not the overarching *function* or *definition* of what Preferences are. The question asks for the general function of 'Preferences'."
        },
        {
          "id": "D",
          "text_en": "Preferences are default settings automatically configured by the Oinc system during setup and cannot be manually adjusted by users.",
          "text_mn": "Тохиргоо (Preferences) нь Oinc системийг суулгах явцад автоматаар тохируулагддаг үндсэн тохиргоонууд бөгөөд хэрэглэгчид гараар өөрчлөх боломжгүй.",
          "is_correct": false,
          "source": "Distractor",
          "explanation": "The text states, 'On the Preferences page you can set properties,' which implies user adjustability, contradicting the idea that they are unchangeable and only automatically configured."
        }
      ],
      "concept": "Distinction between Preferences (global settings) and User Profiles (specific settings)",
      "difficulty": "medium",
      "explanation_en": "The correct answer accurately reflects the text's definition of 'Preferences' as global settings that apply across all user profiles and persist regardless of which profile is active. Distractors propose incorrect scopes, functions, or alterability for these settings.",
      "explanation_mn": "Зөв хариулт нь 'Тохиргоо (Preferences)'-г бүх хэрэглэгчийн профайлд хамаарах, идэвхтэй профайлаас үл хамааран хадгалагддаг ерөнхий тохиргоо гэсэн текстийн тодорхойлолтыг зөв тусгасан байна. Буруу хариултууд нь эдгээр тохиргооны хүрээ, үүрэг, эсвэл өөрчлөх боломжийн талаар буруу ойлголтыг өгдөг.",
      "question_number": 3,
      "page_reference": "100-150"
    },
    {
      "question_en": "According to the provided documentation for the Oinc system, what is the primary reason for strictly configuring the country setting to match the server's legal residence?",
      "question_mn": "Өгөгдсөн Oinc системийн баримт бичгийн дагуу, серверийн хууль ёсны оршин суугаа газартай тохирох улсын тохиргоог чанд тохируулах үндсэн шалтгаан юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Ensuring compliance with local tax laws and avoiding legal penalties due to the system's automatic tax information retrieval.",
          "text_mn": "Системийн татварын мэдээллийг автоматаар татаж авдаг онцлогоос шалтгаалан орон нутгийн татварын хууль тогтоомжийг дагаж мөрдөх, хуулийн хариуцлагаас зайлсхийх.",
          "is_correct": true,
          "source": "Primary Context",
          "explanation": "The text explicitly states: 'Using the server in any other country than the one specified may be illegal. The Oinc system operates under the tax laws of the country in which the server resides and retrieves tax information automatically from government web Sites. Therefore you need to specify the legal residence of the server site.' This highlights legal and tax compliance as the primary reason." 
        },
        {
          "id": "B",
          "text_en": "Optimizing the system's record retrieval speed by aligning with the geographical location of most user profiles.",      
          "text_mn": "Ихэнх хэрэглэгчийн профайлын газарзүйн байршилтай уялдуулж, системийн бүртгэл татаж авах хурдыг оновчтой болгох.",      
          "is_correct": false,
          "source": "Primary Context",
          "explanation": "While record retrieval speed is mentioned regarding general default settings, the specific warning for country settings is not tied to user profiles or speed, but to legal and tax implications. The text also notes country settings remain unchanged across profiles."
        },
        {
          "id": "C",
          "text_en": "Ensuring compatibility with various local hardware configurations and peripheral devices commonly used in that region.",
          "text_mn": "Тус бүс нутагт түгээмэл ашиглагддаг янз бүрийн орон нутгийн техник хангамжийн тохиргоо болон нэмэлт төхөөрөмжүүдтэй нийцтэй байдлыг хангах.",
          "is_correct": false,
          "source": "Primary Context",
          "explanation": "The provided text does not mention hardware or peripheral device compatibility as a reason for the country setting configuration."
        },
        {
          "id": "D",
          "text_en": "Allowing users to customize their individual application preferences and display languages based on their current residence.",
          "text_mn": "Хэрэглэгчдэд одоогийн оршин суугаа газраасаа хамааран өөрсдийн аппликешны тохиргоо болон дэлгэцийн хэлийг тохируулах боломжийг олгох.",
          "is_correct": false,
          "source": "Primary Context",
          "explanation": "The text states that 'These settings will remain unchanged even if you switch to using another profile,' indicating it's a system-wide setting not related to individual user preferences or display languages, which are not mentioned."
        }
      ],
      "concept": "Critical configuration of country settings for legal and tax compliance based on server location",
      "difficulty": "medium",
      "explanation_en": "The provided text clearly states that the country setting must match the server's legal residence because 'Using the server in any other country than the one specified may be illegal' and 'The Oinc system operates under the tax laws of the country in which the server resides and retrieves tax information automatically from government web Sites.' This directly points to legal and tax compliance as the critical reasons. Other options like record retrieval speed (mentioned in a different context about general default settings), hardware compatibility, or individual user preferences (which the text says are unaffected by profile switches) are not the primary reasons for this specific country setting requirement.",
      "explanation_mn": "Өгөгдсөн текстэнд улсын тохиргоо нь серверийн хууль ёсны оршин суугаа газартай таарч байх ёстойг тодорхой заасан, учир нь 'Серверийг заасан улсаас өөр улсад ашиглах нь хууль бус байж болно' мөн 'Oinc систем нь серверийн байрладаг улсын татварын хуулиар үйл ажиллагаагаа явуулж, засгийн газрын вэб сайтаас татварын мэдээллийг автоматаар татаж авдаг.' Энэ нь хууль, татварын зохицуулалтыг гол шалтгаан гэдгийг шууд илтгэж байна. Бүртгэл татаж авах хурд (үндсэн тохиргооны өөр нэг нөхцөлд дурдагдсан), техник хангамжийн нийцтэй байдал, эсвэл хувийн хэрэглэгчийн тохиргоо (профайл солих үед өөрчлөгддөггүй гэж текстэнд дурдсан) зэрэг бусад сонголтууд нь энэхүү улсын тохиргооны шаардлагын үндсэн шалтгаан биш юм.",
      "question_number": 4,
      "page_reference": "100-150"
    },
    {
      "question_en": "According to the documentation guidelines, for which of the following scenarios should a 'Warning' notice be used?",    
      "question_mn": "Баримт бичгийн удирдамжийн дагуу, дараах тохиолдлуудаас алинд нь 'Анхааруулга' (Warning) мэдэгдлийг ашиглах ёстой вэ?", 
      "choices": [
        {
          "id": "A",
          "text_en": "Alerting users that using the server in a country different from the specified setting could be illegal due to tax laws.",
          "text_mn": "Серверийг заасан тохиргооноос өөр улсад ашиглах нь татварын хуулийн улмаас хууль бус байж болзошгүйг хэрэглэгчдэд анхааруулах.",
          "is_correct": true,
          "source": "Primary Context, FIGURE 3.8 Warnings",
          "explanation": "The text explicitly states that 'Warnings' are used when users face a risk of 'breaking the law,' and provides the example: 'Using the server in any other country than the one specified may be illegal' due to tax laws."
        },
        {
          "id": "B",
          "text_en": "Notifying users that manually changing default settings might significantly decrease record retrieval speed.",
          "text_mn": "Анхдагч тохиргоог гараар өөрчлөх нь бүртгэл сэргээх хурдыг мэдэгдэхүйц бууруулж болзошгүйг хэрэглэгчдэд мэдэгдэх.",     
          "is_correct": false,
          "source": "Primary Context, FIGURE 3.7 Cautions Notices",
          "explanation": "This scenario is described as a 'Caution' in the text (Figure 3.7), which helps users solve problems, rather than a 'Warning' for risks like data loss, equipment damage, or breaking the law."
        },
        {
          "id": "C",
          "text_en": "Instructing users to configure the country setting to match the program's residence for proper functionality.",
          "text_mn": "Програмын зөв ажиллагааг хангахын тулд улсын тохиргоог програмын байршилтай тохируулахыг хэрэглэгчдэд зааварчлах.",     
          "is_correct": false,
          "source": "Primary Context, Preferences tab Country selection",
          "explanation": "This is an instruction or a preference setting for proper program functionality, not a 'Warning' about a direct risk of data loss, equipment damage, or legal issues, although the *consequence* of not following it (as described in the actual warning) can be illegal."
        },
        {
          "id": "D",
          "text_en": "Advising document creators to use cross-references and links to add detail to manuals and help systems.",
          "text_mn": "Баримт бичиг үүсгэгчдэд гарын авлага болон тусламжийн системд дэлгэрэнгүй мэдээлэл нэмэхийн тулд харилцан ишлэл болон холбоос ашиглахыг зөвлөх.",
          "is_correct": false,
          "source": "Primary Context, Other opportunities for adding detail",
          "explanation": "This refers to general guidelines for enhancing documentation, not to the application of 'Warning' notices for user risks."
        }
      ],
      "concept": "Application of Warning notices for risks such as data loss, equipment damage, or legal issues",
      "difficulty": "medium",
      "explanation_en": "The documentation clearly defines 'Warnings' as notices used when users face a risk of losing data, damaging equipment, or breaking the law. The primary context provides a specific example of this: warning users about the illegality of using a server in a country different from the specified setting due to tax laws. Other options refer to 'Cautions' for performance issues, general instructions for settings, or tips for improving documentation, none of which align with the defined purpose of a 'Warning' for immediate, severe risks.",     
      "explanation_mn": "Баримт бичигт 'Анхааруулга' (Warnings) гэдэг нь хэрэглэгч өгөгдөл алдах, тоног төхөөрөмж гэмтээх эсвэл хууль зөрчих эрсдэлтэй тулгарах үед ашигладаг мэдэгдэл болохыг тодорхой заасан байдаг. Эхний нөхцөл байдалд үүний тодорхой жишээг өгсөн бөгөөд энэ нь серверийг заасан тохиргооноос өөр улсад татварын хуулийн улмаас ашиглах нь хууль бус байж болзошгүйг хэрэглэгчдэд анхааруулах явдал юм. Бусад сонголтууд нь гүйцэтгэлийн асуудалд зориулсан 'Анхааруулга' (Cautions), ерөнхий тохиргооны заавар, эсвэл баримт бичгийг сайжруулах зөвлөмжүүд бөгөөд эдгээр нь ноцтой эрсдэлд зориулсан 'Анхааруулга'-ын тодорхойлсон зорилготой нийцэхгүй.",
      "question_number": 5,
      "page_reference": "100-150"
    },
    {
      "question_en": "Which of the following are explicitly listed as opportunities for adding detail to manuals and help systems?",
      "question_mn": "Гарын авлага, тусламжийн системд дэлгэрэнгүй мэдээлэл нэмэх боломжуудад дараах зүйлсээс аль нь тодорхой дурдагдсан бэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Cross-references, icons, and examples",
          "text_mn": "Хоорондын холбоос, дүрс тэмдэг, жишээ",
          "is_correct": true,
          "source": "Primary Context",
          "explanation": "The primary context explicitly lists 'Cross-references and links,' 'Icons,' and 'Examples' as 'Other opportunities for adding detail to manuals and help systems.'"
        },
        {
          "id": "B",
          "text_en": "Default settings, preferences, and country settings",
          "text_mn": "Анхдагч тохиргоо, таталбар, улсын тохиргоо",
          "is_correct": false,
          "source": "Primary Context",
          "explanation": "These are discussed as software settings that users might interact with, not elements for adding detail to the manual itself."
        },
        {
          "id": "C",
          "text_en": "Caution notices, warning messages, and error logs",
          "text_mn": "Анхааруулгын мэдэгдэл, сэрэмжлүүлэг, алдааны бүртгэл",
          "is_correct": false,
          "source": "Primary Context",
          "explanation": "While caution and warning notices are types of content in a manual, they are not categorized as 'elements for adding detail' in the same way as icons or examples. Error logs are system outputs, not manual elements."
        },
        {
          "id": "D",
          "text_en": "Bold style headings, simple tables, and complex tables",
          "text_mn": "Тод гарчиг, энгийн хүснэгт, нарийн хүснэгт",
          "is_correct": false,
          "source": "Primary Context",
          "explanation": "These are guidelines for formatting and presenting information within tables and headings, rather than distinct elements for adding detail like cross-references or graphics."
        }
      ],
      "concept": "Elements for adding detail to manuals and help systems, including cross-references, icons, and examples",
      "difficulty": "medium",
      "explanation_en": "The primary context directly lists 'Cross-references and links,' 'Icons,' 'Graphics showing program concepts,' 'Keystroke combinations,' 'Examples,' 'References to other sections of the manual,' and 'Footnotes' as 'Other opportunities for adding detail to manuals and help systems.' Option A includes three of these explicitly mentioned elements.",
      "explanation_mn": "Үндсэн контентэд 'Гарын авлага, тусламжийн системд дэлгэрэнгүй мэдээлэл нэмэх бусад боломжууд'-д 'Хоорондын холбоос ба холбоосууд', 'Дүрс тэмдэг', 'Програмын ойлголтыг харуулсан график', 'Товчлуурын хослол', 'Жишээ', 'Гарын авлагын бусад хэсгүүдийн лавлагаа', 'Зүүлт тайлбар' зэрэг багтдаг гэж тодорхой дурдсан байна. Тиймээс А хувилбар нь эдгээр тодорхой дурдагдсан элементүүдийн гурвыг багтаасан байна.",
      "question_number": 6,
      "page_reference": "100-150"
    },
    {
      "question_en": "According to the provided guidelines for technical documentation, which of the following is a specific recommendation for designing and presenting tables within procedures?",
      "question_mn": "Өгөгдсөн техникийн баримт бичгийн удирдамжийн дагуу, дараах зүйлсээс аль нь процедурыг ашиглан хүснэгтийг зохион бүтээх, танилцуулахад тавигдах тодорхой зөвлөмж вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Keep tables simple by using columns and bold style headings, and for more complex tables, add a rule under the headings.",
          "text_mn": "Хүснэгтийг энгийн байлгахын тулд багана болон тод маягийн гарчгийг ашиглах, мөн илүү нарийн төвөгтэй хүснэгтүүдийн хувьд гарчгийн доор зураас нэмэх.",
          "is_correct": true,
          "source": "Primary Context",
          "explanation": "The guidelines explicitly state: 'Keep tables simple. Start with columns and bold style headings for a simple table. For more complex tables, add a rule under the headings.'"
        },
        {
          "id": "B",
          "text_en": "Incorporate highly detailed footnotes within each table cell to minimize the need for external cross-references.",      
          "text_mn": "Хүснэгтийн нүд бүрт өндөр нарийвчлалтай зүүлт оруулах нь гадаад хөндлөн ишлэлийн хэрэгцээг багасгана.",
          "is_correct": false,
          "source": "Distractor",
          "explanation": "This contradicts the guideline to 'Keep tables simple' and is not a specific recommendation for table design within procedures in the context provided. While footnotes are mentioned generally, they are not specified for *within* table cells to avoid cross-references."
        },
        {
          "id": "C",
          "text_en": "Utilize italics for all table headings and subheadings to ensure clear differentiation from body text.",
          "text_mn": "Хүснэгтийн бүх гарчиг, дэд гарчгийг налуу үсгээр бичиж, үндсэн текстээс тодорхой ялгах.",
          "is_correct": false,
          "source": "Distractor",
          "explanation": "The guidelines specifically recommend using 'bold style headings,' not italics, for tables."
        },
        {
          "id": "D",
          "text_en": "Prioritize decorative borders, background shading, and varied font styles to enhance the table's visual appeal and user engagement.",
          "text_mn": "Хүснэгтийн харагдах байдлыг сайжруулж, хэрэглэгчийн оролцоог нэмэгдүүлэхийн тулд гоёл чимэглэлийн хүрээ, дэвсгэр өнгө, олон янзын фонтын хэв маягийг чухалчлах.",
          "is_correct": false,
          "source": "Distractor",
          "explanation": "This contradicts the primary guideline to 'Keep tables simple' and focuses on aesthetic elements not mentioned as specific recommendations for tables in procedures within the context."
        }
      ],
      "concept": "Guidelines for designing and presenting tables effectively within procedures, emphasizing simplicity and clarity",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly states, 'Keep tables simple. Start with columns and bold style headings for a simple table. For more complex tables, add a rule under the headings.' This directly supports option A. Options B, C, and D suggest practices that either contradict the given guidelines (like using italics instead of bold for headings, or prioritizing decorative elements over simplicity) or introduce elements not specified for table design within procedures in this context (like highly detailed footnotes within cells to avoid cross-references, which goes against simplicity).",
      "explanation_mn": "Үндсэн контекстэд \"Хүснэгтийг энгийн байлга. Энгийн хүснэгтэд багана болон тод маягийн гарчгийг ашигла. Илүү нарийн төвөгтэй хүснэгтүүдийн хувьд гарчгийн доор зураас нэм\" гэж тодорхой заасан байдаг. Энэ нь А сонголтыг шууд дэмжинэ. В, С, Д сонголтууд нь өгөгдсөн удирдамжтай зөрчилдсөн (жишээлбэл, гарчгийг тодоор бичихийн оронд налуу үсгээр бичих, эсвэл энгийн байдлаас илүү гоёл чимэглэлийн элементүүдийг чухалчлах) эсвэл энэ контекстэд процедурын хүснэгтийн загварт тусгагдаагүй элементүүдийг (жишээлбэл, хөндлөн ишлэлийг зайлсхийхийн тулд нүдний дотор маш нарийн зүүлт оруулах нь энгийн байдалд харш) санал болгож байна.",
      "question_number": 7,
      "page_reference": "100-150"
    },
    {
      "question_en": "Based on the provided documentation regarding user profiles and system settings, what is true about preferences set on the Preferences page?",
      "question_mn": "Өгөгдсөн баримт бичгийн дагуу хэрэглэгчийн профайл болон системийн тохиргооны талаар, Preferences хуудсан дээр хийсэн тохиргоонуудын талаарх үнэн зөв мэдээлэл юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Each user profile allows for completely distinct preference settings, which activate upon profile selection.",
          "text_mn": "Хэрэглэгчийн профайл бүр өөр өөр тохиргоог хийх боломж олгодог бөгөөд профайлыг сонгоход идэвхждэг.",
          "is_correct": false,
          "source": "Page 71",
          "explanation": "This contradicts the documentation which states that preferences are common for all profiles and remain unchanged when switching profiles."
        },
        {
          "id": "B",
          "text_en": "Preferences are global settings that apply uniformly across all user profiles and remain constant regardless of the active profile.",
          "text_mn": "Preferences нь бүх хэрэглэгчийн профайлд жигд хэрэгжих нийтлэг тохиргоо бөгөөд идэвхтэй профайлаас үл хамааран тогтмол хэвээр байна.",
          "is_correct": true,
          "source": "Page 71",
          "explanation": "The documentation explicitly states: 'On the Preferences page you can set properties which are common for all your user profiles. These settings will remain unchanged even if you switch to using another profile.'"
        },
        {
          "id": "C",
          "text_en": "User profiles are primarily designed to manage personalized preferences, with each profile storing its own unique configuration.",
          "text_mn": "Хэрэглэгчийн профайлууд нь хувийн тохиргоог удирдах зорилготой бөгөөд профайл бүр өөрийн гэсэн өвөрмөц тохиргоог хадгалдаг.",
          "is_correct": false,
          "source": "Page 71",
          "explanation": "This is incorrect. The documentation clarifies that preferences are common across all profiles, not unique to each."
        },
        {
          "id": "D",
          "text_en": "Switching between user profiles will automatically load a new set of preferences tailored to the selected profile.",    
          "text_mn": "Хэрэглэгчийн профайлуудын хооронд шилжихэд сонгосон профайлд тохируулсан шинэ тохиргоо автоматаар ачааллана.",
          "is_correct": false,
          "source": "Page 71",
          "explanation": "The text states 'These settings will remain unchanged even if you switch to using another profile,' directly contradicting this option."
        }
      ],
      "concept": "Process and benefits of creating user profiles for managing different user settings and data sets",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly states, \"On the Preferences page you can set properties which are common for all your user profiles. These settings will remain unchanged even if you switch to using another profile.\" This indicates that preferences configured on this page are global and not specific to individual user profiles, thus remaining constant regardless of the profile in use.",
      "explanation_mn": "Үндсэн контекстэд \"Preferences хуудсан дээр та бүх хэрэглэгчийн профайлд нийтлэг шинж чанаруудыг тохируулах боломжтой. Та өөр профайл руу шилжсэн ч эдгээр тохиргоо өөрчлөгдөхгүй хэвээр байна\" гэж тодорхой заасан. Энэ нь тухайн хуудсан дээр тохируулсан preferences нь нийтлэг бөгөөд хувь хэрэглэгчийн профайлд хамаарахгүй, тиймээс ашиглаж буй профайлаас үл хамааран тогтмол хэвээр байна гэсэн үг юм.",
      "question_number": 8,
      "page_reference": "100-150"
    },
    {
      "question_en": "According to the provided guidelines for software documentation, what is a primary function of \"Caution\" and \"Warning\" notices?",
      "question_mn": "Өгөгдсөн програм хангамжийн баримт бичгийн удирдамжийн дагуу, \"Анхааруулга\" (Caution) болон \"Сэрэмжлүүлэг\" (Warning) тэмдэглэгээний үндсэн үүрэг юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To help users solve problems and alert them to risks such as data loss, equipment damage, or legal non-compliance.",    
          "text_mn": "Хэрэглэгчдэд асуудлыг шийдвэрлэхэд туслах, мөн мэдээлэл алдагдах, тоног төхөөрөмж гэмтэх эсвэл хууль зөрчих зэрэг эрсдэлээс сэрэмжлүүлэх.",
          "is_correct": true,
          "source": "Figure 3.7 and Figure 3.8",
          "explanation": "The text explicitly states: 'Notices of caution can help users solve problems when using the software' (Figure 3.7) and 'Use warnings when users face a risk of losing data, damaging equipment, or, in this case, breaking the law' (Figure 3.8)."
        },
        {
          "id": "B",
          "text_en": "To provide a comprehensive list of all available software features and functionalities.",
          "text_mn": "Програм хангамжийн бүх боломжит функц, үйл ажиллагааны иж бүрэн жагсаалтыг гаргах.",
          "is_correct": false,
          "source": "N/A",
          "explanation": "While documentation lists features, this is not the specific role of caution or warning notices as described in the provided text."
        },
        {
          "id": "C",
          "text_en": "To summarize the key concepts discussed in the preceding chapter or section.",
          "text_mn": "Өмнөх бүлэг эсвэл хэсэгт хэлэлцсэн гол ойлголтуудыг нэгтгэн дүгнэх.",
          "is_correct": false,
          "source": "N/A",
          "explanation": "Summaries serve this purpose, not typically caution or warning notices."
        },
        {
          "id": "D",
          "text_en": "To guide users through the initial installation process for the software.",
          "text_mn": "Програм хангамжийг анх суулгах үйл явцыг хэрэглэгчдэд зааварчлах.",
          "is_correct": false,
          "source": "N/A",
          "explanation": "Installation guides or setup instructions handle the installation process, though cautions might appear within them. The primary role of a caution/warning is not the guidance of the entire installation itself."
        }
      ],
      "concept": "Role of Notes and Tips in providing supplementary information and guiding users through complex steps",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly defines the roles of 'Caution' and 'Warning' notices. Figure 3.7 states that 'Notices of caution can help users solve problems when using the software.' Figure 3.8 further clarifies that 'Warnings Use warnings when users face a risk of losing data, damaging equipment, or, in this case, breaking the law.' These statements directly support option A as the correct answer, as they highlight the role of these notices in problem-solving and risk mitigation. The other options describe general aspects of documentation but do not accurately reflect the specific function of cautions and warnings as presented in the text.",
      "explanation_mn": "Үндсэн контекс нь 'Анхааруулга' (Caution) болон 'Сэрэмжлүүлэг' (Warning) тэмдэглэгээний үүргийг тодорхойлсон байдаг. Зураг 3.7-д 'Анхааруулгын тэмдэглэлүүд нь програм хангамжийг ашиглах үед хэрэглэгчдэд асуудлыг шийдвэрлэхэд тусалдаг' гэж заасан. Зураг 3.8-д 'Мэдээлэл алдагдах, тоног төхөөрөмж гэмтэх эсвэл энэ тохиолдолд хууль зөрчих эрсдэлтэй үед сэрэмжлүүлэг ашиглана' гэж тодруулсан. Эдгээр мэдэгдлүүд нь А сонголтыг зөв хариулт гэдгийг шууд баталж, эдгээр тэмдэглэгээний асуудал шийдвэрлэх, эрсдэлийг бууруулах үүргийг онцолж байна. Бусад сонголтууд нь баримт бичгийн ерөнхий талуудыг тайлбарлаж байгаа боловч өгөгдсөн текстэнд дурдсан анхааруулга, сэрэмжлүүлгийн тодорхой үүргийг үнэн зөв илэрхийлэхгүй.",
      "question_number": 9,
      "page_reference": "100-150"
    },
    {
      "question_en": "According to the documentation guidelines provided, why is it important to follow specific formatting rules for elements like tables when creating procedural instructions?",
      "question_mn": "Өгөгдсөн баримтжуулалтын удирдамжийн дагуу, процедурын зааварчилгааг үүсгэхдээ хүснэгт зэрэг элементүүдийн тодорхой форматлах дүрмийг дагаж мөрдөх нь яагаад чухал вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To maintain consistency and simplicity, which helps users easily interpret and navigate procedural steps, especially with structured data like tables.",
          "text_mn": "Тууштай байдал, хялбар байдлыг хадгалах, ингэснээр хэрэглэгчид процедурын алхмуудыг, ялангуяа хүснэгт зэрэг бүтэцтэй мэдээллийг хялбархан ойлгож, ашиглахад тусална.",
          "is_correct": true,
          "source": "Page 72",
          "explanation": "The guidelines emphasize following specific rules for tables ('Keep tables simple. Start with columns and bold style headings for a simple table. For more complex tables, add a rule under the headings.') to ensure clarity and user-friendliness within procedures. This directly supports the importance of consistency and simplicity for user comprehension."
        },
        {
          "id": "B",
          "text_en": "To ensure compliance with tax laws, as the Oinc system automatically retrieves tax information based on documentation style.",
          "text_mn": "Татварын хууль тогтоомжийг дагаж мөрдөх, учир нь Oinc систем нь баримтжуулалтын хэв маягт тулгуурлан татварын мэдээллийг автоматаар татаж авдаг.",
          "is_correct": false,
          "explanation": "The text mentions tax laws in relation to the server's country setting and legal residence, not the formatting of procedural tables."
        },
        {
          "id": "C",
          "text_en": "To prevent a significant decrease in record retrieval speed, which can occur if incorrect settings are applied to docntation.",
          "text_mn": "Бичиг баримтын буруу тохиргоог хэрэглэвэл бичиг баримтын таталтын хурд ихээхэн буурахаас сэргийлэх.",
          "is_correct": false,
          "explanation": "The text warns against changing default *software settings* manually as it can affect record retrieval speed, not about the consistent formatting of procedural documentation."
        },
        {
          "id": "D",
          "text_en": "To adhere strictly to a policy of using only minimal text and avoiding any visual aids or structured elements in procedures.",
          "text_mn": "Зөвхөн хамгийн бага текстийг ашиглах, процедурт ямар нэгэн харааны хэрэгсэл эсвэл бүтэцтэй элементүүдээс зайлсхийх бодлогыг хатуу баримтлах.",
          "is_correct": false,
          "explanation": "The text explicitly provides guidelines for using tables and other visual aids (icons, graphics, examples), contradicting the idea of avoiding them entirely. The emphasis is on *simple* and *consistent* formatting, not absence."
        }
      ],
      "concept": "Importance of consistency in choosing and applying procedural formats for instructions",
      "difficulty": "medium",
      "explanation_en": "The primary context states, \"You should follow the guidelines for tables presented in Chapter 11, but also observe some specific guidelines for using them in procedures: Keep tables simple. Start with columns and bold style headings for a simple table. For more complex tables, add a rule under the headings.\" This emphasizes the importance of consistent, clear, and simple formatting for procedural elements like tables to aid user comprehension and navigation. Distractors discuss other aspects mentioned in the text (tax laws, software performance, general documentation elements) but do not address the specific importance of consistent procedural formatting.",   
      "explanation_mn": "Үндсэн агуулгад \"Та 11-р бүлэгт үзүүлсэн хүснэгтийн удирдамжийг дагаж мөрдөхөөс гадна, тэдгээрийг процедурт ашиглахын тулд зарим нэг тодорхой удирдамжийг дагаж мөрдөх ёстой: Хүснэгтийг энгийн байлга. Энгийн хүснэгтэд багана, тод гарчиг ашиглана. Илүү нарийн төвөгтэй хүснэгтэд гарчгийн доор зураас нэмнэ.\" гэж заасан байна. Энэ нь хэрэглэгчийн ойлголт, чиглүүлэгт туслах үүднээс хүснэгт зэрэг процедурын элементүүдийг тууштай, тодорхой, энгийнээр форматлахын чухал ач холбогдлыг онцолж байна. Бусад сонголтууд нь текстэнд дурдагдсан бусад талуудыг (татварын хууль, програм хангамжийн гүйцэтгэл, ерөнхий баримтжуулалтын элементүүд) хэлж байгаа боловч процедурын форматын тууштай байдлын тодорхой ач холбогдлыг хөндөөгүй байна.",
      "question_number": 10,
      "page_reference": "100-150"
    }
  ]
}