{
  "total_generated": 10,
  "mcqs": [
    {
      "question_en": "What does Figure 11.2 emphasize regarding design elements?",
      "question_mn": "Зураг 11.2 нь дизайны элементүүдийн талаар юуг онцолж байна вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Overall document design.",
          "text_mn": "Баримт бичгийн ерөнхий дизайн.",
          "is_correct": false,
          "source": "Primary Context",
          "explanation": "The text states Figure 11.2 focuses on page design *instead of* document design."
        },
        {
          "id": "B",
          "text_en": "Principles of screen design.",
          "text_mn": "Дэлгэцийн дизайны зарчмууд.",
          "is_correct": false,
          "source": "Primary Context",
          "explanation": "Figure 11.3, not 11.2, carries concepts into screen design."
        },
        {
          "id": "C",
          "text_en": "Elements of page design.",
          "text_mn": "Хуудасны дизайны элементүүд.",
          "is_correct": true,
          "source": "Primary Context",
          "explanation": "Figure 11.2 explicitly draws attention to elements of page design, distinguishing them from document design."
        },
        {
          "id": "D",
          "text_en": "Workplace solution examples.",
          "text_mn": "Ажлын байрны шийдлийн жишээнүүд.",
          "is_correct": false,
          "source": "Primary Context",
          "explanation": "Workplace solutions are an outcome mentioned, not the design elements Figure 11.2 emphasizes."       
        }
      ],
      "concept": "Distinction between Page Design and Document Design",
      "difficulty": "easy",
      "explanation_en": "The primary context clearly states that Figure 11.2 draws attention to elements of page design, contrasting it with document design.",
      "explanation_mn": "Үндсэн агуулгад Зураг 11.2 нь хуудасны дизайны элементүүдэд анхаарал хандуулж, түүнийг баримт бичгийн дизайнтай харьцуулж байгааг тодорхой дурдсан.",
      "question_number": 1,
      "page_reference": "379-412"
    },
    {
      "question_en": "Which of the following is a key element of page design?",
      "question_mn": "Дараахын аль нь хуудасны дизайны гол элемент вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Version control",
          "text_mn": "Хувилбарын хяналт",
          "is_correct": false,
          "source": "N/A",
          "explanation": "Version control is a document management process, not an element of page design."
        },
        {
          "id": "B",
          "text_en": "Glossary",
          "text_mn": "Тайлбар толь",
          "is_correct": false,
          "source": "N/A",
          "explanation": "A glossary is a section within a document, not a fundamental element of page layout design."
        },
        {
          "id": "C",
          "text_en": "Margins",
          "text_mn": "Хуудасны заагууд",
          "is_correct": true,
          "source": "Page 351",
          "explanation": "The inverted text in Figure 11.2 explicitly lists 'margins, space, rulers, columns, and headings' as elements of page design."
        },
        {
          "id": "D",
          "text_en": "Content accuracy",
          "text_mn": "Агуулгын үнэн зөв байдал",
          "is_correct": false,
          "source": "N/A",
          "explanation": "Content accuracy relates to the information's correctness, not the physical page layout."
        }
      ],
      "concept": "Key Elements of Page Design (e.g., two-column format, margins, headings, white space)",
      "difficulty": "easy",
      "explanation_en": "The primary context, specifically the inverted text within Figure 11.2 on page 351, states: 'This page shows you the elements of page design: margins, space, rulers, columns, and headings.' Therefore, margins are a key element of page design.",
      "explanation_mn": "Эхэн дэх контекст, ялангуяа 351-р хуудасны Зураг 11.2 доорх урвуу текстэнд: 'Энэ хуудас нь хуудасны дизайны элементүүд болох хуудасны заагууд, зай, шугам, багана, гарчгуудыг харуулж байна' гэж дурдсан байдаг. Иймээс хуудасны заагууд нь хуудасны дизайны гол элемент юм.",
      "question_number": 2,
      "page_reference": "379-412"
    },
    {
      "question_en": "Which of the following is a key element that helps define communication spaces in screen design?",       
      "question_mn": "Дэлгэцийн загварт харилцааны зайг тодорхойлоход тусалдаг гол элементүүдийн нэг нь юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Toolbars",
          "text_mn": "Багаж самбар",
          "is_correct": true,
          "source": "Figure 11.3 callout",
          "explanation": "Toolbars are explicitly mentioned as helping to define communication spaces in screen design."       
        },
        {
          "id": "B",
          "text_en": "Footnotes",
          "text_mn": "Хөл тайлбар",
          "is_correct": false,
          "source": "General Knowledge",
          "explanation": "Footnotes are supplementary notes, typically not a key element for defining screen communication spaces."
        },
        {
          "id": "C",
          "text_en": "Tables",
          "text_mn": "Хүснэгт",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Tables are used to organize and present data, not primarily to define communication spaces."
        },
        {
          "id": "D",
          "text_en": "Paragraphs",
          "text_mn": "Догол мөр",
          "is_correct": false,
          "source": "General Knowledge",
          "explanation": "Paragraphs are units of text, not primary elements for defining communication spaces in screen design."
        }
      ],
      "concept": "Key Elements of Screen Design (e.g., toolbars, content panes, headings, vertical spacing)",
      "difficulty": "easy",
      "explanation_en": "The primary context states that \"Toolbars and content pane tabs help define the communication spaces\" in screen design.",
      "explanation_mn": "Үндсэн контекстэд \"Багаж самбар болон агуулгын самбарын таб нь харилцааны зайг тодорхойлоход тусалдаг\" гэж заасан байдаг.",
      "question_number": 3,
      "page_reference": "379-412"
    },
    {
      "question_en": "What do page design elements primarily help users do?",
      "question_mn": "Хуудасны дизайны элементүүд хэрэглэгчдэд юунд голлон тусалдаг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Present detailed material.",
          "text_mn": "Нарийвчилсан материалыг танилцуулах.",
          "is_correct": false,
          "source": "Page 352",
          "explanation": "While documentation presents material, the primary user benefit of page design elements focuses on navigation and understanding, not just presentation."
        },
        {
          "id": "B",
          "text_en": "Emphasize typographical style.",
          "text_mn": "Бичиг үсгийн хэв маягийг тодотгох.",
          "is_correct": false,
          "source": "Page 352",
          "explanation": "This is a function of specific elements like headings, not the primary user-focused goal of page design as a whole."
        },
        {
          "id": "C",
          "text_en": "Navigate and understand information.",
          "text_mn": "Мэдээллийг удирдан чиглүүлж, ойлгох.",
          "is_correct": true,
          "source": "Page 351",
          "explanation": "Figure 11.2 explicitly states that page design elements help people navigate, understand, and use information effectively."
        },
        {
          "id": "D",
          "text_en": "Define communication regions.",
          "text_mn": "Харилцааны бүсүүдийг тодорхойлох.",
          "is_correct": false,
          "source": "Page 352",
          "explanation": "Toolbars and content pane tabs help define communication spaces, but this is a structural element, not the overarching user benefit."
        }
      ],
      "concept": "Role of User Analysis in Planning Page and Screen Layout",
      "difficulty": "easy",
      "explanation_en": "The primary context, specifically Figure 11.2 on page 351, highlights that page design elements are created to help users navigate, understand, and effectively use information, thereby easing the reading experience and leading to workplace solutions.",
      "explanation_mn": "Үндсэн контекст, ялангуяа 351-р хуудасны Зураг 11.2-т хуудасны дизайны элементүүдийг хэрэглэгчдэд мэдээллийг удирдан чиглүүлж, ойлгож, үр дүнтэй ашиглахад туслах, ингэснээр унших туршлагыг хөнгөвчилж, ажлын байрны шийдлүүдийг бий болгох зорилгоор бүтээсэн болохыг онцолсон.",
      "question_number": 4,
      "page_reference": "379-412"
    },
    {
      "question_en": "Which two activities are core to document layout?",
      "question_mn": "Баримт бичгийн байршлын үндсэн хоёр үйл ажиллагаа юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Formatting text and proofreading.",
          "text_mn": "Текст хэлбэржүүлэх, эх хянаж унших.",
          "is_correct": false,
          "source": "Related Context (General knowledge)",
          "explanation": "While formatting is related to type design, proofreading is an editing task, not a core activity of document layout."
        },
        {
          "id": "B",
          "text_en": "Creating content and editing grammar.",
          "text_mn": "Агуулга үүсгэх, хэл зүйг засах.",
          "is_correct": false,
          "source": "Related Context (General knowledge)",
          "explanation": "These are part of document creation and revision processes, not the core layout activities described in the text."
        },
        {
          "id": "C",
          "text_en": "Developing toolbars and using graphics.",
          "text_mn": "Багаж самбар хөгжүүлэх, график ашиглах.",
          "is_correct": false,
          "source": "Related Context (Toolbars and content pane tabs mentioned for screen, graphics are content)",
          "explanation": "Developing toolbars relates to screen design, and using graphics is about content elements, not the fundamental activities of document layout itself."
        },
        {
          "id": "D",
          "text_en": "Designing page layout and designing type.",
          "text_mn": "Хуудасны байршил болон үсгийн загварыг зохион бүтээх.",
          "is_correct": true,
          "source": "Primary context (Figure 11.2 callouts); Related context (Headings and typographical emphasis)",
          "explanation": "The text discusses 'elements of page design' and highlights 'typographical emphasis' through headings, indicating these are core to document layout."
        }
      ],
      "concept": "Two Core Activities of Document Layout: Designing Page Layout and Designing Type",
      "difficulty": "easy",
      "explanation_en": "The primary context highlights 'elements of page design' and discusses the 'physical elements of the page' like margins and columns, which are central to page layout. The related context explicitly mentions 'Headings give a typographical emphasis to the pages,' which directly relates to designing type. Thus, designing page layout and designing type are the two core activities.",
      "explanation_mn": "Үндсэн контекст нь 'хуудасны дизайны элементүүдийг' онцолж, маржин, багана зэрэг 'хуудасны физик элементүүдийг' хэлэлцдэг бөгөөд эдгээр нь хуудасны байршлын гол хэсэг юм. Холбогдох контекст нь 'Гарчигууд хуудсанд үсгийн онцлогийг өгдөг' гэж тодорхой дурдсан нь үсгийн загварыг зохион бүтээхтэй шууд холбогдоно. Тиймээс хуудасны байршил болон үсгийн загварыг зохион бүтээх нь баримт бичгийн байршлын үндсэн хоёр үйл ажиллагаа юм.",
      "question_number": 5,
      "page_reference": "379-412"
    },
    {
      "question_en": "What is a primary goal of page layout design?",
      "question_mn": "Хуудасны зохион байгуулалтын дизайны гол зорилго юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Adapting designs for screens.",
          "text_mn": "Дэлгэцийн загварыг тохируулах.",
          "is_correct": false,
          "source": null,
          "explanation": "Screen design applies page design concepts to a different medium (screens), but it's not the primary goal of page layout design itself."
        },
        {
          "id": "B",
          "text_en": "Determining document content.",
          "text_mn": "Баримт бичгийн агуулгыг тодорхойлох.",
          "is_correct": false,
          "source": null,
          "explanation": "Document design focuses on content and structure, which is distinct from page design's focus on visual arrangement."
        },
        {
          "id": "C",
          "text_en": "Developing software solutions.",
          "text_mn": "Програм хангамжийн шийдлүүдийг боловсруулах.",
          "is_correct": false,
          "source": null,
          "explanation": "While good page layout can lead to workplace solutions with software, its direct purpose is not to develop the software solutions themselves."
        },
        {
          "id": "D",
          "text_en": "Arranging elements for reading ease.",
          "text_mn": "Уншихыг хялбар болгохын тулд элементүүдийг байрлуулах.",
          "is_correct": true,
          "source": "Page 351",
          "explanation": "The text states that page design elements combine to ease the reading experience and ensure usability, readability, and appeal."
        }
      ],
      "concept": "Definition of Page Layout Design: Arranging words and images for maximum usability",
      "difficulty": "easy",
      "explanation_en": "The primary context emphasizes that page layout design focuses on combining physical elements to ease the reading experience and enhance usability, aligning with arranging words and images effectively for the reader.",
      "explanation_mn": "Үндсэн контекст нь хуудасны зохион байгуулалтын дизайн нь уншихыг хялбар болгох, хэрэглэхэд хялбар байдлыг нэмэгдүүлэхийн тулд физик элементүүдийг нэгтгэхэд анхаардаг бөгөөд энэ нь уншигчдад үгс болон зургийг үр дүнтэй байрлуулахтай нийцдэг.",
      "question_number": 6,
      "page_reference": "379-412"
    },
    {
      "question_en": "What does type design determine for text elements?",
      "question_mn": "Үсгийн загвар нь текстийн элементүүдийн юуг тодорхойлдог вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Font, size, style, and formatting",
          "text_mn": "Фонт, хэмжээ, хэв маяг, формат",
          "is_correct": true,
          "source": "Page 351",
          "explanation": "The text on page 351 explicitly defines type design as determining font, size, style, and formatting for text elements."
        },
        {
          "id": "B",
          "text_en": "Toolbars and content tabs",
          "text_mn": "Хэрэгслийн самбар, агуулгын таб",
          "is_correct": false,
          "source": "Page 352",
          "explanation": "Toolbars and content tabs are elements of screen design, not type design."
        },
        {
          "id": "C",
          "text_en": "Page margins and columns",
          "text_mn": "Хуудасны зай, багана",
          "is_correct": false,
          "source": "Page 351",
          "explanation": "Margins and columns are elements of page layout, not specifically type design."
        },
        {
          "id": "D",
          "text_en": "Overall document flow",
          "text_mn": "Баримт бичгийн ерөнхий урсгал",
          "is_correct": false,
          "source": "N/A",
          "explanation": "Type design focuses on the appearance of text elements, not the overall flow of the entire document."
        }
      ],
      "concept": "Definition of Type Design: Determining font, size, style, and formatting for text elements",
      "difficulty": "easy",
      "explanation_en": "Type design is specifically defined in the primary context as determining the font, size, style, and formatting of text elements. The other options refer to different aspects of page or screen design.",
      "explanation_mn": "Үсгийн загвар нь текстийн фонт, хэмжээ, хэв маяг, форматыг тодорхойлох явдал гэж үндсэн контекстэд тодорхойлсон байдаг. Бусад сонголтууд нь хуудас эсвэл дэлгэцийн дизайны өөр өөр талуудыг хэлдэг.",
      "question_number": 7,
      "page_reference": "379-412"
    },
    {
      "question_en": "What outcome does combining physical page elements primarily aim to achieve?",
      "question_mn": "Хуудасны физик элементүүдийг хослуулах нь юун түрүүнд ямар үр дүнд хүрэхийг зорьдог вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To ease the reading experience.",
          "text_mn": "Уншихад хялбар болгох.",
          "is_correct": true,
          "source": "Page 351",
          "explanation": "The text explicitly states that physical elements of the page combine 'to ease the reading experience'."
        },
        {
          "id": "B",
          "text_en": "To show screen design differences.",
          "text_mn": "Дэлгэцийн загварын ялгааг харуулах.",
          "is_correct": false,
          "source": "Page 351",
          "explanation": "Figure 11.3 carries concepts into screen design, but it's not the purpose of combining physical elements on a page."
        },
        {
          "id": "C",
          "text_en": "To emphasize document design.",
          "text_mn": "Баримт бичгийн загварыг онцлох.",
          "is_correct": false,
          "source": "Page 351",
          "explanation": "Figure 11.2 draws attention to page design elements instead of document design."
        },
        {
          "id": "D",
          "text_en": "To list design guidelines.",
          "text_mn": "Загварын удирдамжийг жагсаах.",
          "is_correct": false,
          "source": "Page 351",
          "explanation": "Figure 11.4 lists guidelines, but this is not the primary aim of combining page elements."
        }
      ],
      "concept": "Constraints Affecting Page and Screen Design (e.g., user types, experience, resources)",
      "difficulty": "easy",
      "explanation_en": "The primary context explicitly states that the physical elements of a page combine \"to ease the reading experience\" for users, which is a key constraint or goal in design.",
      "explanation_mn": "Үндсэн контекстэд хуудасны физик элементүүд нь хэрэглэгчдийн \"унших туршлагыг хялбарчлах\" зорилгоор хосолдог бөгөөд энэ нь дизайны гол хязгаарлалт эсвэл зорилго юм.",
      "question_number": 8,
      "page_reference": "379-412"
    },
    {
      "question_en": "What is a primary goal of page and screen layout?",
      "question_mn": "Хуудас болон дэлгэцийн байршлын үндсэн зорилго юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Organizing detailed material.",
          "text_mn": "Нарийвчилсан материалыг зохион байгуулах.",
          "is_correct": false,
          "source": "Page 352",
          "explanation": "Organizing detailed material is mentioned as a specific function of tables, not the primary goal of page and screen layout in general."
        },
        {
          "id": "B",
          "text_en": "Easing the reading experience.",
          "text_mn": "Мэдээллийг уншихад хялбар болгох.",
          "is_correct": true,
          "source": "Page 351",
          "explanation": "The primary context states that physical elements of the page combine 'to ease the reading experience'."
        },
        {
          "id": "C",
          "text_en": "Focusing on document design.",
          "text_mn": "Баримт бичгийн дизайнд анхаарах.",
          "is_correct": false,
          "source": "Page 351",
          "explanation": "The text distinguishes between page design and document design, implying they are not the same primary goal for page layout."
        },
        {
          "id": "D",
          "text_en": "Highlighting typographical emphasis.",
          "text_mn": "Үсгийн загварын онцлогийг тодотгох.",
          "is_correct": false,
          "source": "Page 352",
          "explanation": "Highlighting typographical emphasis is a function of specific elements like headings, not the overarching primary goal of page and screen layout."
        }
      ],
      "concept": "Primary Goals of Page and Screen Layout: Overcoming design problems, meeting dynamic needs, supporting task orientation",
      "difficulty": "easy",
      "explanation_en": "The text highlights that page elements combine to \"ease the reading experience,\" which is a core objective of page and screen layout. Other options refer to document design, specific functions of headings, or functions of tables, rather than the primary goal of the overall layout.",
      "explanation_mn": "Текстэнд хуудасны элементүүд нь \"унших мэдрэмжийг хөнгөвчлөх\" зорилготой нэгддэг гэж онцолсон нь хуудас болон дэлгэцийн байршлын гол зорилго юм. Бусад сонголтууд нь баримт бичгийн дизайн, гарчгуудын тодорхой үүрэг эсвэл хүснэгтийн үүргийг хэлдэг боловч байршлын үндсэн зорилго биш юм.",
      "question_number": 9,
      "page_reference": "379-412"
    },
    {
      "question_en": "What do the guidelines in Figure 11.4 primarily focus on?",
      "question_mn": "Зураг 11.4 дээрх удирдамжууд юун дээр голчлон анхаардаг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Organizing data in tables",
          "text_mn": "Мэдээллийг хүснэгтээр зохион байгуулах",
          "is_correct": false,
          "source": "Page 352",
          "explanation": "While organizing data in tables is mentioned in the related context, it is not the primary focus of the guidelines in Figure 11.4."
        },
        {
          "id": "B",
          "text_en": "Defining communication spaces",
          "text_mn": "Харилцааны зайг тодорхойлох",
          "is_correct": false,
          "source": "Page 352",
          "explanation": "Defining communication spaces with toolbars and tabs is discussed in the related context, but Figure 11.4 focuses on broader design guidelines."
        },
        {
          "id": "C",
          "text_en": "Designing pages and screens",
          "text_mn": "Хуудас болон дэлгэц зохион бүтээх",
          "is_correct": true,
          "source": "Page 351",
          "explanation": "Figure 11.4 explicitly lists the guidelines for designing pages and screens."
        },
        {
          "id": "D",
          "text_en": "Applying typographical emphasis",
          "text_mn": "Үсгийн хэлбэрээр онцлох",
          "is_correct": false,
          "source": "Page 352",
          "explanation": "Applying typographical emphasis through headings is part of page design details in the related context, not the overarching guidelines for designing pages and screens as outlined in Figure 11.4."
        }
      ],
      "concept": "Guidelines for Designing Pages and Screens: A systematic process (e.g., user analysis, page grids, thumbnail sketches)",
      "difficulty": "easy",
      "explanation_en": "Figure 11.4 explicitly lists the guidelines for designing pages and screens, covering systematic steps like user analysis and creating page grids.",
      "explanation_mn": "Зураг 11.4 нь хэрэглэгчийн дүн шинжилгээ, хуудасны сүлжээг үүсгэх зэрэг системчилсэн алхамуудыг багтаасан хуудас болон дэлгэц зохион бүтээх удирдамжуудыг тодорхой жагсаасан байна.",
      "question_number": 10,
      "page_reference": "379-412"
    }
  ]
}