{
  "total_generated": 10,
  "mcqs": [
    {
      "question_en": "When prioritizing user adoption and practical application in software documentation, which characteristic best embodies the principle of focusing on functionality rather than technical functions, as seen in exemplary manuals?",     
      "question_mn": "Програм хангамжийн баримт бичигт хэрэглэгчийн ашиглалт, практик хэрэглээг нэн тэргүүнд тавихдаа, техникийн функцээс илүүтэйгээр үйл ажиллагаанд (functionality) төвлөрөх зарчмыг шилдэг гарын авлагуудад хэрхэн тусгасан байдаг вэ?",   
      "choices": [
        {
          "id": "A",
          "text_en": "Structuring content with a primary focus on the program's underlying technical architecture and detailed API specifications to support advanced system integration.",
          "text_mn": "Програмын суурь техникийн архитектур болон API-н нарийвчилсан тодорхойлолтод голлон анхаарсан агуулгын бүтэцтэй байх нь дэвшилтэт системийн интеграцийг дэмжих зорилготой.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This choice focuses on technical architecture and API specifications, which are aspects of 'functions' rather than 'functionality' from a user's perspective. While important for developers, it contradicts the principle of prioritizing user-centric practical application."
        },
        {
          "id": "B",
          "text_en": "Rigorously detailing every available program function and parameter through exhaustive reference lists, ensuring absolute completeness for all potential user scenarios.",
          "text_mn": "Програмын боломжит бүх функц, параметрийг бүрэн дүүрэн жагсаалтаар нарийвчлан тайлбарлаж, хэрэглэгчийн бүх боломжит хувилбарт бүрэн байдлыг хангах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This option emphasizes completeness of 'functions' and parameters, which can be overwhelming and does not prioritize 'functionality' (how to use it) for a typical user. The goal is to facilitate use, not just list everything."  
        },
        {
          "id": "C",
          "text_en": "Employing complex sentence structures and a highly formal vocabulary to convey technical precision and authority, establishing the document as a definitive technical reference.",
          "text_mn": "Нарийн төвөгтэй өгүүлбэрийн бүтэц, өндөр албан ёсны үг хэллэгийг ашиглан техникийн нарийн тодорхойлолт, эрх мэдлийг илэрхийлж, баримт бичгийг эцсийн техникийн лавлагаа болгон тогтоох.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This choice describes an approach that would hinder ease of reading and understanding for many users. The primary context highlights 'informal diction' and active voice to increase clarity, which directly opposes complex, formal language."
        },
        {
          "id": "D",
          "text_en": "Presenting an operational overview that emphasizes user actions and practical program use over intricate technical details, significantly enhancing clarity and direct applicability for the user.",
          "text_mn": "Техникийн нарийн ширийн зүйлээс илүүтэйгээр хэрэглэгчийн үйлдлүүд болон програмын практик хэрэглээг онцолсон үйл ажиллагааны ерөнхий тоймыг танилцуулж, хэрэглэгчид зориулсан ойлгомжтой байдал, шууд хэрэглээг ихээхэн сайжруулах.",   
          "is_correct": true,
          "source": "Page 384",
          "explanation": "The correct answer directly reflects the guiding principle of 'Focus on Functionality Rather than Functions,' as exemplified in the provided text. The manual's operational overview 'emphasizes program use instead of technical details' and ensures 'sentences focus on user actions instead of program functions.' This approach makes the documentation highly practical and user-centric, enabling users to understand how to achieve their goals with the software rather than merely knowing what the software's components are."
        }
      ],
      "concept": "Focus on Functionality Rather than Functions in documentation",
      "difficulty": "hard",
      "explanation_en": "The correct answer directly reflects the guiding principle of 'Focus on Functionality Rather than Functions,' as exemplified in the provided text. The manual's operational overview 'emphasizes program use instead of technical details' and ensures 'sentences focus on user actions instead of program functions.' This approach makes the documentation highly practical and user-centric, enabling users to understand *how* to achieve their goals with the software rather than merely knowing *what* the software's components are. The distractors describe valid, but inappropriate, approaches for this specific principle, either by focusing on technical depth for developers, exhaustive functional lists, or a formal style that would hinder user adoption.",
      "explanation_mn": "Зөв хариулт нь өгөгдсөн текстийн жишээн дээр үндэслэн \"Функцээс илүүтэйгээр үйл ажиллагаанд (Functionality) төвлөрөх\" удирдамж зарчмыг шууд тусгаж байна. Гарын авлагын үйл ажиллагааны тойм нь \"техникийн нарийн ширийн зүйлээс илүү програмын хэрэглээг онцолж,\" \"өгүүлбэрүүд нь програмын функцээс илүү хэрэглэгчийн үйлдлүүдэд төвлөрсөн\" байдаг. Энэ арга барил нь баримт бичгийг маш практик, хэрэглэгчдэд чиглэсэн болгож, хэрэглэгчдэд програмын бүрэлдэхүүн хэсгүүдийг мэдэхээс илүүтэйгээр програм ашиглан зорилгодоо хэрхэн хүрэхээ ойлгоход тусалдаг. Буруу хариултууд нь энэхүү зарчимд тохирохгүй, тухайлбал хөгжүүлэгчдэд зориулсан техникийн гүнзгийрүүлсэн мэдээлэл, функцийг бүрэн жагсаах, эсвэл хэрэглэгчийн хэрэглээг хязгаарлах албан ёсны хэв маягийг тодорхойлж байна.",
      "question_number": 1,
      "page_reference": "413-434"
    },
    {
      "question_en": "When designing documentation to facilitate user adaptation of software to job-specific tasks, what is the most effective approach for presenting information?",
      "question_mn": "Програм хангамжийг хэрэглэгчийн ажлын онцлогт нийцүүлэн баримтжуулахдаа мэдээллийг хэрхэн танилцуулах нь хамгийн үр дүнтэй арга вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "An exhaustive reference guide categorizing every feature and parameter, ensuring users can find specific functionalities quickly through a highly structured indexing system.",
          "text_mn": "Бүх онцлог, параметрүүдийг ангилсан иж бүрэн лавлах гарын авлага нь өндөр зохион байгуулалттай индексжүүлэлтийн системээр дамжуулан хэрэглэгчдэд тодорхой функцүүдийг хурдан олоход тусалдаг.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While structured reference guides are valuable for looking up specific information, they don't inherently guide users through tasks or help them adapt software to job roles as effectively as an operational, task-oriented approach."
        },
        {
          "id": "B",
          "text_en": "A system-oriented model meticulously detailing underlying software architecture and comprehensive program functions to support advanced customization and debugging capabilities.",
          "text_mn": "Системийн суурь архитектур болон програмын иж бүрэн функцүүдийг нарийн ширийнээр тайлбарласан системд чиглэсэн загвар нь дэвшилтэт тохируулга, алдааг олж засварлах боломжийг дэмждэг.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This describes a system-oriented approach, which, while useful for developers or advanced administrators, is less effective for end-users seeking to adapt software to job-specific tasks. It focuses on internal workings rather than user application."
        },
        {
          "id": "C",
          "text_en": "A minimalist design focusing solely on core program commands and graphical interface elements, reducing the need for extensive textual explanations or complex examples.",
          "text_mn": "Зөвхөн програмын үндсэн командуудад болон график интерфэйсийн элементүүдэд төвлөрсөн минималист загвар нь өргөн хүрээтэй тайлбар эсвэл нарийн төвөгтэй жишээнүүдийн хэрэгцээг бууруулдаг.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "A minimalist design can be effective for very simple, intuitive software. However, for complex software that needs to be adapted to job-specific tasks, reducing extensive explanations and examples would hinder user understanding and practical application."
        },
        {
          "id": "D",
          "text_en": "An operational overview emphasizing program use and user actions, prioritizing practical applications over technical details to enhance clarity and ease of reading.",
          "text_mn": "Үйл ажиллагааны тоймд програм хангамжийн хэрэглээ, хэрэглэгчийн үйлдлийг онцолж, техникийн нарийн ширийн зүйлээс илүү практик хэрэглээг нэн тэргүүнд тавьснаар ойлгомжтой, уншихад хялбар болгох.",
          "is_correct": true,
          "source": "Page 384",
          "explanation": "The provided context explicitly notes that an 'operational overview emphasizes program use instead of technical details,' and 'Sentences focus on user actions instead of program functions,' while 'Informal diction increases ease of reading.' This aligns with a task-oriented approach, which is most effective for users adapting software to specific jobs."
        }
      ],
      "concept": "Distinction between system-oriented and task-oriented manuals",
      "difficulty": "hard",
      "explanation_en": "The primary context explicitly highlights characteristics of task-oriented documentation, such as an \"operational overview [that] emphasizes program use instead of technical details,\" sentences that \"focus on user actions instead of program functions,\" and \"informal diction [that] increases ease of reading.\" This approach is designed to guide users in accomplishing specific job-related tasks (e.g., analyzing sequences using data files), directly aligning with the goal of facilitating \"user adaptation of software to job-specific tasks.\" System-oriented documentation, in contrast, would delve into the software's internal architecture and comprehensive functions, which is less effective for direct task execution.",        
      "explanation_mn": "Өгөгдсөн эх сурвалжид үүрэг даалгавар төвтэй баримтжуулалтын онцлогийг тодорхой онцолсон байдаг. Тухайлбал, \"үйлдлийн тойм нь техникийн нарийн ширийн зүйлсээс илүүтэй програмын хэрэглээг онцолдог\", \"өгүүлбэрүүд нь програмын функцүүдээс илүү хэрэглэгчийн үйлдлүүдэд төвлөрдөг\", мөн \"энгийн хэллэг нь уншихад хялбар байдлыг нэмэгдүүлдэг\" гэжээ. Энэхүү арга нь хэрэглэгчдэд ажлын байрны тодорхой үүрэг даалгавруудыг (жишээлбэл, өгөгдлийн файлуудыг ашиглан дарааллыг шинжлэх) гүйцэтгэхэд чиглүүлэх зорилготой бөгөөд энэ нь \"програм хангамжийг хэрэглэгчийн ажлын онцлогт нийцүүлэх\" зорилготой шууд нийцдэг. Системд чиглэсэн баримтжуулалт нь програм хангамжийн дотоод архитектур болон иж бүрэн функцүүдийг тайлбарладаг бөгөөд энэ нь шууд үүрэг гүйцэтгэхэд бага үр дүнтэй юм.",
      "question_number": 2,
      "page_reference": "413-434"
    },
    {
      "question_en": "What is the most significant advantage of structuring software documentation around user actions rather than merely listing program functions?",
      "question_mn": "Програм хангамжийн баримт бичгийг зөвхөн програмын функцүүдийг жагсаахаас илүүтэйгээр хэрэглэгчийн үйлдлүүдэд суурилан бүтэцжүүлэхийн хамгийн чухал давуу тал юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "It ensures comprehensive technical accuracy, detailing every internal process for advanced troubleshooting and system maintenance.",
          "text_mn": "Энэ нь нарийн төвөгтэй алдааг олж засварлах, системийн засвар үйлчилгээнд зориулж дотоод үйл явц бүрийг нарийвчлан харуулж, техникийн иж бүрэн нарийвчлалыг баталгаажуулна.",
          "is_correct": false,
          "source": null,
          "explanation": "The primary context explicitly states that 'Sentences focus on user actions instead of program functions' and 'This operational overview emphasizes program use instead of technical details.' This approach directly supports users in understanding how to utilize the software to achieve their specific objectives and tasks, making the documentation immediately practical and relevant. By focusing on 'program use,' it helps users integrate the software into their workflow efficiently. The other options describe potential benefits of good documentation practices but do not capture the core advantage of user action-oriented writing over program function listing."
        },
        {
          "id": "B",
          "text_en": "It facilitates easier software updates by clearly mapping documentation sections to underlying code structures for developers.",
          "text_mn": "Энэ нь баримт бичгийн хэсгүүдийг хөгжүүлэгчдэд зориулсан үндсэн кодын бүтэцтэй тодорхой уялдуулснаар програм хангамжийн шинэчлэлтийг хялбаршуулна.",
          "is_correct": false,
          "source": null,
          "explanation": "The primary context explicitly states that 'Sentences focus on user actions instead of program functions' and 'This operational overview emphasizes program use instead of technical details.' This approach directly supports users in understanding how to utilize the software to achieve their specific objectives and tasks, making the documentation immediately practical and relevant. By focusing on 'program use,' it helps users integrate the software into their workflow efficiently. The other options describe potential benefits of good documentation practices but do not capture the core advantage of user action-oriented writing over program function listing."
        },
        {
          "id": "C",
          "text_en": "It enables users to rapidly apply the software to their specific tasks by understanding how to achieve goals, not just what the software does.",
          "text_mn": "Энэ нь хэрэглэгчдэд програмын юу хийдгийг бус, харин зорилгодоо хэрхэн хүрэхээ ойлгосноор програм хангамжийг тодорхой ажлууддаа хурдан ашиглах боломжийг олгоно.",
          "is_correct": true,
          "source": "Page 384",
          "explanation": "The primary context explicitly states that 'Sentences focus on user actions instead of program functions' and 'This operational overview emphasizes program use instead of technical details.' This approach directly supports users in understanding how to utilize the software to achieve their specific objectives and tasks, making the documentation immediately practical and relevant. By focusing on 'program use,' it helps users integrate the software into their workflow efficiently. The other options describe potential benefits of good documentation practices but do not capture the core advantage of user action-oriented writing over program function listing."
        },
        {
          "id": "D",
          "text_en": "It simplifies the authoring process by standardizing descriptive language, reducing ambiguity across different program modules.",
          "text_mn": "Энэ нь тайлбарлах хэллэгийг стандартчилан, програмын янз бүрийн модулиудын хоорондох хоёрдмол утгыг бууруулснаар зохиомжлох үйл явцыг хялбаршуулна.",
          "is_correct": false,
          "source": null,
          "explanation": "The primary context explicitly states that 'Sentences focus on user actions instead of program functions' and 'This operational overview emphasizes program use instead of technical details.' This approach directly supports users in understanding how to utilize the software to achieve their specific objectives and tasks, making the documentation immediately practical and relevant. By focusing on 'program use,' it helps users integrate the software into their workflow efficiently. The other options describe potential benefits of good documentation practices but do not capture the core advantage of user action-oriented writing over program function listing."
        }
      ],
      "concept": "Writing about user actions instead of program functions",
      "difficulty": "hard",
      "explanation_en": "The primary context explicitly highlights that \"Sentences focus on user actions instead of program functions\" and \"This operational overview emphasizes program use instead of technical details.\" This approach directly supports users in understanding *how* to utilize the software to achieve their specific objectives and tasks, making the documentation immediately practical and relevant. By focusing on \"program use,\" it helps users integrate the software into their workflow efficiently. The other options describe potential benefits of good documentation practices but do not capture the core advantage of *user action-oriented writing* over *program function listing*.",
      "explanation_mn": "Өгөгдсөн эх сурвалжид \"Өгүүлбэрүүд програмын функцүүдээс илүүтэйгээр хэрэглэгчийн үйлдлүүдэд төвлөрдөг\" болон \"Энэхүү үйл ажиллагааны тойм нь техникийн нарийн ширийн зүйлсээс илүүтэйгээр програмын хэрэглээг онцолдог\" гэж тодорхой заасан байдаг. Энэхүү арга нь хэрэглэгчдэд програм хангамжийг өөрийн тодорхой зорилго, ажлуудад хэрхэн ашиглахыг ойлгоход шууд дэмжлэг үзүүлж, баримт бичгийг нэн даруй практик бөгөөд хамааралтай болгодог. \"Програмын хэрэглээ\"-нд анхаарлаа хандуулснаар энэ нь хэрэглэгчдэд програм хангамжийг ажлын урсгалдаа үр дүнтэй нэгтгэхэд тусалдаг. Бусад сонголтууд нь сайн баримт бичгийн боломжит ашиг тусыг тайлбарлаж байгаа боловч *хэрэглэгчийн үйлдлүүдэд чиглэсэн бичлэгийн* *програмын функцүүдийг жагсаахаас* илүүтэй гол давуу талыг илэрхийлэхгүй байна.",
      "question_number": 3,
      "page_reference": "413-434"
    },
    {
      "question_en": "In software documentation, which core principle of voice significantly enhances user comprehension and facilitates precise action?",
      "question_mn": "Програм хангамжийн баримт бичигт дуу хоолойн үндсэн зарчмын аль нь хэрэглэгчийн ойлголтыг нэмэгдүүлж, нарийн үйлдлийг хөнгөвчилж өгдөг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Active voice directly attributes actions to the user or system, streamlining instructions and making operational steps immediately clear and actionable.",
          "text_mn": "Идэвхтэй өгүүлбэр нь үйлдлийг хэрэглэгч эсвэл системд шууд хамаатуулж, зааврыг хялбаршуулж, үйлдлийн алхмуудыг ойлгомжтой, хэрэгжүүлэхэд бэлэн болгодог.",
          "is_correct": true,
          "source": "Page 384",
          "explanation": "The primary context states, \"Use of the active voice enhances the clarity.\" Active voice directly clarifies who performs an action, which is essential for user instructions. By focusing on user actions (e.g., \"you run a program,\" \"you can create\"), it makes commands unambiguous and easier to follow, directly facilitating precise action."
        },
        {
          "id": "B",
          "text_en": "Using primarily passive voice ensures that the focus remains on the program's operations rather than user interaction, highlighting system autonomy.",
          "text_mn": "Голчлон идэвхгүй өгүүлбэрийг ашиглах нь анхаарлыг хэрэглэгчийн харилцан үйлчлэлээс илүүтэй програмын үйл ажиллагаанд төвлөрүүлж, системийн бие даасан байдлыг онцолдог.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Software documentation aims to guide users, so focusing on user interaction and actions is generally more effective than solely on program operations. Passive voice deemphasizes the actor, which contradicts the goal of providing clear, actionable instructions for the user."
        },
        {
          "id": "C",
          "text_en": "Passive voice provides a formal, objective tone, which is critical for presenting technical details without implying specific user responsibility or intervention.",
          "text_mn": "Идэвхгүй өгүүлбэр нь албан ёсны, бодитой өнгө аясыг өгдөг бөгөөд энэ нь тодорхой хэрэглэгчийн хариуцлага эсвэл оролцоог илэрхийлэхгүйгээр техникийн дэлгэрэнгүй мэдээллийг танилцуулахад чухал үүрэгтэй.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While passive voice can offer objectivity in certain academic contexts, in software documentation, it generally obscures the actor, making instructions less clear and harder for users to execute. Clarity and action-orientation, not just objectivity, are paramount for users."
        },
        {
          "id": "D",
          "text_en": "Alternating between active and passive voice adds stylistic variety, which helps sustain reader interest when explaining intricate software functionalities.",
          "text_mn": "Идэвхтэй болон идэвхгүй өгүүлбэрийг ээлжлэн ашиглах нь хэв маягийн олон янз байдлыг нэмж, нарийн төвөгтэй програм хангамжийн функцуудыг тайлбарлах үед уншигчийн сонирхлыг татахад тусалдаг.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While stylistic variety can be beneficial in general writing, the primary goal of software documentation is clarity and usability, especially for instructions. Prioritizing stylistic variation over consistent active voice for action-oriented content can introduce ambiguity and hinder user comprehension."
        }
      ],
      "concept": "Importance of active voice for clarity in software documentation",
      "difficulty": "hard",
      "explanation_en": "The primary context explicitly states, \"Use of the active voice enhances the clarity.\" Active voice is crucial in software documentation because it clearly identifies the actor performing an action, which is often the user. By framing sentences to focus on user actions (e.g., \"you run a program,\" \"you can create your own data files\"), it directly instructs the user, making steps unambiguous and facilitating precise execution. This directness prevents confusion about who or what is responsible for an action, thereby improving comprehension and reducing errors.",
      "explanation_mn": "Эх сурвалжид \"Идэвхтэй өгүүлбэр нь ойлгомжтой байдлыг нэмэгдүүлдэг\" гэж тодорхой заасан байдаг. Идэвхтэй өгүүлбэр нь програм хангамжийн баримт бичигт маш чухал, учир нь энэ нь үйлдлийг гүйцэтгэж буй үйлчлэгчийг, ихэвчлэн хэрэглэгчийг тодорхойлдог. Өгүүлбэрүүдийг хэрэглэгчийн үйлдлүүдэд (\"та програм ажиллуулна,\" \"та өөрийн өгөгдлийн файлыг үүсгэж болно\") чиглүүлснээр хэрэглэгчдэд шууд зааварчилгаа өгч, алхмуудыг ойлгомжтой болгож, нарийн гүйцэтгэлийг хөнгөвчилнө. Энэхүү шууд байдал нь ямар нэгэн үйлдлийг хэн эсвэл юу хариуцаж байгаа талаарх төөрөгдлийг арилгаж, улмаар ойлголтыг сайжруулж, алдааг бууруулдаг.",
      "question_number": 4,
      "page_reference": "413-434"
    },
    {
      "question_en": "When an operational overview within software documentation effectively emphasizes program use, what fundamental user benefit does it primarily aim to achieve?",
      "question_mn": "Програм хангамжийн баримт бичгийн үйлдлийн тойм нь програмын хэрэглээг үр дүнтэй онцолж байх үед хэрэглэгчдэд ямар үндсэн ашиг тусыг голчлон олгохыг зорьдог вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "It equips users with detailed troubleshooting steps and diagnostic tools to efficiently resolve common errors and system malfunctions.",
          "text_mn": "Энэ нь хэрэглэгчдэд нийтлэг алдаа болон системийн доголдлыг үр дүнтэй шийдвэрлэхэд зориулсан нарийвчилсан алдааг олж засварлах алхамууд болон оношлогооны хэрэгслүүдийг олгодог.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Troubleshooting is a critical aspect of good documentation, but it typically belongs in dedicated sections or chapters. An *operational overview emphasizing program use* focuses on initiating and performing tasks, not primarily on resolving errors that occur during or after use."
        },
        {
          "id": "B",
          "text_en": "It allows users to quickly understand how to perform tasks without needing deep technical knowledge of the program's internal workings or specific functions.",
          "text_mn": "Энэ нь хэрэглэгчдэд програмын дотоод ажиллагаа эсвэл тодорхой функцүүдийн талаар гүн гүнзгий техникийн мэдлэггүйгээр даалгавруудыг хэрхэн гүйцэтгэхийг хурдан ойлгоход тусалдаг.",
          "is_correct": true,
          "source": "Page 384",
          "explanation": "The text explicitly states that an operational overview 'emphasizes program use instead of technical details' and that 'Sentences focus on user actions instead of program functions.' This direct focus on user actions and practical application enables users to perform tasks effectively without getting bogged down in the underlying technical complexities."
        },
        {
          "id": "C",
          "text_en": "It enables advanced users to customize program settings and integrate the software seamlessly with other system components for optimized performance.",
          "text_mn": "Энэ нь нарийвчилсан хэрэглэгчдэд програмын тохиргоог өөрчлөх, програм хангамжийг бусад системийн бүрэлдэхүүн хэсгүүдтэй жигд нэгтгэж, гүйцэтгэлийг оновчтой болгох боломжийг олгодог.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Customization and integration with other system components are often topics for more advanced documentation or user guides, not the primary focus of an *operational overview* that emphasizes basic *program use* for a broader audience."
        },
        {
          "id": "D",
          "text_en": "It provides a comprehensive listing of all program capabilities and features, allowing users to discover the full potential of the software.",
          "text_mn": "Энэ нь програмын бүх боломж, онцлог шинжүүдийг иж бүрэн жагсааж, хэрэглэгчдэд програм хангамжийн бүрэн боломжийг нээх боломжийг олгодог.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While documentation may list capabilities, the primary aim of an *operational overview emphasizing program use* is not merely to list features, but to guide users on *how* to use them for specific actions and tasks, rather than a comprehensive, potentially overwhelming list of features."
        }
      ],
      "concept": "Role of operational overviews in emphasizing program use",
      "difficulty": "hard",
      "explanation_en": "The primary context explicitly states that an operational overview 'emphasizes program use instead of technical details' and that 'Sentences focus on user actions instead of program functions.' This approach is designed to streamline the user's interaction with the software. By focusing on *what* users need to do and *how* to do it, rather than delving into the intricate technical mechanisms, the documentation empowers users to accomplish their tasks efficiently. This minimizes cognitive load and allows users to quickly become productive without requiring them to become experts in the software's internal architecture, directly addressing the goal of enabling task performance through clear guidance on user actions.",
      "explanation_mn": "Үндсэн нөхцөл байдалд үйлдлийн тойм нь 'техникийн дэлгэрэнгүй мэдээллийн оронд програмын хэрэглээг онцолдог' бөгөөд 'өгүүлбэрүүд нь програмын функцийн оронд хэрэглэгчийн үйлдлүүдэд анхаарлаа хандуулдаг' гэж тодорхой заасан байдаг. Энэ арга нь хэрэглэгчийн програм хангамжтай харилцах харилцааг хялбарчлах зорилготой юм. Хэрэглэгчид *юу хийх*, *хэрхэн хийх*-д анхаарлаа хандуулж, нарийн төвөгтэй техникийн механизмуудад гүнзгий орохгүйгээр баримт бичиг нь хэрэглэгчдэд даалгавраа үр дүнтэй гүйцэтгэх боломжийг олгодог. Энэ нь танин мэдэхүйн ачааллыг багасгаж, хэрэглэгчдэд програм хангамжийн дотоод архитектурын мэргэжилтэн болох шаардлагагүйгээр хурдан үр дүнтэй ажиллах боломжийг олгож, хэрэглэгчийн үйлдлийн талаарх тодорхой удирдамжаар дамжуулан даалгаврыг гүйцэтгэх зорилгод шууд ханддаг.",
      "question_number": 5,
      "page_reference": "413-434"
    },
    {
      "question_en": "What core principle defines the operational utility and user adaptability of external data files within GCG sequence analysis programs?",
      "question_mn": "GCG дарааллын шинжилгээний программуудын хувьд гадаад өгөгдлийн файлуудын ашиг тус, хэрэглэгчийн дасан зохицох чадварыг тодорхойлдог гол зарчим юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Data files fundamentally serve as secure repositories for raw nucleic acid and protein sequences, ensuring their consistent retrieval for various analytical modules.",
          "text_mn": "Өгөгдлийн файлууд нь үндсэндээ түүхий нуклейн хүчил, уургийн дарааллыг аюулгүй хадгалах сан болж, янз бүрийн аналитик модулиудад тогтмол хүртээмжийг баталгаажуулдаг.",
          "is_correct": false,
          "source": "Page 384",
          "explanation": "This is incorrect. The text explicitly states that data files contain 'nonsequence information' that programs use to analyze sequences, distinguishing them from the actual nucleic acid or protein sequences themselves, which are stored in sequence databases or personal sequence files."
        },
        {
          "id": "B",
          "text_en": "Data files primarily manage user interface configurations and store operational metadata, optimizing program performance and offering diagnostic information.",
          "text_mn": "Өгөгдлийн файлууд нь хэрэглэгчийн интерфэйсийн тохиргоог удирдах, үйлдлийн мета өгөгдлийг хадгалахад чухал үүрэгтэй бөгөөд програмын гүйцэтгэлийг оновчтой болгож, алдааг олж тогтооход оношлогооны мэдээлэл өгдөг.",
          "is_correct": false,
          "source": "Page 384",
          "explanation": "This is incorrect. While software often uses files for configuration and logging, the text defines these specific 'data files' as containing 'nonsequence information' pertinent to analyzing actual sequences (e.g., enzyme recognition sites, codon associations), not user interface settings or operational metadata for performance/diagnostics."
        },
        {
          "id": "C",
          "text_en": "External data files deliver crucial non-sequence parameters for sequence analysis, supporting both system-wide defaults and user-defined local modifications for tailored processing.",
          "text_mn": "Гадаад өгөгдлийн файлууд нь дарааллын шинжилгээнд шаардлагатай бус-дарааллын параметрүүдийг хүргэж, системийн хэмжээний анхдагч тохиргоо болон хэрэглэгчийн тодорхойлсон локал өөрчлөлтүүдийг дэмждэг.",
          "is_correct": true,
          "source": "Page 384",
          "explanation": "The passage defines data files as 'nonsequence information' that programs 'use to analyze the sequences.' It further elaborates on their adaptability, describing 'default files' for system-wide use, 'alternative data files' supplied by GCG, and the ability for users to 'create your own data files or copy a default or alternative public data file to your local directory and modify it,' referring to these as 'local data files.' This demonstrates their utility in providing necessary parameters and their adaptability through various customization levels for tailored sequence analysis."
        },
        {
          "id": "D",
          "text_en": "Their primary function is to encapsulate executable program logic and scripts, allowing dynamic adaptation of software functionality based on selected user tasks.",
          "text_mn": "Тэдний үндсэн үүрэг нь гүйцэтгэгдэх програмын логик болон скриптүүдийг нэгтгэх бөгөөд энэ нь хэрэглэгчийн сонгосон даалгаврын дагуу програм хангамжийн ажиллагааг динамикаар дасан зохицуулах боломжийг олгодог.",
          "is_correct": false,
          "source": "Page 384",
          "explanation": "This is incorrect. Data files provide *information* for programs to use, not the executable program logic, scripts, or functions themselves. The text focuses on the data these files supply for analysis, not on how they modify software functionality directly."
        }
      ],
      "concept": "Definition and purpose of data files in software programs",
      "difficulty": "hard",
      "explanation_en": "The correct answer accurately synthesizes the information from the text. The passage defines data files as 'nonsequence information' that programs 'use to analyze the sequences.' It then elaborates on their adaptability, describing 'default files' for system-wide use, 'alternative data files' supplied by GCG, and the ability for users to 'create your own data files or copy a default or alternative public data file to your local directory and modify it,' referring to these as 'local data files.' This demonstrates their utility in providing necessary parameters and their adaptability through various customization levels for tailored sequence analysis.",
      "explanation_mn": "Зөв хариулт нь текстэд өгөгдсөн мэдээллийг нарийн нэгтгэн дүгнэсэн байна. Уг хэсэгт өгөгдлийн файлуудыг программууд 'дарааллыг шинжлэхэд ашигладаг' 'дарааллын бус мэдээлэл' гэж тодорхойлсон. Цаашлаад тэдгээрийн дасан зохицох чадварыг дэлгэрэнгүй тайлбарласан бөгөөд системийн хэмжээний хэрэглээнд зориулсан 'анхдагч файлууд', GCG-ийн нийлүүлдэг 'хувилбар өгөгдлийн файлууд', мөн хэрэглэгчдэд 'өөрийн өгөгдлийн файлуудыг үүсгэх эсвэл анхдагч эсвэл хувилбар олон нийтийн өгөгдлийн файлыг өөрийн локал директор руу хуулж өөрчлөх' боломжтойг дурдсан бөгөөд эдгээрийг 'локал өгөгдлийн файлууд' гэж нэрлэдэг. Энэ нь тэдгээрийн шаардлагатай параметрүүдийг хангах ашиг тус, мөн тусгайлсан дарааллын шинжилгээнд зориулсан янз бүрийн тохируулгын түвшнээр дамжуулан дасан зохицох чадварыг харуулж байна.",
      "question_number": 6,
      "page_reference": "413-434"
    },
    {
      "question_en": "What core principle governs the strategic choice between default, alternative, or user-created local data files for sequence analysis workflows?",
      "question_mn": "Дэлгэрэнгүй дарааллын шинжилгээний ажлын урсгалд анхдагч, өөр хувилбарын эсвэл хэрэглэгчийн үүсгэсэн локал өгөгдлийн файлуудыг сонгох стратегийн үндсэн зарчим юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Prioritizing file accessibility based on public directories for shared resources versus restricted user-specific storage locations for security.",
          "text_mn": "Нийтийн эх сурвалжийн хувьд олон нийтийн сангуудад байгаа файлын хүртээмжийг, харин аюулгүй байдлын үүднээс хэрэглэгчийн тодорхой хадгалах байршлыг тэргүүлэх.",
          "is_correct": false,
          "source": "Related Concept",
          "explanation": "While file location and accessibility are characteristics of these file types, they are not the fundamental principle guiding the *strategic choice* itself. The choice is driven by analytical need and customization, not primarily security or storage type."
        },
        {
          "id": "B",
          "text_en": "Determining if a file already exists within the system or requires manual creation, irrespective of its content or intended analytical application.",
          "text_mn": "Файл системд аль хэдийн байгаа эсвэл түүний агуулга, зорилтот аналитик хэрэглээгээс үл хамааран гараар үүсгэх шаардлагатай эсэхийг тодорхойлох.",
          "is_correct": false,
          "source": "Related Concept",
          "explanation": "This simplifies the decision process too much. While creation or existence is part of using local files, the *strategic choice* across all three types involves considering content, application, and the level of customization needed, not just whether a file exists."
        },
        {
          "id": "C",
          "text_en": "Balancing immediate operational convenience with the escalating need for specialized analytical contexts or complete user-driven data customization.",
          "text_mn": "Үйл ажиллагааны шуурхай тав тухыг тусгай аналитик хэрэгцээ эсвэл хэрэглэгчийн өгөгдлийн бүрэн өөрчлөлттэй тэнцвэржүүлэх.",
          "is_correct": true,
          "source": "Page 384",
          "explanation": "Default files offer convenience for new users; alternative files provide options for specific analytical contexts, and local files allow for full user customization based on unique needs."
        },
        {
          "id": "D",
          "text_en": "Optimizing program execution speed by selecting smaller data files, or ensuring data integrity through system-managed, immutable defaults.",
          "text_mn": "Хөтөлбөрийн ажиллах хурдыг бага хэмжээтэй өгөгдлийн файлуудыг сонгох замаар оновчтой болгох, эсвэл системийн удирдлагатай, өөрчлөгддөггүй анхдагч тохиргоогоор өгөгдлийн бүрэн бүтэн байдлыг хангах.",
          "is_correct": false,
          "source": "Related Concept",
          "explanation": "Program execution speed and data integrity are important considerations in software, but the primary principle for differentiating and choosing these specific data file categories (default, alternative, local) is not centered on these factors."
        }
      ],
      "concept": "Categorization of data files: default, alternative, and local",
      "difficulty": "hard",
      "explanation_en": "The core principle guiding the choice among default, alternative, and local data files involves a strategic assessment of user needs against system capabilities. Default files offer immediate convenience for new users, automatically providing public, standard settings. Alternative files cater to specific analytical requirements, allowing users to choose from GCG-supplied variations for different scenarios. Local files provide the highest degree of customization, enabling users to create entirely new files or modify existing ones to precisely match unique research demands. Therefore, the decision progresses from general ease of use to increasingly specialized and personalized data management, reflecting a balance between system automation and user control over their analytical environment.",
      "explanation_mn": "Анхдагч, өөр хувилбарын болон локал өгөгдлийн файлуудын хоорондох сонголтыг чиглүүлдэг гол зарчим нь хэрэглэгчийн хэрэгцээг системийн чадавхтай стратегийн үнэлгээ хийх явдал юм. Анхдагч файлууд нь шинэ хэрэглэгчдэд шуурхай тав тухыг хангаж, олон нийтийн, стандарт тохиргоог автоматаар өгдөг. Өөр хувилбарын файлууд нь тодорхой аналитик шаардлагыг хангаж, хэрэглэгчдэд GCG-ээс нийлүүлсэн хувилбаруудаас янз бүрийн хувилбаруудад зориулж сонгох боломжийг олгодог. Локал файлууд нь хамгийн өндөр түвшний өөрчлөлт хийх боломжийг олгодог бөгөөд хэрэглэгчдэд огт шинэ файлуудыг үүсгэх эсвэл одоо байгаа файлуудыг өөрийн судалгааны өвөрмөц шаардлагад нарийн тохируулах боломжийг олгодог. Иймээс шийдвэр нь ерөнхий хэрэглээний хялбар байдлаас эхлээд улам илүү мэргэшсэн, хувийн өгөгдлийн удирдлага руу шилжиж, системийн автоматжуулалт болон хэрэглэгчийн аналитик орчноо хянах чадварын тэнцвэрийг харуулдаг.",
      "question_number": 7,
      "page_reference": "413-434"
    },
    {
      "question_en": "When developing user-centric software documentation, what is the primary benefit of employing informal diction and focusing on user actions over technical jargon?",
      "question_mn": "Хэрэглэгчдэд чиглэсэн программ хангамжийн баримт бичгийг боловсруулахдаа албан бус хэллэг хэрэглэх, техникийн нэр томъёоноос илүү хэрэглэгчийн үйлдлүүдэд анхаарлаа хандуулахын үндсэн ашиг тус юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "It significantly improves the searchability and retrievability of information within large documentation sets, making it easier for users to locate specific topics quickly.",
          "text_mn": "Энэ нь том баримт бичгийн цуглуулга дахь мэдээллийн хайлт, олдоцыг ихээхэн сайжруулж, хэрэглэгчдэд тодорхой сэдвүүдийг хурдан олоход хялбар болгодог.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Searchability and retrievability are important, often enhanced by clear structure, metadata, and indexing. While simple language can make content easier to scan, the *primary* benefit of informal diction and user-action focus is not about search algorithms or information architecture but rather the immediate comprehension of the presented material."    
        },
        {
          "id": "B",
          "text_en": "It ensures higher technical accuracy and adherence to strict industry standards, which is crucial for critical system functionality and interoperability.",
          "text_mn": "Энэ нь техникийн өндөр нарийвчлал, салбарын хатуу стандартыг дагаж мөрдөхөд тусалдаг бөгөөд энэ нь системийн чухал үйл ажиллагаа, 상호 ажиллах чадварт нэн чухал юм.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Technical accuracy is vital for any documentation, but informal diction and focusing on user actions do not inherently *ensure* accuracy or adherence to industry standards. Accuracy comes from rigorous fact-checking and expert review, independent of writing style. This distractor focuses on technical precision rather than user-centric communication."   
        },
        {
          "id": "C",
          "text_en": "It streamlines the documentation creation process, reducing the time and resources required for content development and localization efforts.",
          "text_mn": "Энэ нь баримт бичиг үүсгэх процессыг хялбаршуулж, контент боловсруулах болон орон нутагшуулах ажилд шаардагдах хугацаа, нөөцийг багасгадаг.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While clear writing *might* indirectly help in localization by reducing ambiguity, the primary benefit of informal diction and user-focused language is not to streamline the *creation* process itself. This distractor focuses on production efficiency rather than user readability and comprehension."
        },
        {
          "id": "D",
          "text_en": "It directly enhances user comprehension and facilitates practical application by making complex information more accessible and less intimidating for a diverse audience.",
          "text_mn": "Энэ нь хэрэглэгчийн ойлголтыг шууд сайжруулж, нарийн төвөгтэй мэдээллийг илүү хүртээмжтэй, аймшиггүй болгосноор олон төрлийн хэрэглэгчдэд практик хэрэглээг хөнгөвчилдөг.",
          "is_correct": true,
          "source": "Page 384",
          "explanation": "The primary context clearly states that 'Informal diction increases ease of reading' and highlights documentation that 'emphasizes program use instead of technical details' and 'sentences focus on user actions instead of program functions.' These elements directly aim to improve user comprehension and make the software easier to apply, especially for a target audience like scientists, by making complex information accessible."
        }
      ],
      "concept": "Benefits of informal diction and simple writing for readability",
      "difficulty": "hard",
      "explanation_en": "The primary context explicitly states that 'Informal diction increases ease of reading' and emphasizes that the documentation's 'operational overview emphasizes program use instead of technical details' and 'sentences focus on user actions instead of program functions.' These elements collectively contribute to making complex software documentation more accessible and understandable for users, allowing them to grasp concepts and apply the software effectively in their work. The core benefit is enhanced user comprehension and practical application by demystifying technical information. The distractors address other important aspects of documentation (efficiency, accuracy, searchability) but are not the primary benefit derived specifically from informal diction and a user-action focus as described in the context.",
      "explanation_mn": "Үндсэн контекстэд \"Албан бус хэллэг уншихад хялбар байдлыг нэмэгдүүлдэг\" гэж тодорхой заасан бөгөөд баримт бичгийн \"үйл ажиллагааны ерөнхий тойм нь техникийн нарийн ширийн зүйлээс илүү программын хэрэглээг онцолдог\" болон \"өгүүлбэрүүд нь программын функцээс илүү хэрэглэгчийн үйлдлүүдэд анхаарлаа хандуулдаг\" гэдгийг онцолжээ. Эдгээр элементүүд нь нарийн төвөгтэй программ хангамжийн баримт бичгийг хэрэглэгчдэд илүү хүртээмжтэй, ойлгомжтой болгож, тэднийг ойлголтыг таньж, программ хангамжийг үр дүнтэй ашиглахад тусалдаг. Үндсэн ашиг тус нь техникийн мэдээллийг хялбаршуулснаар хэрэглэгчийн ойлголт, практик хэрэглээг сайжруулах явдал юм. Буруу хариултууд нь баримт бичгийн бусад чухал талуудыг (үр ашиг, нарийвчлал, хайлт) хөндсөн боловч контекстэд дурдсан албан бус хэллэг, хэрэглэгчийн үйлдэлд анхаарлаа хандуулахын үндсэн ашиг тус биш юм.",
      "question_number": 8,
      "page_reference": "413-434"
    },
    {
      "question_en": "When designing user-oriented software documentation, which approach best integrates parallel structures for optimal clarity and usability?",
      "question_mn": "Хэрэглэгчид чиглэсэн програм хангамжийн баримт бичгийг зохиохдоо, оновчтой тодорхой байдал, хэрэглээг хангахын тулд ямар арга барил зэрэгцээ бүтцийг хамгийн сайн нэгтгэдэг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Consistently focusing on user actions and program utility, while explicitly aligning paragraph content with its heading for clear, sequential understanding.",
          "text_mn": "Хэрэглэгчийн үйлдэл болон програмын хэрэглээнд тууштай төвлөрч, хэсгийн агуулгыг гарчигтай нь тодорхой уялдуулснаар ойлгомжтой, дараалсан ойлголтыг бий болгох.",
          "is_correct": true,
          "source": "Page 384",
          "explanation": "The correct answer highlights key principles from the text that contribute to parallel structures in a user-oriented style. 'Consistently focusing on user actions and program utility' directly reflects the guidance that documentation should emphasize 'program use instead of technical details' and 'sentences focus on user actions instead of program functions.' 'Explicitly aligning paragraph content with its heading' directly references the example's strength that 'The paragraph ties in clearly with the heading.' These elements together create a consistent, predictable, and user-centric structure that enhances clarity and comprehension, which are hallmarks of effective parallel construction."
        },
        {
          "id": "B",
          "text_en": "Varying sentence structures and vocabulary for reader engagement, while integrating intricate technical diagrams early to provide a complete system architectural overview.",
          "text_mn": "Уншигчийн сонирхлыг татахын тулд өгүүлбэрийн бүтэц, үгийн санг өөрчлөн хэрэглэх, мөн системийн ерөнхий тоймыг өгөхийн тулд нарийн төвөгтэй техникийн зураглалыг эрт оруулах.",
          "is_correct": false,
          "source": null,
          "explanation": "This distractor suggests varying sentence structures, which works against the consistency inherent in effective parallel structures. Integrating intricate technical diagrams early also goes against the user-oriented principle of simplifying information and focusing on use rather than complex technical details, potentially hindering optimal clarity for a user-centric style."
        },
        {
          "id": "C",
          "text_en": "Utilizing informal diction and concise paragraphs for general readability, ensuring all technical terms are defined comprehensively before their first occurrence.",
          "text_mn": "Ерөнхий уншигдах чадварыг сайжруулахын тулд албан бус хэллэг, товч хэсгүүдийг ашиглах, бүх техникийн нэр томъёог анх удаа дурдахаас өмнө бүрэн тодорхойлох.",
          "is_correct": false,
          "source": null,
          "explanation": "While 'informal diction' and 'reasonable length paragraphs' are mentioned in the text as good practices for readability, and defining technical terms is generally good practice, this choice does not specifically address or 'best integrate parallel structures' in a user-oriented style. It focuses on general readability elements rather than the structural and consistent content orientation for parallelism."
        },
        {
          "id": "D",
          "text_en": "Prioritizing detailed program functions and technical specifications, followed by sequential explanations of system implications to ensure comprehensive information for all users.",
          "text_mn": "Дэлгэрэнгүй програмын функцүүд болон техникийн үзүүлэлтүүдэд нэн тэргүүнд анхаарч, дараа нь системийн үр дагаврыг дарааллаар тайлбарлах нь бүх хэрэглэгчдэд иж бүрэн мэдээлэл өгөх.",
          "is_correct": false,
          "source": null,
          "explanation": "This distractor suggests focusing on technical details and program functions, which directly contradicts the primary context's emphasis on program 'use instead of technical details' and 'user actions instead of program functions' for user-oriented documentation. While comprehensive information is valuable, this approach does not prioritize user-oriented parallel structures for clarity."
        }
      ],
      "concept": "Guidelines for building parallel structures in user-oriented style",
      "difficulty": "hard",
      "explanation_en": "The correct answer highlights key principles from the text that contribute to parallel structures in a user-oriented style. 'Consistently focusing on user actions and program utility' directly reflects the guidance that documentation should emphasize 'program use instead of technical details' and 'sentences focus on user actions instead of program functions.' 'Explicitly aligning paragraph content with its heading' directly references the example's strength that 'The paragraph ties in clearly with the heading.' These elements together create a consistent, predictable, and user-centric structure that enhances clarity and comprehension, which are hallmarks of effective parallel construction.",
      "explanation_mn": "Зөв хариулт нь хэрэглэгчид чиглэсэн загварт зэрэгцээ бүтцийг бий болгоход хувь нэмэр оруулдаг үндсэн зарчмуудыг онцолж байна. 'Хэрэглэгчийн үйлдлүүд болон програмын хэрэглээнд тууштай анхаарлаа хандуулах' нь баримт бичигт 'техникийн нарийн ширийн зүйлээс илүү програмын хэрэглээг' онцолж, 'өгүүлбэрүүд нь програмын функцээс илүү хэрэглэгчийн үйлдлүүдэд төвлөрдөг' гэсэн удирдамжийг шууд тусгаж байна. 'Хэсгийн агуулгыг гарчигтайгаа тодорхой уялдаатай байлгах' нь 'Хэсэг нь гарчигтайгаа тодорхой уялдаатай байна' гэсэн жишээний давуу талыг шууд заана. Эдгээр элементүүд нь хамтдаа тодорхой, урьдчилан таамаглахуйц, хэрэглэгч төвтэй бүтцийг бий болгож, энэ нь тодорхой байдал, ойлголтыг нэмэгдүүлдэг бөгөөд үр дүнтэй зэрэгцээ бүтцийн гол шинж тэмдэг юм.",
      "question_number": 9,
      "page_reference": "413-434"
    },
    {
      "question_en": "When developing user-centric software documentation, which principle is fundamental for crafting performance-based sentences that actively guide user interaction and task completion?",
      "question_mn": "Хэрэглэгчид чиглэсэн програм хангамжийн баримт бичгийг боловсруулахдаа, хэрэглэгчийн харилцан үйлчлэл болон даалгавар гүйцэтгэлийг идэвхтэй удирдах гүйцэтгэлд суурилсан өгүүлбэрүүдийг бүтээхэд ямар зарчим үндэс суурь болох вэ?",    
      "choices": [
        {
          "id": "A",
          "text_en": "Streamlining complex technical jargon into concise, simplified terms, enabling quicker comprehension of software processes and underlying system architecture.",
          "text_mn": "Нарийн төвөгтэй техникийн нэр томъёог товч, хялбаршуулсан хэлбэрт оруулах, ингэснээр програм хангамжийн үйл явц болон системийн архитектурыг илүү хурдан ойлгоход тусална.",
          "is_correct": false,
          "source": null,
          "explanation": "While simplifying jargon is a good practice for documentation clarity, it does not directly address the principle of creating *performance-based sentences focused on user actions*. This choice emphasizes comprehension of *processes and architecture* rather than guiding the user through *actions* to complete tasks."
        },
        {
          "id": "B",
          "text_en": "Providing comprehensive explanations of all available program functions and their parameters, allowing users maximum flexibility in configuring advanced operations.",
          "text_mn": "Програмын бүх боломжит функцүүд болон тэдгээрийн параметрүүдийн талаар дэлгэрэнгүй тайлбар өгөх нь хэрэглэгчдэд дэвшилтэт үйлдлүүдийг тохируулахад дээд зэргийн уян хатан байдлыг олгоно.",
          "is_correct": false,
          "source": null,
          "explanation": "This approach, though sometimes necessary for advanced users, contradicts the core principle highlighted in the text, which is to focus on 'program use instead of technical details' and 'user actions instead of program functions.' Comprehensive functional descriptions can overwhelm users and divert focus from task completion."
        },
        {
          "id": "C",
          "text_en": "Ensuring a consistent logical flow and standardized formatting across all documentation sections, which facilitates easier navigation and information retrieval by users.",
          "text_mn": "Баримт бичгийн бүх хэсэгт уялдаа холбоотой логик урсгал, стандартчилсан форматыг баталгаажуулах нь хэрэглэгчдэд хялбар навигаци, мэдээлэл хайхад тусалдаг.",
          "is_correct": false,
          "source": null,
          "explanation": "Consistent logical flow and standardized formatting are vital for overall documentation quality and usability. However, this choice relates to the structural and organizational aspects of documentation, not specifically to the *crafting of performance-based sentences* that guide user interaction and task completion as described in the primary context." 
        },
        {
          "id": "D",
          "text_en": "Prioritizing user actions and active voice to directly instruct on task completion, rather than merely describing software functions or technical details.",
          "text_mn": "Хэрэглэгчийн үйлдлүүд болон идэвхтэй өгүүлбэрийг чухалчилж, програм хангамжийн функц эсвэл техникийн нарийн ширийн зүйлийг тайлбарлахын оронд даалгавар гүйцэтгэхэд шууд зааварчилгаа өгөх.",
          "is_correct": true,
          "source": "Page 384",
          "explanation": "The primary context explicitly states that effective software documentation emphasizes 'program use instead of technical details' and ensures 'sentences focus on user actions instead of program functions.' It also highlights that 'Use of the active voice enhances the clarity.' Therefore, crafting performance-based sentences fundamentally involves instructing the user directly on how to complete tasks using an active voice, rather than merely describing the software's capabilities or internal workings. This approach empowers users by guiding them through actionable steps."
        }
      ],
      "concept": "Creating effective performance-based sentences focusing on user actions",
      "difficulty": "hard",
      "explanation_en": "The primary context explicitly states that effective software documentation emphasizes \"program use instead of technical details\" and ensures \"sentences focus on user actions instead of program functions.\" It also highlights that \"Use of the active voice enhances the clarity.\" Therefore, crafting performance-based sentences fundamentally involves instructing the user directly on how to complete tasks using an active voice, rather than merely describing the software's capabilities or internal workings. This approach empowers users by guiding them through actionable steps. The distractors describe other valuable aspects of good documentation (simplifying jargon, comprehensive functional details for advanced users, and good organization), but they do not capture the specific principle of structuring sentences around direct user actions for task completion, which is the core of performance-based sentence construction.",
      "explanation_mn": "Үндсэн агуулгад програм хангамжийн үр дүнтэй баримт бичиг нь \"техникийн нарийн ширийн зүйлийн оронд програмын хэрэглээг\" чухалчилж, \"өгүүлбэрүүд програмын функцийн оронд хэрэглэгчийн үйлдлүүдэд анхаарлаа хандуулдаг\" гэж тодорхой заасан байдаг. Мөн \"идэвхтэй өгүүлбэр ашиглах нь тодорхой байдлыг нэмэгдүүлдэг\" гэдгийг онцолсон. Иймээс гүйцэтгэлд суурилсан өгүүлбэрүүдийг бүтээх нь програм хангамжийн чадавхийг эсвэл дотоод үйл ажиллагааг зүгээр л тайлбарлахын оронд идэвхтэй өгүүлбэрээр хэрэглэгчдэд даалгаврыг хэрхэн гүйцэтгэх талаар шууд зааварчилгаа өгөх явдал юм. Энэ арга нь хэрэглэгчдийг бодит алхмуудаар удирдан чиглүүлснээр тэднийг чадавхижуулдаг. Бусад хувилбарууд нь сайн баримт бичгийн бусад чухал талуудыг (нэр томъёог хялбарчлах, дэвшилтэт хэрэглэгчдэд зориулсан иж бүрэн функциональ мэдээлэл, сайн зохион байгуулалт) тайлбарлаж байгаа боловч гүйцэтгэлд суурилсан өгүүлбэрийн бүтцийн гол цөм болох даалгавар гүйцэтгэхэд чиглэсэн хэрэглэгчийн шууд үйлдлийн эргэн тойронд өгүүлбэрүүдийг бүтэцлэх тодорхой зарчмыг агуулаагүй болно.",
      "question_number": 10,
      "page_reference": "413-434"
    }
  ]
}
