{
  "total_generated": 10,
  "mcqs": [
    {
      "question_en": "What is the primary purpose of an effectively designed index?",
      "question_mn": "Үр дүнтэй бүтээгдсэн индексийн гол зорилго юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To demonstrate effective orchestration of various kinds of information.",
          "text_mn": "Янз бүрийн мэдээллийг үр дүнтэй зохион байгуулахыг харуулах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Demonstrating orchestration is a feature of a well-designed index, illustrating how it achieves its purpose, rather than being the primary purpose itself."
        },
        {
          "id": "B",
          "text_en": "To serve as a demonstration for uninitiated users to compare elements.",
          "text_mn": "Шинээр хэрэглэгчдэд элементүүдийг харьцуулах жишээ болох.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Serving as a demonstration for new users is a benefit of how an index (or guidelines about indexes) can be utilized for learning, but it is not the fundamental purpose of the index itself."
        },
        {
          "id": "C",
          "text_en": "To help users quickly locate specific sections within a document.",
          "text_mn": "Хэрэглэгчдэд баримт бичгийн тодорхой хэсгүүдийг хурдан олоход туслах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While an index helps locate information, this is a means to an end, not its overarching primary purpose of 'processing information' and 'accommodating various workplace uses.'"
        },
        {
          "id": "D",
          "text_en": "To facilitate easy information processing and diverse workplace applications.",
          "text_mn": "Мэдээллийг хялбар боловсруулах, ажлын байрны янз бүрийн хэрэглээнд нийцүүлэх.",
          "is_correct": true,
          "source": "Page 436",
          "explanation": "The primary context states that an index is 'designed to support easy processing of information and to accommodate a variety of workplace uses.' This directly aligns with facilitating information processing and diverse workplace applications."
        }
      ],
      "concept": "The primary purpose of an index is to support easy information processing and accommodate various workplace uses.",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly states that an index is 'designed to support easy processing of information and to accommodate a variety of workplace uses.' This encompasses the broader goals of an index beyond merely locating text, focusing on how information can be effectively utilized and processed in different professional scenarios. The other options describe features or secondary benefits, not the core design intent.",
      "explanation_mn": "Эх сурвалжид индексийг 'мэдээллийг хялбар боловсруулах, ажлын байрны янз бүрийн хэрэглээнд нийцүүлэх зорилгоор бүтээгдсэн' гэж тодорхой заасан байдаг. Энэ нь зөвхөн текст олохоос гадна индексийн өргөн хүрээний зорилгыг хамарч, мэдээллийг янз бүрийн мэргэжлийн нөхцөл байдалд хэрхэн үр дүнтэй ашиглаж, боловсруулах талаар анхаардаг. Бусад сонголтууд нь онцлог шинж чанар эсвэл хоёрдогч ашиг тусыг тайлбарладаг боловч индексийн үндсэн зорилгыг биш юм.",
      "question_number": 1,
      "page_reference": "466-483"
    },
    {
      "question_en": "Which characteristics best define a user-oriented index like the one in Figure 14.1?",
      "question_mn": "Зураг 14.1 дээрхтэй адил хэрэглэгчдэд чиглэсэн индексийг аль шинж чанарууд хамгийн сайн тодорхойлдог вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Alphabetical organization, concise entries, and a comprehensive list of all terms.",
          "text_mn": "Цагаан толгойн үсгийн дарааллаар ангилагдсан байдал, товч оруулгууд, болон бүх нэр томьёоны иж бүрэн жагсаалт.",
          "is_correct": false,
          "source": null,
          "explanation": "While alphabetical organization is common, the other features listed are not specifically emphasized as defining characteristics of the user-oriented index in Figure 14.1."
        },
        {
          "id": "B",
          "text_en": "Detailed cross-references, abstract summaries, and author names for each entry.",
          "text_mn": "Дэлгэрэнгүй харилцан лавлагаа, хураангуй дүгнэлт, мөн оруулга бүрийн зохиогчийн нэрс.",
          "is_correct": false,
          "source": null,
          "explanation": "These features are not described or demonstrated as key characteristics of the user-oriented index shown in Figure 14.1."
        },
        {
          "id": "C",
          "text_en": "Distinct main headings and subheadings, bracketed menu initials, and clear locator numbers.",
          "text_mn": "Тодорхой үндсэн гарчиг болон дэд гарчигууд, хаалтанд буй цэсийн товчлол, мөн тодорхой байршлын дугаарууд.",
          "is_correct": true,
          "source": "Figure 14.1",
          "explanation": "Figure 14.1 explicitly highlights 'Main headings and subheadings,' 'Menu initials appear in brackets for easy identification,' and 'Locator numbers' as key features of a user-oriented index designed for easy information processing and workplace use."
        },
        {
          "id": "D",
          "text_en": "Automated generation, clickable links, and integration with search algorithms.",
          "text_mn": "Автомат үүсгэлт, дарж болох холбоосууд, мөн хайлтын алгоритмтай нэгдсэн байдал.",
          "is_correct": false,
          "source": null,
          "explanation": "These describe digital functionalities or methods of index creation, not the design features of the index entries themselves as presented for a user-oriented index in Figure 14.1."
        }
      ],
      "concept": "Key features of a user-oriented index include distinct main headings and subheadings, menu initials in brackets, and clear locator numbers.",
      "difficulty": "medium",
      "explanation_en": "The primary context and Figure 14.1 explicitly describe a user-oriented index as featuring distinct main headings and subheadings, menu initials enclosed in brackets, and clear locator numbers. These elements are highlighted as supporting easy information processing and accommodating various workplace uses. Other options describe general index characteristics, digital index functionalities, or features not specific to the user-oriented design demonstrated.",
      "explanation_mn": "Үндсэн контекст болон Зураг 14.1 нь хэрэглэгчдэд чиглэсэн индексийг тодорхой үндсэн гарчиг болон дэд гарчигууд, хаалтанд орсон цэсийн товчлолууд, мөн тодорхой байршлын дугааруудаар тодорхойлсон байдаг. Эдгээр элементүүд нь мэдээллийг хялбар боловсруулах, ажлын байрны янз бүрийн хэрэглээнд тохируулахыг дэмждэг болохыг онцолсон. Бусад хувилбарууд нь индексийн ерөнхий шинж чанар, дижитал индексийн үйл ажиллагаа эсвэл хэрэглэгчдэд чиглэсэн дизайнд хамааралгүй шинж чанаруудыг тайлбарласан болно.",
      "question_number": 2,
      "page_reference": "466-483"
    },
    {
      "question_en": "When planning an indexing strategy, which two fundamental methods are typically employed?",
      "question_mn": "Индексжүүлэлтийн стратеги төлөвлөхдөө үндсэн хоёр ямар аргыг ашигладаг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Manual creation or electronic generation.",
          "text_mn": "Гар аргаар эсвэл цахим хэлбэрээр үүсгэх.",
          "is_correct": true,
          "source": "Page 437",
          "explanation": "The primary context explicitly states that there are two fundamental methods for making an index: manual or electronic. These are the core approaches to an indexing strategy."
        },
        {
          "id": "B",
          "text_en": "Menu initials or soft hyphens integration.",
          "text_mn": "Цэсний эхний үсэг эсвэл зөөлөн зураасыг нэгтгэх.",
          "is_correct": false,
          "source": "Figure 14.1",
          "explanation": "These are specific features or elements that might appear within an index, as illustrated in Figure 14.1, not methods used to create the entire index."
        },
        {
          "id": "C",
          "text_en": "Outline-based or alphabetical sorting.",
          "text_mn": "Тоймчилсон эсвэл цагаан толгойн дарааллаар ангилах.",
          "is_correct": false,
          "source": "",
          "explanation": "These refer to structural or sorting methods for an index, not the fundamental creation methods themselves."
        },
        {
          "id": "D",
          "text_en": "Displaying tabs or modifying line spacing.",
          "text_mn": "Таб харуулах эсвэл мөр хоорондын зайг өөрчлөх.",
          "is_correct": false,
          "source": "Figure 14.1",
          "explanation": "These are document formatting or display options, as might be found in a word processing program's index (Figure 14.1), but they are unrelated to the core methods of index creation."
        }
      ],
      "concept": "Indexes can be created using two main methods: manual or electronic (embedded indexing).",
      "difficulty": "medium",
      "explanation_en": "The primary context directly states that when planning an indexing strategy, there are \"two methods for making an index: manual or electronic.\" This clearly identifies the fundamental approaches to creating an index. The distractors refer to aspects like index structure (B), specific index entry features (C), or general document formatting (D), none of which describe the overarching methods of index creation.",
      "explanation_mn": "Үндсэн текстэнд индексжүүлэлтийн стратеги төлөвлөхдөө \"индекс үүсгэх хоёр арга: гар аргаар эсвэл цахим хэлбэрээр\" гэж тодорхой заасан байдаг. Энэ нь индекс үүсгэх үндсэн арга замыг тодорхойлж байна. Буруу хариултууд нь индексийн бүтэц (В), индексийн бичиглэлийн тодорхой онцлог шинжүүд (С), эсвэл ерөнхий баримт бичгийн форматлах (D) зэрэгтэй холбоотой боловч эдгээр нь индексийг үүсгэх ерөнхий арга биш юм.",
      "question_number": 3,
      "page_reference": "466-483"
    },
    {
      "question_en": "Which statement accurately describes the initial step in creating a manual index?",
      "question_mn": "Гараар индекс үүсгэх эхний алхмыг аль мэдэгдэл зөв тодорхойлж байна вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Orchestrating various kinds of information to support easy processing.",
          "text_mn": "Мэдээллийг хялбар боловсруулахад дэмжлэг үзүүлэх зорилгоор янз бүрийн төрлийн мэдээллийг зохион байгуулах.",
          "is_correct": false,
          "source": "Page 436",
          "explanation": "This describes a general characteristic of a well-designed index (as seen in Figure 14.1), not the specific initial step of manual indexing."
        },
        {
          "id": "B",
          "text_en": "Using software to automatically generate index terms and page numbers.",
          "text_mn": "Индексийн нэр томъёо, хуудасны дугаарыг автоматаар үүсгэхийн тулд програм хангамж ашиглах.",
          "is_correct": false,
          "source": "Page 437",
          "explanation": "This describes electronic indexing, which is contrasted with manual indexing in the text. It is not the initial step for manual indexing."
        },
        {
          "id": "C",
          "text_en": "Comparing one element to another to accommodate a variety of workplace uses.",
          "text_mn": "Ажлын байрны янз бүрийн хэрэглээг хангахын тулд нэг элементийг нөгөөтэй харьцуулах.",
          "is_correct": false,
          "source": "Page 436",
          "explanation": "This refers to the benefit of following guidelines for those uninitiated into indexing, but it does not define the initial step of manual indexing itself."
        },
        {
          "id": "D",
          "text_en": "Physically reviewing the document and writing down index entries.",
          "text_mn": "Баримтыг биечлэн хянаж, индексийн оруулгуудыг бичиж тэмдэглэх.",
          "is_correct": true,
          "source": "Page 437",
          "explanation": "The primary context explicitly states, \"A manual index requires that you go through the document and write index entries on cards or in a docume,\" which directly aligns with physically reviewing the document and recording the entries."
        }
      ],
      "concept": "Manual indexing involves physically reviewing a document, writing down index entries with page numbers, and then organizing them alphabetically.",
      "difficulty": "medium",
      "explanation_en": "The primary context clearly defines manual indexing as a process that \"requires that you go through the document and write index entries on cards or in a docume,\" which directly aligns with physically reviewing the document and writing down index entries. The other options describe electronic indexing, general features of an effective index, or benefits of following indexing guidelines, but not the initial process of manual indexing.",
      "explanation_mn": "Эх сурвалжид гараар индекслэх үйл явцыг \"та баримтыг хянаж, индексийн оруулгуудыг карт эсвэл баримт бичигт бичиж тэмдэглэх шаардлагатай\" гэж тодорхойлсон нь баримтыг биечлэн хянаж, индексийн оруулгуудыг бичиж тэмдэглэх эхний алхамтай шууд нийцэж байна. Бусад сонголтууд нь цахим индекслэх, индексийн үр дүнтэй ерөнхий шинж чанарууд эсвэл индексийн удирдамжийг дагаж мөрдөх ашиг тусыг тайлбарлаж байгаа боловч гараар индекслэх эхний үйл явцыг тодорхойлоогүй байна.",
      "question_number": 4,
      "page_reference": "466-483"
    },
    {
      "question_en": "Under what circumstances is manual indexing frequently employed?",
      "question_mn": "Гарын авлагын индексийг ямар тохиолдолд түгээмэл ашигладаг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To facilitate rapid processing of large documents with diverse information types.",
          "text_mn": "Олон төрлийн мэдээлэл бүхий том баримт бичгийг хурдан боловсруулахын тулд.",
          "is_correct": false,
          "source": "Related knowledge/Distractor",
          "explanation": "Rapid processing of large documents is typically a benefit of electronic indexing methods, not manual ones, which are generally slower for such tasks."
        },
        {
          "id": "B",
          "text_en": "To ensure all menu initials and locator numbers are correctly identified.",
          "text_mn": "Бүх цэсийн товчлол болон байршлын дугааруудыг зөв тодорхойлсон эсэхийг баталгаажуулах.",
          "is_correct": false,
          "source": "Primary Context (features of a good index)",
          "explanation": "This refers to features of a well-designed index (like those shown in Figure 14.1), not a specific reason for employing manual indexing over electronic methods."
        },
        {
          "id": "C",
          "text_en": "When there is no access to indexing software or when handling page proofs.",
          "text_mn": "Индексийн программ хангамж байхгүй үед эсвэл хэвлэлийн хуудастай ажиллах үед.",
          "is_correct": true,
          "source": "Concept provided",
          "explanation": "This option directly states the common circumstances under which manual indexing is often preferred, aligning with the provided concept."
        },
        {
          "id": "D",
          "text_en": "To personally transcribe entries onto cards or directly into the document file.",
          "text_mn": "Өөрийн биеэр оруулгуудыг карт дээр эсвэл баримт бичигт шууд бичих.",
          "is_correct": false,
          "source": "Primary Context (definition of manual indexing)",
          "explanation": "This describes the *method* or *process* of manual indexing as mentioned in the primary context ('write index entries on cards or in a docume'), but not the *circumstances* that would lead one to choose this method."
        }
      ],
      "concept": "Manual indexing is often used when there is no access to indexing software or when working with page proofs.",
      "difficulty": "medium",
      "explanation_en": "The correct answer accurately reflects the provided concept regarding the typical situations for using manual indexing: specifically, when indexing software is unavailable or when working with page proofs. While the primary context defines manual indexing as 'going through the document and write index entries on cards or in a docume,' it does not explicitly state the scenarios for its use. The question, however, directly addresses the 'Concept' provided for this exercise.",     
      "explanation_mn": "Зөв хариулт нь гарын авлагын индексийг ашиглах ердийн нөхцөл байдлын тухай өгөгдсөн ойлголтыг үнэн зөв тусгаж байна: тухайлбал, индексийн программ хангамж байхгүй эсвэл хэвлэлийн хуудастай ажиллах үед. Үндсэн агуулгад гарын авлагын индексийг 'баримт бичгийг үзэж, индексийн бичиглэлүүдийг карт эсвэл баримт бичигт бичих' гэж тодорхойлсон боловч түүнийг ашиглах хувилбаруудыг тодорхой дурдаагүй болно. Гэсэн хэдий ч асуулт нь энэхүү дасгалд зориулж өгөгдсөн 'Концепц'-ийг шууд авч үзэж байна.",
      "question_number": 5,
      "page_reference": "466-483"
    },
    {
      "question_en": "Which type of information is prominently featured as a key organizational element within the user-oriented index example?",
      "question_mn": "Хэрэглэгчид чиглэсэн индексийн жишээнээс мэдээллийн гол зохион байгуулалтын элемент болох ямар төрлийн мэдээлэл онцгойлон харагдаж байна вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Extensive footnotes providing historical context of software versions.",
          "text_mn": "Програм хангамжийн хувилбаруудын түүхэн нөхцөл байдлыг өгүүлэх өргөн хүрээтэй зүүлт тайлбарууд.",        
          "is_correct": false,
          "source": null,
          "explanation": "While historical context might be found in other parts of documentation, extensive footnotes with version history are not a primary feature or organizational element of a user-oriented index itself. The index directs users to information, it doesn't provide extensive historical narratives within its entries."
        },
        {
          "id": "B",
          "text_en": "Structured main headings and subheadings to categorize information.",
          "text_mn": "Мэдээллийг ангилах зорилгоор бүтэцтэй үндсэн гарчиг болон дэд гарчигууд.",
          "is_correct": true,
          "source": "Figure 14.1",
          "explanation": "This directly reflects the explicit annotation in Figure 14.1 highlighting 'Main headings and subheadings.' This structure is fundamental for organizing index content and aligns with indexing 'main topics' and 'important concepts.'"
        },
        {
          "id": "C",
          "text_en": "Detailed biographical sketches of the software's original creators.",
          "text_mn": "Програм хангамжийг бүтээсэн анхны хүмүүсийн дэлгэрэнгүй намтар.",
          "is_correct": false,
          "source": null,
          "explanation": "Author biographies are not a typical component of a technical index for a software product; they are irrelevant to helping users find information about the software's functionality."
        },
        {
          "id": "D",
          "text_en": "Complete lists of software development code and internal algorithms.",
          "text_mn": "Програм хангамжийн хөгжүүлэлтийн код болон дотоод алгоритмуудын бүрэн жагсаалт.",
          "is_correct": false,
          "source": null,
          "explanation": "A user-oriented index focuses on user features and content, not the underlying code or algorithms used by developers."
        }
      ],
      "concept": "The typical items to index include tables, figures, main topics, important concepts, definitions, acronyms, and keyboard shortcuts.",
      "difficulty": "medium",
      "explanation_en": "The index in Figure 14.1 explicitly highlights 'Main headings and subheadings' as a key organizational feature. This structure allows for the effective orchestration of various kinds of information, enabling users to easily navigate and process specific topics, aligning with the goal of supporting easy information processing and accommodating diverse workplace uses.",
      "explanation_mn": "Зураг 14.1 дэх индексийн жишээнд 'Үндсэн гарчиг болон дэд гарчигууд' нь мэдээллийг зохион байгуулах гол онцлог болохыг тодорхой заасан. Энэхүү бүтэц нь янз бүрийн төрлийн мэдээллийг үр дүнтэй зохион байгуулах боломжийг олгож, хэрэглэгчдэд тодорхой сэдвүүдийг хялбархан удирдах, боловсруулахад тусалдаг бөгөөд энэ нь мэдээллийг хялбар боловсруулах, ажлын байрны янз бүрийн хэрэглээнд нийцүүлэх зорилготой нийцдэг.",
      "question_number": 6,
      "page_reference": "466-483"
    },
    {
      "question_en": "What is the defining characteristic of electronic indexing for a document?",
      "question_mn": "Баримт бичгийн электрон индексийн тодорхойлох шинж чанар юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Utilizes software to identify and mark terms within digital documents.",
          "text_mn": "Дижитал баримт бичгийн доторх нэр томьёог тодорхойлж, тэмдэглэхэд програм хангамж ашигладаг.",
          "is_correct": true,
          "source": "Page 437",
          "explanation": "Электрон индексийн гол шинж чанар нь баримт бичиг доторх нэр томьёог илрүүлж, тэмдэглэхэд програм хангамжийн функцийг ашигладаг явдал юм. Үндсэн эх сурвалжид электрон индекслэх нь гарын авлагын индексийн эсрэг, хоёр аргаас нэг гэж дурдсан байдаг тул энэ нь чухал ялгаа юм."
        },
        {
          "id": "B",
          "text_en": "Depends on human judgment for selecting and categorizing all index terms.",
          "text_mn": "Индексийн бүх нэр томьёог сонгох, ангилахад хүний үнэлгээнд тулгуурладаг.",
          "is_correct": false,
          "source": "Page 437",
          "explanation": "Хүний үнэлгээ нь индекслэх үйл явцад (электрон байсан ч) оролцож болох хэдий ч, энэ нь электрон индексийн ТОДОРХОЙЛОХ шинж чанар биш юм. Электрон индекс нь програм хангамжийн функцийг ашигладгаараа ялгагдана."
        },
        {
          "id": "C",
          "text_en": "Primarily structures information using a two-level outline for readability.",
          "text_mn": "Мэдээллийг голчлон уншихад хялбар болгохын тулд хоёр түвшний ерөнхий бүтэц ашигладаг.",
          "is_correct": false,
          "source": "Page 437",
          "explanation": "Энэ нь сайн зохион бүтээсэн индексийн (жишээ нь, Зураг 14.1-т үзүүлсэн) ерөнхий дизайн, бүтцийн шинж чанар боловч индексийг хэрхэн БҮТЭЭХ арга (гараар эсвэл электроноор) биш юм."
        },
        {
          "id": "D",
          "text_en": "Involves physically writing index entries on cards or a separate document.",
          "text_mn": "Индексийн бичиглэлийг карт эсвэл тусдаа баримт бичиг дээр гараар бичиж бүртгэдэг.",
          "is_correct": false,
          "source": "Page 437",
          "explanation": "Энэ нь гарын авлагын индексийн шинж чанар бөгөөд индекслэх хоёр аргын нэг гэж үндсэн эх сурвалжид дурдсан байдаг. Энэ нь электрон индексийн шинж чанар биш юм."
        }
      ],
      "concept": "Electronic indexing leverages software functions to identify and mark terms within a digital document.",     
      "difficulty": "medium",
      "explanation_en": "The primary context introduces electronic indexing as one of two methods for making an index. The concept provided for this question defines electronic indexing as leveraging 'software functions to identify and mark terms within a digital document.' Therefore, the correct answer directly reflects this core characteristic of utilizing software for term identification and marking in digital documents. This contrasts with manual indexing, which involves physical marking, or general index design principles.",
      "explanation_mn": "Үндсэн эх сурвалжид электрон индекслэх нь индекс үүсгэх хоёр аргын нэг гэж танилцуулсан. Энэ асуултад өгөгдсөн 'concept' буюу ойлголт нь электрон индексийг 'дижитал баримт бичгийн доторх нэр томьёог тодорхойлж, тэмдэглэхэд програм хангамжийн функцийг ашигладаг' гэж тодорхойлсон. Иймээс зөв хариулт нь дижитал баримт бичигт нэр томьёог тодорхойлж, тэмдэглэхэд програм хангамжийг ашиглах энэхүү үндсэн шинж чанарыг шууд тусгаж байна. Энэ нь гараар хийдэг индексийн биет тэмдэглэгээ, эсвэл ерөнхий индексийн дизайны зарчмаас ялгаатай юм.",
      "question_number": 7,
      "page_reference": "466-483"
    },
    {
      "question_en": "Which characteristic is a primary advantage of using electronic indexing methods?",
      "question_mn": "Электрон индексийг ашиглах үндсэн давуу тал юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Emphasizes clear, sentence-like readability of entries.",
          "text_mn": "Бичиглэлүүдийг ойлгомжтой, өгүүлбэр мэт уншигдахуйц байдлыг чухалчилна.",
          "is_correct": false,
          "source": "Figure 14.1",
          "explanation": "Clear, sentence-like readability is a design goal for a well-structured index (as seen in Figure 14.1), but it is not an exclusive advantage of the electronic *method* of creation, as such design principles can be applied to both manual and electronic indexes."
        },
        {
          "id": "B",
          "text_en": "Requires extensive manual card-based entry preparation.",
          "text_mn": "Үндсэн бичиглэл бэлтгэхийн тулд гар аргаар карт бөглөх шаардлагатай.",
          "is_correct": false,
          "source": "Page 437",
          "explanation": "This describes a characteristic of manual indexing, which is explicitly contrasted with electronic methods as being more cumbersome and requiring physical writing."
        },
        {
          "id": "C",
          "text_en": "Focuses on arranging menu initials in brackets.",
          "text_mn": "Цэсний товчилгуудыг хаалтанд оруулахыг голчлон анхаарна.",
          "is_correct": false,
          "source": "Figure 14.1",
          "explanation": "This refers to a specific formatting detail used in the example index (Figure 14.1) for clarity, rather than a general advantage of using electronic indexing methods over manual ones."
        },
        {
          "id": "D",
          "text_en": "Simplified revision and updates of index entries.",
          "text_mn": "Индексийн бичиглэлүүдийг хялбархан засварлах, шинэчлэх боломжтой.",
          "is_correct": true,
          "source": "Page 437",
          "explanation": "Electronic indexing streamlines the process of modifying or updating index entries. Unlike manual indexing, which demands physical rewriting for changes, electronic methods automate such revisions, making the index much easier to maintain and keep current."
        }
      ],
      "concept": "Advantages of electronic indexing include automatic alphabetizing, automatic formatting, and simplified revision.",
      "difficulty": "medium",
      "explanation_en": "The primary context introduces the two methods of indexing: manual and electronic. While it explicitly states that 'A manual index requires that you go through the document and write index entries on cards,' it implies that electronic indexing offers a simpler, less labor-intensive approach. The concept highlights 'simplified revision' as a key advantage of electronic methods. Therefore, electronic indexing's ability to facilitate easy revision and updates is a significant benefit compared to the tedious manual process.",
      "explanation_mn": "Үндсэн контекст нь индекс хийх хоёр аргыг танилцуулдаг: гар арга болон электрон арга. Энд 'Гараар хийх индекс нь баримт бичгийг үзэж, картан дээр индекс бичиглэл оруулахыг шаарддаг' гэж тодорхой заасан боловч, электрон индекс нь илүү хялбар, бага хөдөлмөр шаардсан арга гэдгийг давхар илэрхийлж байна. Энэхүү концепт нь 'засвар оруулахыг хялбаршуулах' нь электрон аргын гол давуу тал болохыг онцолдог. Иймээс индексийн бичиглэлүүдийг хялбархан засварлах, шинэчлэх нь гар аргаар хийх уйтгартай үйл явцтай харьцуулахад электрон индексийн чухал давуу тал юм.",
      "question_number": 8,
      "page_reference": "466-483"
    },
    {
      "question_en": "How does electronic indexing primarily differ from the described manual indexing method?",
      "question_mn": "Электрон индексжүүлэлт нь тайлбарласан гарын авлагын индексжүүлэлтийн аргаас юугаараа ялгаатай вэ?",     
      "choices": [
        {
          "id": "A",
          "text_en": "It ensures entries are displayed with correct spacing and line breaks.",
          "text_mn": "Энэ нь оруулгуудыг зөв зай болон мөр таслалттайгаар харуулахыг баталгаажуулдаг.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This refers to the formatting and readability features of a well-designed index, which can apply to both manual and electronic indexes. It does not highlight a primary process difference between the two methods of creating an index."
        },
        {
          "id": "B",
          "text_en": "It primarily produces an index with menu initials in brackets for easy identification.",
          "text_mn": "Энэ нь голчлон цэсийн товчилсон үсгийг хаалтанд оруулан хялбар таниулах индексийг үүсгэдэг.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This describes a specific feature observed in the example index (Figure 14.1) but is not a fundamental distinguishing characteristic of the process of electronic indexing versus manual indexing as discussed in the 'Plan Your Indexing Strategy' section."
        },
        {
          "id": "C",
          "text_en": "It automatically generates locator numbers for quick reference.",
          "text_mn": "Энэ нь хурдан лавлагаа авахын тулд байршлын дугаарыг автоматаар үүсгэдэг.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While electronic indexing systems often automate locator number generation, the provided text does not explicitly state this as the primary distinguishing characteristic when contrasting manual and electronic indexing strategies. The text focuses on when entries are marked."
        },
        {
          "id": "D",
          "text_en": "It permits marking index entries concurrently with document creation, unlike a post-creation review.",   
          "text_mn": "Энэ нь баримт бичиг үүсгэх явцад индексийн оруулгуудыг тэмдэглэх боломжийг олгодог бөгөөд дууссаны дараа хянахаас ялгаатай.",
          "is_correct": true,
          "source": "Primary Context",
          "explanation": "The primary context explicitly states that a manual index requires going through the document to write entries, implying a post-creation process. In contrast, electronic indexing inherently allows for marking entries as the document is being developed, integrating the indexing task rather than performing it as a separate, later step."
        }
      ],
      "concept": "The electronic indexing process allows for marking entries from the beginning of document creation.",        
      "difficulty": "medium",
      "explanation_en": "The primary text describes manual indexing as a process that \"requires that you go through the document and write index entries\" after its creation. By contrasting this, the text implies that electronic indexing does not necessitate this post-creation review step. Therefore, the core difference lies in the ability of electronic indexing to integrate the marking of entries with the ongoing document creation process, rather than deferring it until the document is complete. The distractors describe features of a good index or general benefits of automation, but not the specific process distinction highlighted in the context.",
      "explanation_mn": "Эх бичвэрт гарын авлагын индексжүүлэлтийг баримт бичгийг үүсгэсний дараа \"баримт бичгийг шалгаж, индексийн оруулгуудыг бичих\" шаардлагатай үйл явц гэж тайлбарласан байдаг. Үүнийг эсрэгээр авч үзвэл, электрон индексжүүлэлт нь баримт бичгийг үүсгэсний дараа хянах шаардлагагүй гэсэн үг юм. Иймээс үндсэн ялгаа нь электрон индексжүүлэлт нь баримт бичиг үүсгэх явцад индексийн оруулгуудыг тэмдэглэх боломжийг олгодогт оршино, ингэснээр индексжүүлэлтийг тусад нь хийх биш, харин баримт бичгийн үйл явцтай нэгтгэдэг. Буруу хариултууд нь сайн индексийн шинж чанарууд эсвэл автоматжуулалтын ерөнхий ашиг тусыг тайлбарласан боловч эх бичвэрт онцолсон үйл явцын тодорхой ялгаа биш юм.",
      "question_number": 9,
      "page_reference": "466-483"
    },
    {
      "question_en": "Which foundational element is key when embarking on the design of a comprehensive index?",
      "question_mn": "Иж бүрэн индексийг зохион бүтээхэд хамгийн чухал суурь элемент юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Focusing primarily on making all index entries sound like full sentences.",
          "text_mn": "Индексийн бүх оруулгыг бүрэн өгүүлбэр шиг сонсогдуулахад гол анхаарлаа хандуулах.",
          "is_correct": false,
          "source": "Page 436 (Figure 14.1)",
          "explanation": "This is a characteristic noted about the readability of the example index in Figure 14.1, but it is a specific stylistic choice rather than a foundational, initial design guideline for developing an index strategy."
        },
        {
          "id": "B",
          "text_en": "Allocating sufficient time for detailed editing and proofreading before finalization.",
          "text_mn": "Эцсийн байдлаар бэлэн болгохоос өмнө нарийвчилсан засвар, хяналтад хангалттай цаг зарцуулах.",
          "is_correct": false,
          "source": "Related concept (general document creation)",
          "explanation": "Editing and proofreading are critical stages in the quality assurance of an index, but they typically occur after the initial design and content generation. They are not the foundational element when first *embarking* on the design process."
        },
        {
          "id": "C",
          "text_en": "Integrating advanced features like menu initials and soft hyphens for identification.",
          "text_mn": "Цэсийн эхний үсэг, зөөлөн зураас зэрэг дэвшилтэт функцуудыг нэгтгэн оруулах.",
          "is_correct": false,
          "source": "Page 436 (Figure 14.1)",
          "explanation": "While these are specific formatting features demonstrated in the example index (Figure 14.1), they are not a general foundational guideline for embarking on the overall design strategy of an index."
        },
        {
          "id": "D",
          "text_en": "Establishing a clear indexing strategy, including the chosen creation method.",
          "text_mn": "Индексжүүлэлтийн тодорхой стратеги боловсруулж, бүтээх аргыг сонгох.",
          "is_correct": true,
          "source": "Page 437",
          "explanation": "The primary context explicitly states, “Plan Your Indexing Strategy” immediately following the mention of “guidelines for designing indexes.” This highlights that establishing the overall approach, including whether to use manual or electronic methods, is a fundamental initial step in creating an effective index."
        }
      ],
      "concept": "General guidelines for designing indexes encompass planning strategy, deciding content, identifying detail level, determining phrasing and format, and thorough editing and proofreading.",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly states, “Plan Your Indexing Strategy” immediately following the mention of “guidelines for designing indexes.” This highlights that establishing the overall approach, including whether to use manual or electronic methods, is a fundamental initial step in creating an effective index. Without a clear strategy, subsequent decisions about content, detail, phrasing, and format would lack direction.",
      "explanation_mn": "Үндсэн контекстэд “индекс зохион бүтээх удирдамж”-ийн тухай дурдсаны дараа шууд “Индексжүүлэлтийн стратегиа төлөвлө” гэж заасан байдаг. Энэ нь индексжүүлэлтийн ерөнхий арга барилыг (гараар эсвэл цахим аргаар хийх эсэх) тогтоох нь үр дүнтэй индекс үүсгэхэд чухал анхан шатны алхам болохыг онцолж байна. Тодорхой стратегигүйгээр агуулга, дэлгэрэнгүй мэдээлэл, үг хэллэг, формат зэргийн талаарх дараагийн шийдвэрүүд чиглэлгүй болно.",
      "question_number": 10,
      "page_reference": "466-483"
    }
  ]
}