{
  "total_generated": 10,
  "mcqs": [
    {
      "question_en": "What is the overriding principle for successful software documentation?",
      "question_mn": "Програм хангамжийн баримт бичгийн амжилтын үндсэн зарчим юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Help users complete tasks as quickly and efficiently as possible.",
          "text_mn": "Хэрэглэгчдэд даалгаврыг аль болох хурдан бөгөөд үр дүнтэй гүйцэтгэхэд туслах.",
          "is_correct": false,
          "source": null,
          "explanation": "Efficiency is a positive outcome of good documentation, but it stems from the broader principle of usability. Usability encompasses making the software effective, efficient, and satisfying for the user, not just fast task completion."
        },
        {
          "id": "B",
          "text_en": "Ensure the documentation is technically accurate and error-free.",
          "text_mn": "Баримт бичиг нь техникийн хувьд үнэн зөв, алдаагүй байхыг баталгаажуулах.",
          "is_correct": false,
          "source": null,
          "explanation": "Accuracy is crucial for any documentation, but the text emphasizes usability as the *overriding* goal. An accurate manual can still fail if it doesn't help the user effectively use the software."
        },
        {
          "id": "C",
          "text_en": "Make the software usable by adapting it to the user's job.",
          "text_mn": "Програм хангамжийг хэрэглэгчийн ажилд тохируулан ашиглахад хялбар болгох.",
          "is_correct": true,
          "source": "Page 1",
          "explanation": "The text explicitly states that the overriding principle is to 'Make the software usable,' further clarifying that 'A manual that does this adapts the software to the user’s job, rather than making the user adapt to the software.'"
        },
        {
          "id": "D",
          "text_en": "Provide comprehensive technical details for all features.",
          "text_mn": "Бүх функцүүдийн талаарх иж бүрэн техникийн дэлгэрэнгүй мэдээллийг өгөх.",
          "is_correct": false,
          "source": null,
          "explanation": "While comprehensiveness is important, it is not the *overriding* principle. A comprehensive manual can still be unusable if not well-structured or user-centric."
        }
      ],
      "concept": "Overriding principle of software documentation: Make the software usable.",
      "difficulty": "medium",
      "explanation_en": "The primary context clearly identifies 'Make the software usable' as the overriding principle for software documentation. This is further elaborated by stating that a good manual 'adapts the software to the user’s job, rather than making the user adapt to the software.' The other options represent important aspects of documentation but are not identified as the *overriding* principle in the provided text.",
      "explanation_mn": "Анхан шатны контекст нь програм хангамжийн баримт бичгийн хамгийн чухал зарчим нь 'програм хангамжийг ашиглахад хялбар болгох' явдал гэдгийг тодорхой заасан. Үүнийг цаашлаад сайн гарын авлага нь 'хэрэглэгчийг програм хангамжид дасан зохицуулах биш, харин програм хангамжийг хэрэглэгчийн ажилд тохируулах' ёстой гэж тайлбарласан. Бусад сонголтууд нь баримт бичгийн чухал талууд боловч өгөгдсөн текстэд 'үндсэн' зарчим гэж тодорхойлогдоогүй байна.",
      "question_number": 1,
      "page_reference": "31-58"
    },
    {
      "question_en": "What is the primary goal of task-oriented software documentation?",
      "question_mn": "Таск-чиглэсэн програм хангамжийн баримтжуулалтын үндсэн зорилго юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To adapt the software to the user's job, enabling them to perform their real-world tasks efficiently.",
          "text_mn": "Програм хангамжийг хэрэглэгчийн ажлын онцлогт нийцүүлж, тэдний бодит ажлыг үр дүнтэй гүйцэтгэх боломжийг олгох.",    
          "is_correct": true,
          "source": "Page ??",
          "explanation": "The primary context states the overriding principle is to 'Make the software usable. A manual that does this adapts the software to the user’s job, rather than making the user adapt to the soft- ware.' The example illustrates how the manual encourages discovery and efficiency, showing the user doing meaningful work with the program."
        },
        {
          "id": "B",
          "text_en": "To present exhaustive step-by-step instructions for every function without emphasizing the context of the user's work.",
          "text_mn": "Хэрэглэгчийн ажлын нөхцөл байдлыг тодорхойлохгүйгээр функц бүрийн алхам алхмаар зааврыг дэлгэрэнгүй танилцуулах.",   
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Task-oriented documentation does include procedural information, but it critically places these steps within the context of the user's job and emphasizes how the program facilitates 'discovery and efficiency' for meaningful work, not just isolated steps."
        },
        {
          "id": "C",
          "text_en": "To provide a complete and detailed list of all software features and technical specifications.",
          "text_mn": "Програм хангамжийн бүх онцлог, техникийн үзүүлэлтүүдийн иж бүрэн, нарийвчилсан жагсаалтыг өгөх.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While documentation may include features and specifications, the core of task-oriented documentation goes beyond a mere list, focusing on how the software integrates into the user's workflow to accomplish tasks."
        },
        {
          "id": "D",
          "text_en": "To explain the internal architecture of the software and common troubleshooting steps for developers.",
          "text_mn": "Програм хангамжийн дотоод архитектур болон хөгжүүлэгчдэд зориулсан нийтлэг алдааг олж засварлах алхмуудыг тайлбарлах.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "This describes technical documentation geared towards developers or system administrators, focusing on the software's internal workings. Task-oriented documentation, by contrast, focuses on the end-user's external tasks and how the software helps them accomplish their job."
        }
      ],
      "concept": "Definition of task-oriented documentation.",
      "difficulty": "medium",
      "explanation_en": "Task-oriented documentation prioritizes making software usable by adapting it to the user's existing job and real-world tasks. Instead of forcing the user to adapt to the software, it focuses on how the software can efficiently help the user achieve their specific goals, encouraging discovery and meaningful work within their professional context. This is the 'overriding principle' outlined in the primary context.",
      "explanation_mn": "Таск-чиглэсэн баримтжуулалт нь програм хангамжийг хэрэглэгчийн одоо байгаа ажил, бодит даалгавруудад нийцүүлэн ашиглахад хялбар болгохыг чухалчилдаг. Энэ нь хэрэглэгчийг програм хангамжид дасан зохицоход хүчлэхийн оронд, програм хангамж нь хэрэглэгчийн тодорхой зорилгод хэрхэн үр дүнтэй тусалж, нээлт хийх болон утга учиртай ажил хийхэд нь дэмжлэг үзүүлэхэд чиглэдэг. Энэ нь үндсэн контентод дурдсан 'хамгийн чухал зарчим' юм.",
      "question_number": 2,
      "page_reference": "31-58"
    },
    {
      "question_en": "Which characteristic best exemplifies a software manual that effectively adapts the software to the user’s job rather than forcing the user to adapt to the software?",
      "question_mn": "Програм хангамжийн гарын авлага нь хэрэглэгчийг программд дасан зохицоход хүргэх бус, харин программыг хэрэглэгчийн ажилд үр дүнтэй дасан зохицуулсан болохыг илтгэх хамгийн сайн шинж чанар аль нь вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "It primarily offers simplified, linear step-by-step instructions for operating each individual function.",
          "text_mn": "Энэ нь голчлон программ хангамжийн функц бүрийг ажиллуулах энгийн, дараалсан алхам алхмаар зааварчилгааг өгдөг.",    
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Although procedural steps are valuable, a manual that *solely* focuses on them without emphasizing the context of discovery, efficiency, or how the software performs meaningful work for the user's job still makes the user adapt to the software's functions rather than the other way around. The primary context explicitly contrasts this singular focus with its ideal approach."
        },
        {
          "id": "B",
          "text_en": "It includes sections on advanced customization and scripting for developers to modify the software's core behavior.",
          "text_mn": "Энэ нь программ хангамжийн үндсэн үйлдлийг өөрчлөх зорилгоор хөгжүүлэгчдэд зориулсан нарийн тохиргоо, скрипт бичих хэсгүүдийг агуулдаг.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This type of content targets software developers who extend or modify the software, which is a different goal from helping an end-user integrate existing software into their daily job tasks."
        },
        {
          "id": "C",
          "text_en": "It provides an exhaustive compilation of all technical features, commands, and their detailed syntax.",
          "text_mn": "Энэ нь бүх техникийн онцлог, командын жагсаалт, тэдгээрийн нарийвчилсан синтаксийг бүрэн дүүрэн багтаасан байдаг.",  
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While comprehensive, an exhaustive list of technical details can overwhelm users and still require them to adapt to the software's complexity, rather than showing how it directly applies to their job tasks."
        },
        {
          "id": "D",
          "text_en": "It emphasizes how the software facilitates the user's analytical process and demonstrates performing meaningful real-world tasks through relatable scenarios.",
          "text_mn": "Энэ нь программ хангамж нь хэрэглэгчийн аналитик процессыг хэрхэн хөнгөвчилж, бодит амьдрал дээрх утга учиртай ажлуудыг хамааралтай хувилбаруудаар дамжуулан гүйцэтгэхийг харуулдаг.",
          "is_correct": true,
          "source": "Page 2",
          "explanation": "This approach focuses on integrating the software into the user's existing professional workflow and objectives, such as emphasizing discovery, efficiency for end-users, transferring real-world tasks, and illustrating meaningful work through scenarios, rather than just listing features or procedures."
        }
      ],
      "concept": "Adapting software to the user's job rather than the user to the software.",
      "difficulty": "medium",
      "explanation_en": "The most effective software manuals adapt the software to the user's job by focusing on how the software supports their existing professional processes and helps them achieve meaningful work. This includes emphasizing discovery, efficiency for the specific user type (e.g., scientific end-users), demonstrating real-world task transfer, and using scenarios to illustrate practical application, as seen in the PV-WAVE P&C example. This approach guides users to see the software's relevance to their work, rather than just presenting its features or requiring them to learn its internal logic without context.",
      "explanation_mn": "Хамгийн үр дүнтэй программ хангамжийн гарын авлага нь программ хангамжийг хэрэглэгчийн ажилд дасан зохицуулахын тулд программ хангамж нь тэдний одоогийн мэргэжлийн үйл явцыг хэрхэн дэмжиж, утга учиртай ажил хийхэд хэрхэн тусалдагт анхаарлаа хандуулдаг. Үүнд нээлт, тодорхой хэрэглэгчийн төрөлд (жишээлбэл, шинжлэх ухааны эцсийн хэрэглэгчид) зориулсан үр ашгийг онцолж, бодит ертөнцийн ажлыг шилжүүлэхийг харуулж, практик хэрэглээг дүрслэхийн тулд хувилбаруудыг ашиглах зэрэг багтдаг. Энэ хандлага нь хэрэглэгчдэд программ хангамжийн онцлог шинж чанаруудыг танилцуулах эсвэл контекстгүйгээр дотоод логикийг нь сурахыг шаардахын оронд, программ хангамжийн өөрсдийн ажилд хэрхэн хамааралтай болохыг ойлгоход чиглүүлдэг.",
      "question_number": 3,
      "page_reference": "31-58"
    },
    {
      "question_en": "What is a fundamental principle for creating software documentation that ensures the software is truly usable for its intended professional audience?",
      "question_mn": "Програм хангамжийг зориулалтын мэргэжлийн хэрэглэгчдэд үнэхээр хэрэглэхэд хялбар болгохын тулд баримт бичгийг бүрдүүлэхэд ямар суурь зарчим чухал вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "The foremost goal of documentation is to ensure absolute technical accuracy and provide comprehensive coverage of every minor software function, regardless of user relevance.",
          "text_mn": "Баримт бичгийн хамгийн чухал зорилго бол техникийн үнэн зөв байдлыг хангах, програм хангамжийн бүх жижиг функцийг хэрэглэгчийн хамаарлаас үл хамааран иж бүрэн хамруулах явдал юм.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While accuracy is always important, the text emphasizes 'Make the software usable' and adapting it to the user's job as the 'overriding principle.' Comprehensive coverage without relevance to the user's job does not fulfill this core principle."       
        },
        {
          "id": "B",
          "text_en": "Documentation should adapt the software to the user's existing job functions and demonstrate how it enhances their real-world tasks, rather than forcing the user to conform to the software's structure.",
          "text_mn": "Баримт бичиг нь хэрэглэгчийг програм хангамжийн бүтэцд дасан зохицоход хүргэх бус, харин програм хангамжийг хэрэглэгчийн одоо байгаа ажлын үүрэгт дасан зохицуулж, бодит ажлуудыг нь хэрхэн сайжруулж байгааг харуулах ёстой.",
          "is_correct": true,
          "source": "Page 1",
          "explanation": "The primary context explicitly states that a successful manual 'adapts the software to the user’s job, rather than making the user adapt to the software' and emphasizes showing how the software supports 'meaningful work' and 'real-world tasks' for the user's professional process."
        },
        {
          "id": "C",
          "text_en": "The documentation should primarily offer detailed, step-by-step procedural information for every function, assuming users will then independently discover its broader applications.",
          "text_mn": "Баримт бичиг нь үндсэндээ функц бүрийн талаар нарийвчилсан, алхам алхмаар журамчилсан мэдээллийг санал болгох ёстой бөгөөд хэрэглэгчид дараа нь түүний өргөн хэрэглээг бие даан нээх болно гэж таамаглана.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While procedural information is present, the text clarifies that the *overriding principle* is making the software usable by adapting it to the user's job, which goes beyond just providing steps. Focusing solely on procedures might not connect the software to meaningful work."
        },
        {
          "id": "D",
          "text_en": "Effective documentation focuses on simplifying complex features and terminology to make the software accessible to a broad audience, including those with limited technical background.",
          "text_mn": "Үр дүнтэй баримт бичиг нь нарийн төвөгтэй функц, нэр томъёог хялбарчлахад анхаарч, техникийн мэдлэг багатай хүмүүс зэрэг өргөн хүрээний хэрэглэгчдэд програм хангамжийг хүртээмжтэй болгохыг зорьдог.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "The text mentions 'highly technical users' and adapting to their specific needs, not necessarily simplifying for a broad, non-technical audience. The focus is on integrating with *professional* tasks, which implies the target audience likely has some technical proficiency relevant to their field."
        }
      ],
      "concept": "Importance of showing connections between software and the user's professional work.",
      "difficulty": "medium",
      "explanation_en": "The core message from the primary context is that successful software documentation focuses on making the software usable by adapting it to the user's job. This means demonstrating how the software integrates into and enhances their specific professional tasks and objectives, rather than simply presenting features or expecting the user to conform to the software's design. The example of PV-WAVE P&C illustrates this by showing how the documentation connected the program to the scientific end-user's real-world tasks, emphasizing discovery, efficiency, and meaningful work.",
      "explanation_mn": "Эх сурвалжийн гол санаа бол амжилттай програм хангамжийн баримт бичиг нь програм хангамжийг хэрэглэгчийн ажилд дасан зохицуулснаар ашиглахад хялбар болгоход чиглэгддэг явдал юм. Энэ нь програм хангамжийн онцлогийг зүгээр нэг танилцуулах эсвэл хэрэглэгчийг програм хангамжийн загварт дасан зохицохыг шаардахын оронд, програм хангамж нь тэдний тодорхой мэргэжлийн ажлуудад хэрхэн нэгдэж, сайжруулж байгааг харуулахыг хэлнэ. PV-WAVE P&C-ийн жишээ нь баримт бичиг нь шинжлэх ухааны эцсийн хэрэглэгчийн бодит ажлуудтай програмыг хэрхэн холбож, нээлт, үр ашиг, утга учиртай ажлыг онцолж байгааг харуулсан.",
      "question_number": 4,
      "page_reference": "31-58"
    },
    {
      "question_en": "What is a primary objective of using scenarios, practical examples, and thoughtful page layout in effective software documentation?",
      "question_mn": "Програм хангамжийн үр дүнтэй баримтжуулалтад хэрэглэгчийн түүх (scenario), практик жишээ, бодолтой хуудасны зохион байгуулалтыг ашиглахын үндсэн зорилго юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To ensure the documentation is technically accurate and comprehensively covers all software features and technical specifications.",
          "text_mn": "Баримт бичиг нь техникийн хувьд үнэн зөв байж, програмын бүх боломж, техникийн үзүүлэлтийг бүрэн хамарсан байхыг баталгаажуулах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Technical accuracy and comprehensiveness are general requirements for all documentation. However, scenarios, examples, and layout are specifically used to demonstrate application and usability, rather than just listing features or specifications."     
        },
        {
          "id": "B",
          "text_en": "To enhance the brand image of the software and market its advanced capabilities to potential buyers, increasing sales and market share.",
          "text_mn": "Програм хангамжийн брэндийн нэр хүндийг нэмэгдүүлж, түүний дэвшилтэт чадавхийг боломжит худалдан авагчдад сурталчилж, борлуулалт болон зах зээлийн эзлэх хувийг нэмэгдүүлэх.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This describes a marketing or branding objective, which is distinct from the core purpose of documentation. Effective documentation aims to support users in using the software, not primarily to sell it."
        },
        {
          "id": "C",
          "text_en": "To simplify complex procedures for novice users, making the learning curve as short as possible and reducing initial training costs.",
          "text_mn": "Нарийн төвөгтэй үйлдлүүдийг шинэ хэрэглэгчдэд хялбаршуулж, сурах хугацааг аль болох богиносгож, анхны сургалтын зардлыг бууруулах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While simplifying procedures is a benefit of good documentation, the primary context emphasizes adapting the software to the user's job and enabling meaningful work, which goes beyond merely shortening the learning curve for novices."
        },
        {
          "id": "D",
          "text_en": "To demonstrate how the software can be integrated into the user's existing tasks, enabling them to perform meaningful work and adapt the software to their specific job requirements.",
          "text_mn": "Програм хангамжийг хэрэглэгчийн одоо байгаа ажилд хэрхэн нэгтгэх боломжтойг харуулж, тэдэнд утга учиртай ажил хийж, програмыг өөрийн ажлын шаардлагад нийцүүлэх боломжийг олгох.",
          "is_correct": true,
          "source": "Page 2, Figure 1.1",
          "explanation": "The text explicitly states that scenarios illustrate how the user can control the program, and examples show the user doing meaningful work. The overall principle is to make the software usable by adapting it to the user's job, rather than making the user adapt to the software."
        }
      ],
      "concept": "Role of scenarios, examples, and page layout in effective documentation.",
      "difficulty": "medium",
      "explanation_en": "The primary context highlights that successful documentation adapts the software to the user’s job, making it usable. Features like scenarios, examples, and thoughtful layout (e.g., balanced images, cartoons) are specifically shown to demonstrate how users can control the program, perform meaningful work, and integrate the software into their analytical process. This directly supports the objective of making the software relevant and adaptable to the user's specific tasks and goals.",
      "explanation_mn": "Үндсэн контекст нь амжилттай баримтжуулалт нь програмыг хэрэглэгчийн ажилд тохируулан, ашиглах боломжтой болгодог болохыг онцолж байна. Хэрэглэгчийн түүх (scenario), жишээ, бодолтой зохион байгуулалт (тухайлбал, тэнцвэртэй зураг, хүүхэлдэйн зураг) зэрэг онцлог шинж чанарууд нь хэрэглэгчид програмыг хэрхэн хянах, утга учиртай ажил хийх, програмыг өөрсдийн аналитик процессд нэгтгэх боломжтойг харуулах зорилготой байдаг. Энэ нь програмыг хэрэглэгчийн тодорхой ажлууд болон зорилгод нийцүүлэн, ашиглах боломжтой болгох зорилгыг шууд дэмждэг.",
      "question_number": 5,
      "page_reference": "31-58"
    },
    {
      "question_en": "What approach to software documentation best helps users seamlessly integrate a new program into their existing workflow and understand its value?",
      "question_mn": "Програм хангамжийн баримт бичгийн аль арга барил нь хэрэглэгчдэд шинэ программыг одоогийн ажлын урсгалдаа саадгүй нэгтгэх, түүний үнэ цэнийг ойлгоход хамгийн сайн тусалдаг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "It offers highly detailed, linear, step-by-step instructions for every possible task, strictly avoiding any external context or scenarios.",
          "text_mn": "Энэ нь боломжтой бүх даалгаварт зориулсан маш нарийвчилсан, шугаман, алхам алхмаар зааварчилгааг өгдөг бөгөөд гадаад нөхцөл байдал, хувилбаруудаас зайлсхийдэг.",
          "is_correct": false,
          "explanation": "This option describes purely 'how-to' information without the 'how-so' context. The text explicitly states that while procedural information is present, it's embedded within an approach that emphasizes discovery, efficiency, and real-world scenarios to help users integrate the program into their job. Simply providing linear steps without context fails to 'adapt the software to the user's job'."
        },
        {
          "id": "B",
          "text_en": "It provides an exhaustive compilation of all technical specifications and a comprehensive list of every single feature available in the software.",
          "text_mn": "Энэ нь бүх техникийн үзүүлэлтүүд болон программ хангамжид байгаа бүх функцийг бүрэн жагсаасан жагсаалтыг өгдөг.",    
          "is_correct": false,
          "explanation": "While technical specifications and feature lists can be useful, they primarily represent 'how-to' or 'what it has' without necessarily providing the 'how-so' context that helps users adapt the software to their job or understand its overall value in a practical sense. The primary context emphasizes adapting to the user's job through meaningful examples and scenarios, not just a comprehensive list."
        },
        {
          "id": "C",
          "text_en": "It integrates step-by-step procedural information within real-world scenarios that demonstrate the software's relevance and benefits to the user's specific job tasks.",
          "text_mn": "Энэ нь хэрэглэгчийн тодорхой ажлын даалгаварт программ хангамжийн ач холбогдол, ашиг тусыг харуулсан бодит амьдралын нөхцөл байдалд алхам алхмаар зааварчилгааг нэгтгэдэг.",
          "is_correct": true,
          "source": "Page 2, Figure 1.1",
          "explanation": "The text emphasizes that effective documentation 'adapts the software to the user’s job' by providing 'how-so' (contextual) information like 'discovery and efficiency,' 'real-world tasks,' and 'scenarios' that demonstrate 'meaningful work,' alongside 'how-to' procedural steps. This combination helps users understand the program's value and integrate it into their workflow."
        },
        {
          "id": "D",
          "text_en": "It prioritizes a highly visual and aesthetically pleasing interface, assuming users prefer minimal text and intuitive design.",
          "text_mn": "Энэ нь хэтэрхий бага текст, хэрэглэхэд хялбар дизайныг илүүд үздэг хэрэглэгчдийг таамаглан, өндөр харагдах байдалтай, гоо зүйн хувьд тааламжтай интерфэйсийг чухалчилдаг.",
          "is_correct": false,
          "explanation": "Visual design is important for user experience, but the primary context focuses on the content's ability to make the software usable by adapting to the user's job through a combination of 'how-so' and 'how-to' information. A pleasing interface alone does not convey the purpose or integration into a workflow as effectively as contextualized procedures."
        }
      ],
      "concept": "User need for both 'how-so' (contextual) and 'how-to' (procedural) information.",
      "difficulty": "medium",
      "explanation_en": "Effective software documentation goes beyond merely listing steps ('how-to'). It integrates these steps into meaningful contexts and scenarios ('how-so'), demonstrating how the software adapts to and enhances the user's existing job functions and goals. The provided text highlights this by describing a manual that emphasizes 'discovery and efficiency,' uses 'balanced images show how to transfer real-world tasks,' and employs 'scenarios (story)' to illustrate how the program helps users do 'meaningful work.' This approach ensures users understand the software's value and can seamlessly incorporate it into their workflow, rather than simply learning a series of commands.",
      "explanation_mn": "Үр дүнтэй программ хангамжийн баримт бичиг нь зөвхөн алхмуудыг жагсаахаас ('хэрхэн хийх') илүү байдаг. Энэ нь эдгээр алхмуудыг утга учиртай нөхцөл байдал, хувилбаруудад ('яагаад хийх') нэгтгэж, программ хангамж нь хэрэглэгчийн одоо байгаа ажлын үүрэг, зорилгод хэрхэн дасан зохицож, сайжруулж байгааг харуулдаг. Өгөгдсөн текст нь үүнийг онцолж, 'нээлт, үр ашиг'-ийг чухалчилсан, 'бодит амьдралын даалгавруудыг шилжүүлэхийг харуулсан тэнцвэртэй зурагнууд' ашигласан, мөн программ нь хэрэглэгчдэд 'утга учиртай ажил' хийхэд хэрхэн тусалдагийг харуулахын тулд 'сценари (түүх)' ашигласан гарын авлагыг тайлбарласан байна. Энэ арга нь хэрэглэгчдэд программ хангамжийн үнэ цэнийг ойлгуулж, хэд хэдэн командуудыг цээжлэхээс илүүтэйгээр ажлын урсгалдаа саадгүй нэгтгэх боломжийг олгодог.",
      "question_number": 6,
      "page_reference": "31-58"
    },
    {
      "question_en": "Which guiding principle for software documentation, as exemplified in the primary context, best facilitates a user's ability to efficiently find specific information and explore functionalities at their own pace?",
      "question_mn": "Анхдагч контекстэд жишээ болгон үзүүлсэн програм хангамжийн баримт бичгийг боловсруулах аль зарчим нь хэрэглэгчдэд тодорхой мэдээллийг үр дүнтэй олж, функцуудыг өөрийн хурдаар судлах чадварыг хамгийн сайн дэмждэг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Emphasizing user discovery and efficiency, thereby adapting the software to the user's workflow rather than the other way around.",
          "text_mn": "Хэрэглэгчийн нээлт болон үр ашгийг чухалчилж, улмаар програм хангамжийг хэрэглэгчийн ажлын урсгалд дасан зохицуулах.",
          "is_correct": true,
          "source": "Primary Context",
          "explanation": "The text explicitly states that the manual's introduction 'emphasizes discovery and efficiency, both motivators for the scientific end user' and underscores adapting 'the software to the user’s job.' This combination directly supports users finding information quickly (efficiency) and exploring at their own pace (discovery)."
        },
        {
          "id": "B",
          "text_en": "Presenting exhaustive lists of every software feature and technical specification in a comprehensive appendix.",     
          "text_mn": "Програм хангамжийн бүх функц болон техникийн үзүүлэлтүүдийн дэлгэрэнгүй жагсаалтыг хавсралтаар танилцуулах.",        
          "is_correct": false,
          "source": "Related Context (distractor)",
          "explanation": "While comprehensive information can be useful, simply listing every feature can overwhelm users, making it harder to quickly locate specific, relevant information or explore efficiently according to their needs."
        },
        {
          "id": "C",
          "text_en": "Prioritizing the visual appeal and graphic design of the interface documentation over the clarity of procedural instructions.",
          "text_mn": "Интерфэйсийн баримт бичгийн харагдах байдал болон графикийн дизайныг процедурын зааврын тодорхой байдлаас илүүтэйгээр чухалчлах.",
          "is_correct": false,
          "source": "Related Context (distractor)",
          "explanation": "While good design can enhance usability, prioritizing visual appeal above clear, concise procedural instructions would detract from quick access to steps and effective user discovery, making the software less usable."
        },
        {
          "id": "D",
          "text_en": "Structuring documentation with a strictly linear, step-by-step format that must be followed sequentially.",
          "text_mn": "Баримт бичгийг зөвхөн шугаман, алхам алхмаар, дарааллаар дагах ёстой форматаар бүтцийг зохион байгуулах.",
          "is_correct": false,
          "source": "Related Context (distractor)",
          "explanation": "A strictly linear format can hinder user choice and quick access, as it often requires users to go through irrelevant content to reach specific steps or explore different functionalities, contrary to the emphasis on discovery and efficiency mentioned in the context."
        }
      ],
      "concept": "Benefits of electronic controls in help systems (user choice of detail, quick access to steps).",
      "difficulty": "medium",
      "explanation_en": "The primary context highlights that effective software documentation focuses on making software usable by 'adapting the software to the user’s job.' It explicitly mentions that the tutorial manual emphasizes 'discovery and efficiency' for end-users, alongside providing procedural information. These principles directly contribute to enabling users to quickly find specific steps (efficiency) and choose their learning path or explore functionalities at their own pace (discovery), which are core benefits often associated with effective help systems, whether electronic or manual in design. The distractors represent less effective or counterproductive approaches to user-centric documentation.",
      "explanation_mn": "Анхдагч контекстэд үр дүнтэй програм хангамжийн баримт бичиг нь програм хангамжийг 'хэрэглэгчийн ажилд дасан зохицуулах' замаар ашиглахад хялбар болгоход чиглэгддэг гэдгийг онцолсон. Энэ нь гарын авлагын танилцуулгад 'шинжлэх ухааны эцсийн хэрэглэгчийн хувьд нээлт ба үр ашгийг чухалчилдаг' гэдгийг тодорхой дурдаж, процедурын мэдээллийг өгдөг. Эдгээр зарчим нь хэрэглэгчдэд тодорхой алхмуудыг хурдан олох (үр ашиг) болон сурах арга барилаа сонгох эсвэл функцуудыг өөрийн хурдаар судлах (нээлт) чадварыг шууд дэмждэг бөгөөд энэ нь электрон эсвэл гарын авлагын аль аль нь үр дүнтэй тусламжийн системийн гол ашиг тус юм. Бусад сонголтууд нь хэрэглэгч төвтэй баримт бичгийн хувьд үр дүнгүй эсвэл эсрэг үр нөлөөтэй хандлагыг илэрхийлдэг.",
      "question_number": 7,
      "page_reference": "31-58"
    },
    {
      "question_en": "What is the most effective approach for software documentation to adapt the software to a user's job and make it truly usable?",
      "question_mn": "Програм хангамжийн баримт бичгийг хэрэглэгчийн ажлын хэрэгцээнд нийцүүлж, үнэхээр ашиглахад хялбар болгох хамгийн үр дүнтэй арга юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Providing detailed, step-by-step procedural instructions for every function within the software.",
          "text_mn": "Програм хангамж доторх бүх функцийн алхам алхмаар нарийвчилсан зааварчилгааг өгөх.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While documentation needs procedural information, the text explicitly states that simply offering procedural information is not the 'overriding principle'. The key is adapting the software to the user's job, which goes beyond just steps to demonstrate problem-solving."
        },
        {
          "id": "B",
          "text_en": "Presenting scenarios and examples that demonstrate how the software solves real-world problems and facilitates meaningful work.",
          "text_mn": "Програм хангамж бодит амьдралын асуудлыг хэрхэн шийдэж, утга учиртай ажлыг хөнгөвчилж буйг харуулсан хувилбарууд болон жишээнүүдийг танилцуулах.",
          "is_correct": true,
          "source": "Page ??",
          "explanation": "The primary context emphasizes that the 'overriding principle' for documentation is to 'Make the software usable' by adapting it to the user's job. This is achieved through scenarios and examples that show users 'doing meaningful work' and making 'discovery and efficiency' possible, thus solving their real-world problems."
        },
        {
          "id": "C",
          "text_en": "Including engaging visual elements like cartoons and relatable metaphors to humanize the program.",
          "text_mn": "Програм хангамжийг хүнчилсэн, ойлгомжтой болгохын тулд хүүхэлдэйн кино болон харьцуулсан зүйрлэл зэрэг сонирхолтой харагдах элементүүдийг оруулах.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "The text mentions the use of a cartoon to 'humanize the program' as a feature, but this is a specific tactic to encourage use, not the central 'overriding principle' of making the software usable by adapting it to the user's job and solving their problems."
        },
        {
          "id": "D",
          "text_en": "Listing all available features and capabilities of the software in a comprehensive reference guide.",
          "text_mn": "Програм хангамжийн бүх боломжит функц, чадваруудыг дэлгэрэнгүй лавлах гарын авлагад жагсаах.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While a comprehensive list of features is part of complete documentation, the primary focus outlined in the text is on helping users understand 'how this program can make a difference to them' and achieve 'discovery and efficiency' by doing 'meaningful work,' rather than just knowing what the software can do."
        }
      ],
      "concept": "Guideline: Emphasize problem-solving within documentation.",
      "difficulty": "medium",
      "explanation_en": "The primary context stresses that documentation's 'overriding principle' is to 'Make the software usable' by adapting it to the user's job. This is best achieved by illustrating how the software helps users perform their tasks and solve real-world problems, as demonstrated by the PV-WAVE P&C example's focus on 'discovery and efficiency' and showing users 'doing meaningful work' through scenarios and examples. Simply providing procedures, listing features, or using humanizing elements, while potentially helpful, do not embody this overarching principle as effectively as demonstrating practical problem-solving.",
      "explanation_mn": "Үндсэн контекстэд баримт бичгийн 'хамгийн чухал зарчим' нь програм хангамжийг хэрэглэгчийн ажилд нийцүүлж, 'ашиглахад хялбар болгох' явдал гэдгийг онцолсон. Энэ нь програм хангамж хэрэглэгчдэд өдөр тутмын ажлаа гүйцэтгэх, бодит амьдралын асуудлыг шийдвэрлэхэд хэрхэн тусалж байгааг PV-WAVE P&C жишээн дээр 'нээлт, үр ашиг' болон 'утга учиртай ажил' хийж буйг хувилбар болон жишээгээр харуулснаар хамгийн сайн биелдэг. Зүгээр л зааварчилгаа өгөх, функцүүдийг жагсаах эсвэл хүнчилсэн элементүүдийг ашиглах нь тустай байж болох ч, практик асуудал шийдвэрлэх аргыг харуулахтай адил энэхүү ерөнхий зарчмыг төдийлөн үр дүнтэй илэрхийлэхгүй.",
      "question_number": 8,
      "page_reference": "31-58"
    },
    {
      "question_en": "Which characteristic best exemplifies a task-oriented approach in software documentation?",
      "question_mn": "Програм хангамжийн баримт бичигт ажлын үүрэгт чиглэсэн хандлагыг хамгийн сайн харуулсан шинж чанар аль нь вэ?",      
      "choices": [
        {
          "id": "A",
          "text_en": "Providing comprehensive, step-by-step instructions for every function and button within the software.",
          "text_mn": "Програм хангамжийн бүх функц, товчлуурын нарийвчилсан, алхам алхмаар зааварчилгааг өгөх.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While detailed procedures are part of good documentation, simply listing instructions for every function does not inherently demonstrate how the software adapts to the user's overall job or helps them achieve their specific real-world tasks. The primary context emphasizes the 'why' and 'what for' of using the software in the user's job."
        },
        {
          "id": "B",
          "text_en": "Highlighting the advanced technical specifications and internal architecture of the software to impress expert users.",
          "text_mn": "Мэргэшсэн хэрэглэгчдийг гайхшруулахын тулд програм хангамжийн дэвшилтэт техникийн үзүүлэлт, дотоод бүтцийг тодотгох.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Focusing on technical specifications or internal architecture, while potentially interesting to some users, does not directly address how the software helps users perform their job tasks. Task orientation prioritizes usability and problem-solving from the user's perspective, not just the technical details of the software itself."
        },
        {
          "id": "C",
          "text_en": "Presenting scenarios that show users achieving their real-world goals and doing meaningful work with the program, thereby adapting the software to their specific job requirements.",
          "text_mn": "Хэрэглэгчид програм ашиглан бодит амьдрал дээрх зорилгодоо хүрч, утга учиртай ажил хийж буй хувилбаруудыг танилцуулах нь програм хангамжийг тэдний ажлын онцлогт нийцүүлж буй явдал юм.",
          "is_correct": true,
          "source": "Page ??",
          "explanation": "A task-oriented manual adapts the software to the user’s job, focusing on how users can accomplish their specific goals and meaningful work. The PV-WAVE P&C example in the primary context illustrates this by providing scenarios that demonstrate discovery, efficiency, and how the program helps users achieve scientific objectives."
        },
        {
          "id": "D",
          "text_en": "Emphasizing the intuitive design of the user interface and the ease of locating various tools.",
          "text_mn": "Хэрэглэгчийн интерфэйсийн ойлгомжтой загвар, төрөл бүрийн хэрэгслүүдийг олоход хялбар байдлыг онцлох.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "An intuitive user interface contributes to overall usability, but task orientation goes beyond mere ease of finding tools. It specifically focuses on how the software enables users to complete their work-related tasks and achieve their goals, rather than just navigate the interface smoothly."
        }
      ],
      "concept": "Guideline: Provide task-oriented organization.",
      "difficulty": "medium",
      "explanation_en": "A task-oriented approach in software documentation focuses on making the software usable by adapting it to the user's job. This means showing users how they can achieve their specific, real-world goals and perform meaningful work using the program. The correct answer highlights this by describing scenarios where the software helps users accomplish their job requirements, as demonstrated in the PV-WAVE P&C example which emphasizes discovery, efficiency, and real-world task completion.",
      "explanation_mn": "Програм хангамжийн баримт бичигт ажлын үүрэгт чиглэсэн хандлага нь програмыг хэрэглэгчийн ажилд нийцүүлж, ашиглахад хялбар болгоход төвлөрдөг. Энэ нь хэрэглэгчдэд програм ашиглан бодит амьдрал дээрх зорилгодоо хүрч, утга учиртай ажил хийхийг хэрхэн харуулахыг хэлнэ. Зөв хариулт нь PV-WAVE P&C жишээн дээр үзүүлсэн шиг, програм хангамж нь хэрэглэгчийн ажлын шаардлагыг хангах, нээлт хийх, үр ашигтай ажиллах, бодит ажлыг гүйцэтгэхэд хэрхэн тусалж байгааг харуулсан хувилбаруудыг тодорхойлж, үүнийг онцолж байна.",
      "question_number": 9,
      "page_reference": "31-58"
    },
    {
      "question_en": "Which aspect of a software tutorial best exemplifies the principle of empowering users to control information and interact with data?",
      "question_mn": "Програм хангамжийн гарын авлагын аль хэсэг нь хэрэглэгчдэд мэдээллийг хянах, өгөгдөлтэй харилцан үйлчлэх эрх мэдлийг олгох зарчмыг хамгийн сайн харуулдаг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Explicit procedural steps detailing how to complete specific tasks.",
          "text_mn": "Тодорхой ажлуудыг хэрхэн гүйцэтгэх тухай тодорхой дараалсан алхмууд.",
          "is_correct": false,
          "source": "Page 2: 'Don’t get the wrong idea— that this manual doesn’t offer procedural information. If you read this example carefully you can see tl.at the writers have represented the steps of a procedure...'",
          "explanation": "While procedures enable task completion, the guideline 'encourage user control of information' goes beyond simply following steps. It emphasizes the user's ability to *choose, manipulate, and explore* the information dynamically, as exemplified by the scenario where the user decides *where* to slice the data and then sees the result, rather than just executing a predefined sequence."     
        },
        {
          "id": "B",
          "text_en": "An introduction highlighting the program's role in discovery and efficiency for the scientific end-user.",
          "text_mn": "Эцсийн хэрэглэгчдэд зориулсан нээлт, үр ашигт хөтөлбөрийн үүргийг онцолсон танилцуулга.",
          "is_correct": false,
          "source": "Page 2, Figure 1.1 description: 'The introduction emphasizes discovery and efficiency, both motivators for the scientific end user.'",
          "explanation": "While important for motivation and setting expectations, this focuses on the *benefits* of the program, not the direct mechanism by which users *control* the information themselves."
        },
        {
          "id": "C",
          "text_en": "A cartoon figure humanizing the software and presenting a user role model.",
          "text_mn": "Програм хангамжийг хүнчилж, хэрэглэгчийн үлгэр жишээг үзүүлсэн хүүхэлдэйн баатар.",
          "is_correct": false,
          "source": "Page 2, Figure 1.1 description: 'The cartoon humanizes the program and creates a user role model.'",
          "explanation": "This aims to make the software more approachable and create identification, but it doesn't directly relate to giving the user tools or methods to *control* the information or data itself."
        },
        {
          "id": "D",
          "text_en": "A detailed scenario showing a user manipulating data (e.g., using a profile tool to slice and visualize a data point).",
          "text_mn": "Хэрэглэгч өгөгдлийг удирдан зохион байгуулж буй (жишээлбэл, профиль хэрэгслээр өгөгдлийн цэгийг хувааж харуулах) нарийвчилсан хувилбар.",
          "is_correct": true,
          "source": "Page 2, Figure 1.1 description: 'The scenario (story) illustrates how the user can control the program.'",
          "explanation": "This directly illustrates the user actively choosing how to view and analyze information within the program, demonstrating control. The text describes: 'I want to know the intensity right through this point... I'll use the Profile tool... I can just point to the two ends of the profile... and drag the line... There, now I see the slice as a line graph in another window.' This is a clear instance of user control over information."
        }
      ],
      "concept": "Guideline: Encourage user control of information.",
      "difficulty": "medium",
      "explanation_en": "The core principle of encouraging user control of information is best illustrated when documentation shows users actively making choices and manipulating data within the software to gain insights. The scenario where a user utilizes a tool to slice and visualize data at a chosen point directly demonstrates this, empowering them to interact with and control the presented information.",      
      "explanation_mn": "Мэдээллийг хэрэглэгчийн хяналтад оруулах зарчим нь хэрэглэгчдэд програм хангамжийн доторх мэдээллийг идэвхтэй сонгох, удирдах боломжийг харуулсан баримт бичгээр хамгийн сайн илэрдэг. Хэрэглэгч сонгосон цэгт өгөгдлийг хувааж харуулах хэрэгслийг ашиглаж буй хувилбар нь үүнийг шууд харуулж, тэдэнд танилцуулсан мэдээлэлтэй харилцан үйлчилж, хянах боломжийг олгодог.",
      "question_number": 10,
      "page_reference": "31-58"
    }
  ]
}