{
  "total_generated": 10,
  "mcqs": [
    {
      "question_en": "What is considered the overriding principle for successful software documentation?",
      "question_mn": "Програм хангамжийн баримт бичгийн амжилттай байх хамгийн гол зарчим юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Minimizing the length and complexity of the documentation.",
          "text_mn": "Баримт бичгийн уртыг багасгаж, нарийн төвөгтэй байдлыг бууруулах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Reducing length and complexity can contribute to usability, but it is not presented as the *overriding principle* itself. A manual can be short but still fail to make the software usable."
        },
        {
          "id": "B",
          "text_en": "Ensuring technical accuracy and detailed explanations.",
          "text_mn": "Техникийн нарийвчлал, дэлгэрэнгүй тайлбарыг хангах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While technical accuracy and detail are crucial for good documentation, the primary text specifies 'making the software usable' as the *overriding* principle, a broader concept focused on user integration and efficiency."
        },
        {
          "id": "C",
          "text_en": "Making the software usable.",
          "text_mn": "Програм хангамжийг ашиглахад хялбар болгох.",
          "is_correct": true,
          "source": "Page 1",
          "explanation": "The text explicitly states that the book 'focuses on one overriding principle: Make the software usable.'"       
        },
        {
          "id": "D",
          "text_en": "Providing comprehensive step-by-step procedural guides for all functions.",
          "text_mn": "Бүх функцийг алхам алхмаар, иж бүрэн зааварчилгаагаар хангах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "The text notes that procedural information is present but emphasizes adapting the software to the user's job and facilitating discovery, which goes beyond merely providing comprehensive procedures. Usability is the broader, overriding goal."
        }
      ],
      "concept": "Overriding principle of software documentation: Make the software usable",
      "difficulty": "easy",
      "explanation_en": "The primary context explicitly states, 'This book examines...but focuses on one overriding principle: Make the software usable.' This principle aims to adapt the software to the user’s job, making it easier for them to achieve their goals with the program, rather than making the user adapt to the software.",
      "explanation_mn": "Үндсэн контекстэд 'Энэ ном...нэг л гол зарчимд анхаарлаа хандуулдаг: Програм хангамжийг ашиглахад хялбар болгох' гэж тодорхой заасан байдаг. Энэ зарчим нь програмыг хэрэглэгчийн ажилд нийцүүлж, хэрэглэгчийг програмд дасан зохицуулахаас илүүтэйгээр програмыг ашиглан зорилгодоо хүрэхэд нь хялбар болгох зорилготой.",
      "question_number": 1,
      "page_reference": "31-58"
    },
    {
      "question_en": "What is a key characteristic of software documentation that aims to make software usable for the user?",
      "question_mn": "Програм хангамжийг хэрэглэгчид зориулан ашиглахад хялбар болгохыг зорьсон баримтжуулалтын гол шинж чанар юу вэ?",    
      "choices": [
        {
          "id": "A",
          "text_en": "The documentation provides a comprehensive list of all software features.",
          "text_mn": "Баримтжуулалт нь програм хангамжийн бүх функцын иж бүрэн жагсаалтыг өгдөг.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While providing a list of features can be part of documentation, it is not the *key* characteristic for making software usable by adapting it to the user's job. It focuses on the software itself rather than the user's workflow."
        },
        {
          "id": "B",
          "text_en": "The documentation adapts the software to the user's job.",
          "text_mn": "Баримтжуулалт нь програм хангамжийг хэрэглэгчийн ажилд нийцүүлдэг.",
          "is_correct": true,
          "source": "Page 1-2",
          "explanation": "The primary context states that a manual that makes software usable 'adapts the software to the user’s job, rather than making the user adapt to the soft- ware.' This is the core principle for user-centric documentation."
        },
        {
          "id": "C",
          "text_en": "The documentation emphasizes the software's technical specifications.",
          "text_mn": "Баримтжуулалт нь програм хангамжийн техникийн үзүүлэлтүүдийг онцолдог.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Technical specifications are more relevant for developers or advanced troubleshooting, not the primary focus for making software usable and adaptable to the typical user's job."
        },
        {
          "id": "D",
          "text_en": "The documentation requires the user to adapt to the software's design.",
          "text_mn": "Баримтжуулалт нь хэрэглэгчээс програм хангамжийн загварт дасан зохицохыг шаарддаг.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "This is the opposite of user-centric documentation, which aims to adapt the software to the user, not the other way around."
        }
      ],
      "concept": "User-centric documentation: Adapting software to the user's job",
      "difficulty": "easy",
      "explanation_en": "The core principle of effective software documentation, as highlighted in the primary context, is to 'make the software usable' by ensuring 'a manual that does this adapts the software to the user’s job, rather than making the user adapt to the software.' This means the documentation helps integrate the software into the user's existing workflow and tasks.",
      "explanation_mn": "Анхдагч контекстэд онцолсон програм хангамжийн үр дүнтэй баримтжуулалтын гол зарчим нь програм хангамжийг 'хэрэглэгчдэд ашиглахад хялбар болгох' явдал бөгөөд 'гарын авлага нь хэрэглэгчийг програм хангамжид дасан зохицохоос илүүтэйгээр програм хангамжийг хэрэглэгчийн ажилд нийцүүлдэг' байх ёстой. Энэ нь баримтжуулалт нь програм хангамжийг хэрэглэгчийн одоо байгаа ажлын урсгал, даалгаварт нэгтгэхэд тусалдаг гэсэн үг юм.",
      "question_number": 2,
      "page_reference": "31-58"
    },
    {
      "question_en": "What is a fundamental characteristic of task-oriented software documentation?",
      "question_mn": "Даалгавар чиглэсэн програм хангамжийн баримт бичгийн үндсэн шинж чанар юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Adapting the software to the user's job rather than making the user adapt to the software.",
          "text_mn": "Хэрэглэгчийг програм хангамжид дасан зохицохыг шаардахын оронд, програм хангамжийг хэрэглэгчийн ажилд тохируулах.",  
          "is_correct": true,
          "source": "Page 2",
          "explanation": "Task-oriented documentation prioritizes the user's workflow and tasks, making the software a tool that seamlessly integrates into their existing job rather than forcing them to learn a new way of working just for the software."
        },
        {
          "id": "B",
          "text_en": "Emphasizing the software's unique technological advancements and innovative algorithms.",
          "text_mn": "Програм хангамжийн өвөрмөц технологийн дэвшил, шинэлэг алгоритмуудыг онцлох.",
          "is_correct": false,
          "source": null,
          "explanation": "Highlighting technological advancements is more relevant for marketing or technical specifications than for task-oriented user documentation, which focuses on how the user can effectively utilize the software to achieve their work goals."
        },
        {
          "id": "C",
          "text_en": "Providing an exhaustive list of all software features and technical specifications.",
          "text_mn": "Програм хангамжийн бүх онцлог, техникийн үзүүлэлтүүдийг бүрэн жагсаах.",
          "is_correct": false,
          "source": null,
          "explanation": "While providing feature lists can be part of documentation, task-oriented documentation goes beyond merely listing features. It focuses on how users accomplish their goals using those features, often integrating them into scenarios or workflows."      
        },
        {
          "id": "D",
          "text_en": "Offering detailed, step-by-step instructions for every single button and menu item.",
          "text_mn": "Товчлуур, цэсийн элемент бүрийн нарийвчилсан, алхам алхмаар заавар өгөх.",
          "is_correct": false,
          "source": null,
          "explanation": "While procedural steps are necessary, a purely button-by-button approach can overwhelm users and fail to connect individual actions to larger, meaningful tasks. Task-oriented documentation groups steps into user-relevant scenarios."
        }
      ],
      "concept": "Task orientation: Helping users manage and communicate information related to their tasks",
      "difficulty": "easy",
      "explanation_en": "The core principle of task-oriented documentation is to align the software with the user's existing job functions and workflows. It prioritizes making the software usable by adapting it to what the user needs to accomplish, rather than forcing the user to conform to the software's structure or technical details.",
      "explanation_mn": "Даалгавар чиглэсэн баримт бичгийн үндсэн зарчим нь програм хангамжийг хэрэглэгчийн одоо байгаа ажлын үүрэг, ажлын урсгалтай уялдуулах явдал юм. Энэ нь хэрэглэгчийг програм хангамжийн бүтэц, техникийн нарийн ширийн зүйлд дасан зохицохыг албадахын оронд, хэрэглэгчийн гүйцэтгэх ёстой зүйлд нь тохируулан програм хангамжийг ашиглахад хялбар болгоход нэн тэргүүнд анхаардаг.",
      "question_number": 3,
      "page_reference": "31-58"
    },
    {
      "question_en": "To effectively adapt a software program to a user's job, what two crucial types of information should documentation primarily provide?",
      "question_mn": "Программ хангамжийг хэрэглэгчийн ажилд үр дүнтэй дасан зохицуулахын тулд баримт бичиг нь ямар хоёр чухал төрлийн мэдээллийг голчлон өгөх ёстой вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Technical specifications and system requirements.",
          "text_mn": "Техникийн үзүүлэлт, системийн шаардлага.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While important for technical setup, these do not directly help a user integrate the program into their workflow by showing them how to perform tasks or understand the software's benefit to their job."
        },
        {
          "id": "B",
          "text_en": "Step-by-step procedural instructions and an understanding of how the software contributes to their job goals.",      
          "text_mn": "Алхам алхмаар үйлдлийн зааварчилгаа болон программ хангамж нь тэдний ажлын зорилгод хэрхэн хувь нэмэр оруулах талаарх ойлголт.",
          "is_correct": true,
          "source": "Page 1-2",
          "explanation": "The text highlights that effective documentation represents 'the steps of a procedure' (how-to) and emphasizes 'discovery and efficiency' and the program's 'significant role in your analytical process' (how-so), directly linking the software to the user's job goals."
        },
        {
          "id": "C",
          "text_en": "Comprehensive API documentation and code examples.",
          "text_mn": "API-ийн дэлгэрэнгүй баримт бичиг болон кодын жишээнүүд.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This type of information is generally relevant for developers or for advanced customization, not for the typical end-user trying to integrate a program into their daily job tasks."
        },
        {
          "id": "D",
          "text_en": "Marketing materials and user testimonials.",
          "text_mn": "Маркетингийн материал болон хэрэглэгчийн сэтгэгдэл.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "These serve promotional purposes and build credibility, but they do not teach users how to operate the software or understand its functional value in their specific job role."
        }
      ],
      "concept": "Types of information needed by users: How-so and how-to information",
      "difficulty": "easy",
      "explanation_en": "The primary context states that effective software documentation's 'overriding principle' is to 'Make the software usable' by adapting 'the software to the user’s job, rather than making the user adapt to the software.' This is achieved by providing both procedural information ('represented the steps of a procedure') and by emphasizing the software's ability to facilitate 'discovery and efficiency' and play a 'significant role in your analytical process,' which directly translates to understanding how the software helps achieve job goals.",
      "explanation_mn": "Үндсэн контекстэд үр дүнтэй программ хангамжийн баримт бичиг нь программыг 'хэрэглэгчийн ажилд дасан зохицуулах' замаар 'программ хангамжийг ашиглахад хялбар болгох' нь 'хамгийн чухал зарчим' гэж заасан. Үүнд хүрэхийн тулд 'үйл ажиллагааны алхмуудыг төлөөлөх' (хэрхэн хийх мэдээлэл) болон программ хангамжийн 'нээлт, үр ашгийг' дэмжиж, 'танай аналитик процесст чухал үүрэг' гүйцэтгэхийг онцолж (яагаад, яаж туслах мэдээлэл) хэрэглэгчдэд ажлын зорилгодоо хүрэхэд программ хангамж хэрхэн тусалдагийг ойлгуулах хэрэгтэй.",
      "question_number": 4,
      "page_reference": "31-58"
    },
    {
      "question_en": "Which documentation feature is highlighted as illustrating how a user can control a program to adapt it to their specific job?",
      "question_mn": "Хэрэглэгч програмыг өөрийн ажлын хэрэгцээндээ нийцүүлэн хэрхэн удирдах боломжийг харуулдаг баримтжуулалтын гол онцлог юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Extensive glossaries defining all technical terms.",
          "text_mn": "Бүх техникийн нэр томъёог тодорхойлсон дэлгэрэнгүй тайлбар толь.",
          "is_correct": false,
          "source": "Related Concept",
          "explanation": "While glossaries are helpful for understanding terms, they do not directly illustrate how users control the program or adapt it to their job tasks, as emphasized in the primary context for effective documentation."
        },
        {
          "id": "B",
          "text_en": "Scenarios (stories) that demonstrate user control over the program.",
          "text_mn": "Хэрэглэгч програмыг хэрхэн удирдахыг харуулсан зохиомол түүхүүд (сценари).",
          "is_correct": true,
          "source": "Page 2, Figure 1.1",
          "explanation": "The primary context explicitly states under Figure 1.1 that 'The scenario (story) illustrates how the user can control the program,' directly linking this documentation feature to user control and adaptation for their job."
        },
        {
          "id": "C",
          "text_en": "Exhaustive reference sections detailing every API call.",
          "text_mn": "Бүх API дуудлагыг дэлгэрэнгүй тайлбарласан иж бүрэн лавлах хэсгүүд.",
          "is_correct": false,
          "source": "Related Concept",
          "explanation": "Exhaustive API references are typically for developers, not the primary means for end-users to understand how to control a program for their job-specific tasks, which is the focus of the provided context."
        },
        {
          "id": "D",
          "text_en": "A rigid sequence of steps for every single program feature.",
          "text_mn": "Програмын функц бүрийн алхам алхмаар гүйцэтгэх хатуу дараалал.",
          "is_correct": false,
          "source": "Related Concept",
          "explanation": "While procedural information is present, the text emphasizes discovery and making the software usable by adapting it to the user's job, rather than just providing a rigid, comprehensive sequence of steps without context for user control and task orientation. Such rigidity might hinder adaptation rather than promote it."
        }
      ],
      "concept": "User control over information detail in documentation",
      "difficulty": "easy",
      "explanation_en": "The primary context, specifically Figure 1.1, explicitly highlights that 'The scenario (story) illustrates how the user can control the program.' This feature directly supports the principle of making software usable by adapting it to the user's job, giving users control over how they engage with the program's functionality to achieve their tasks.",
      "explanation_mn": "Үндсэн контекст буюу Зураг 1.1-т 'Зохиомол түүх (сценари) нь хэрэглэгч програмыг хэрхэн удирдахыг харуулдаг' гэж тодорхой онцолсон байдаг. Энэ онцлог нь програмыг хэрэглэгчийн ажилд нийцүүлэн ашиглах боломжтой болгох зарчмыг шууд дэмжиж, хэрэглэгчдэд өөрийн ажлыг гүйцэтгэхийн тулд програмын үйл ажиллагааг хэрхэн ашиглах талаар хяналт тавих боломжийг олгодог.",
      "question_number": 5,
      "page_reference": "31-58"
    },
    {
      "question_en": "What is the overarching goal of high-quality software documentation?",
      "question_mn": "Өндөр чанартай программ хангамжийн баримтжуулалтын хамгийн гол зорилго юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To provide an exhaustive list of all technical specifications and features of the software.",
          "text_mn": "Программ хангамжийн бүх техникийн үзүүлэлт, боломжуудыг бүрэн жагсаах.",
          "is_correct": false,
          "source": null,
          "explanation": "While providing technical specifications is a component of documentation, it is not the overarching goal of making the software usable in the context of the user's professional work."
        },
        {
          "id": "B",
          "text_en": "To adapt the software to the user's professional tasks and help them integrate it into their work processes.",       
          "text_mn": "Программ хангамжийг хэрэглэгчийн мэргэжлийн үүрэг даалгаварт дасан зохицуулж, ажлын явцад нь нэгтгэхэд туслах.",     
          "is_correct": true,
          "source": "Primary Context",
          "explanation": "The primary context states that the 'overriding principle' is to 'Make the software usable' by adapting 'the software to the user’s job, rather than making the user adapt to the soft- ware.' The example further illustrates this by showing how the program helps users do 'meaningful work' and 'make a difference to them'."
        },
        {
          "id": "C",
          "text_en": "To minimize the overall length of the manual to ensure quick reference and reduce reading time.",
          "text_mn": "Гарын авлагын нийт уртыг багасгаж, хурдан лавлагаа авах, унших хугацааг багасгах.",
          "is_correct": false,
          "source": null,
          "explanation": "Conciseness can contribute to usability, but it is not the core function of explaining how the software connects to and enhances the user's professional work."
        },
        {
          "id": "D",
          "text_en": "To offer comprehensive, step-by-step procedures for every possible function within the software.",
          "text_mn": "Программ хангамжийн бүх боломжит функцэд зориулсан алхам алхмын дэлгэрэнгүй зааврыг өгөх.",
          "is_correct": false,
          "source": null,
          "explanation": "The text mentions procedural information but clarifies that effective documentation goes beyond simple steps to emphasize discovery and adaptation to the user's job, ensuring meaningful work rather than just following procedures."
        }
      ],
      "concept": "Core function of documentation: Explaining connections between user's professional work and the computer program",       
      "difficulty": "easy",
      "explanation_en": "The primary context explicitly states that the overriding principle of software documentation is to 'Make the software usable' by adapting 'the software to the user’s job, rather than making the user adapt to the soft- ware.' This means helping users integrate the program into their existing professional tasks and showing how it enables them to perform meaningful work (A). While technical specifications (B), detailed procedures (C), and conciseness (D) can be aspects of documentation, they are not the central, overarching goal of connecting the software to the user's professional world and making it truly usable for their specific needs.",
      "explanation_mn": "Үндсэн хэсэгт программ хангамжийн баримтжуулалтын хамгийн чухал зарчим бол 'хэрэглэгчийг программ хангамжид дасан зохицуулах биш, харин программ хангамжийг хэрэглэгчийн ажилд нь тохируулах' замаар 'программ хангамжийг ашиглахад хялбар болгох' явдал гэж тодорхой заасан. Энэ нь хэрэглэгчдэд программыг одоогийн мэргэжлийн үүрэг даалгаварт нь нэгтгэхэд тусалж, утга учиртай ажил хийх боломжийг хэрхэн олгож байгааг харуулахыг хэлнэ (А). Техникийн үзүүлэлтүүд (В), дэлгэрэнгүй процедурууд (С), товч байдал (D) нь баримтжуулалтын нэг хэсэг байж болох ч, программ хангамжийг хэрэглэгчийн мэргэжлийн ертөнцтэй холбож, тэдний тодорхой хэрэгцээнд үнэхээр ашиглахад хялбар болгох гол зорилго биш юм.",
      "question_number": 6,
      "page_reference": "31-58"
    },
    {
      "question_en": "Which elements in software documentation are crucial for illustrating how users can effectively integrate and apply the software to their specific real-world tasks?",
      "question_mn": "Програм хангамжийн баримт бичгийн аль элементүүд нь хэрэглэгчдэд програмыг өөрсдийн бодит ажлуудад хэрхэн үр дүнтэй нэгтгэн ашиглахыг харуулахад чухал үүрэгтэй вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Scenarios and examples demonstrating meaningful work and user control.",
          "text_mn": "Утга учиртай ажил болон хэрэглэгчийн хяналтыг харуулсан хувилбарууд (scenarios) болон жишээнүүд.",
          "is_correct": true,
          "source": "Page 2, Figure 1.1",
          "explanation": "The text states that 'The scenario (story) illustrates how the user can control the program' and 'The example shows the user doing meaningful work with the program.' These elements directly help users adapt the software to their job by showing practical applications."
        },
        {
          "id": "B",
          "text_en": "Detailed, step-by-step procedural instructions without broader context.",
          "text_mn": "Өргөн хүрээний нөхцөл байдалгүйгээр алхам алхмаар, нарийвчилсан зааварчилгаа.",
          "is_correct": false,
          "source": "Related but incorrect idea",
          "explanation": "The text implies that while procedural information is present, it's the scenarios and examples that provide the crucial context for users to understand how to apply those procedures to their job, rather than just isolated steps."
        },
        {
          "id": "C",
          "text_en": "Extensive theoretical background on underlying algorithms and data structures.",
          "text_mn": "Үндсэн алгоритм болон өгөгдлийн бүтцийн талаарх өргөн хүрээний онолын мэдлэг.",
          "is_correct": false,
          "source": "Related but incorrect idea",
          "explanation": "Theoretical background provides understanding of how the software works internally, but it doesn't directly demonstrate how to use the software for 'meaningful work' or 'control the program' in the context of a user's specific job."
        },
        {
          "id": "D",
          "text_en": "Comprehensive lists of technical specifications and API calls.",
          "text_mn": "Техникийн үзүүлэлт болон API дуудлагын иж бүрэн жагсаалтууд.",
          "is_correct": false,
          "source": "Related but incorrect idea",
          "explanation": "While important for developers or advanced integration, technical specifications and API calls do not primarily help typical end-users adapt the software to their daily job tasks, which is the focus of the provided context for usability."
        }
      ],
      "concept": "Documentation elements for user engagement: Scenarios, examples, and page layout",
      "difficulty": "easy",
      "explanation_en": "The primary context highlights that effective software documentation 'adapts the software to the user’s job' by making it usable. Figure 1.1 explicitly points out that 'The scenario (story) illustrates how the user can control the program' and 'The example shows the user doing meaningful work with the program.' These elements are crucial because they directly connect the software's functionality to practical, real-world tasks, helping users understand its relevance and gain proficiency. The other options describe documentation aspects that, while potentially useful in other contexts, do not directly fulfill the primary context's focus on user adaptation to their job through practical demonstrations.",
      "explanation_mn": "Анхдагч контекст нь үр дүнтэй програм хангамжийн баримт бичиг нь хэрэглээний чадварыг нэмэгдүүлэх замаар 'програм хангамжийг хэрэглэгчийн ажилд дасгадаг' болохыг онцолсон. Зураг 1.1 нь 'Нөхцөл байдал (түүх) нь хэрэглэгч програмыг хэрхэн удирдахыг харуулдаг' болон 'Жишээ нь хэрэглэгч програмаар утга учиртай ажил хийж байгааг харуулдаг' гэж тодорхой дурдсан. Эдгээр элементүүд нь програм хангамжийн үйл ажиллагааг бодит, практик ажлуудтай шууд холбож, хэрэглэгчдэд түүний ач холбогдлыг ойлгож, чадвар эзэмшихэд тусалдаг тул маш чухал юм. Бусад сонголтууд нь өөр нөхцөлд ашигтай байж болох баримт бичгийн талуудыг тайлбарлаж байгаа боловч анхдагч контекстэд хэрэглэгчийн ажлын дасан зохицох байдлыг практик үзүүлбэрээр дамжуулан онцолсон зүйлд шууд хамаарахгүй.",
      "question_number": 7,
      "page_reference": "31-58"
    },
    {
      "question_en": "What is the primary goal of effective software documentation regarding user interaction?",
      "question_mn": "Хэрэглэгчийн харилцан үйлчлэлийн хувьд үр дүнтэй програм хангамжийн баримт бичгийн үндсэн зорилго юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To document the software's internal architecture for developers.",
          "text_mn": "Програм хангамжийн дотоод архитектурыг хөгжүүлэгчдэд зориулж баримтжуулах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This refers to technical documentation for developers, not user-facing documentation aimed at improving user interaction and job performance."
        },
        {
          "id": "B",
          "text_en": "To extensively list all available features and technical specifications.",
          "text_mn": "Бүх боломжит функц болон техникийн үзүүлэлтүүдийг дэлгэрэнгүй жагсаах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While features are part of documentation, the primary goal for user interaction isn't just a list, but rather how those features enable the user to accomplish their work."
        },
        {
          "id": "C",
          "text_en": "To provide step-by-step instructions for every possible action within the software.",
          "text_mn": "Програм хангамжийн доторх боломжит үйлдлүүдийг үе шаттайгаар зааварчлах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Procedural information is certainly included, but the primary goal extends beyond mere steps to focusing on how those steps contribute to the user's overall job and problem-solving, as highlighted by the 'discovery and efficiency' emphasis."
        },
        {
          "id": "D",
          "text_en": "To adapt the software to the user's job, enabling problem-solving and efficiency.",
          "text_mn": "Програм хангамжийг хэрэглэгчийн ажилд нийцүүлж, асуудлыг шийдвэрлэх, үр ашгийг нэмэгдүүлэх.",
          "is_correct": true,
          "source": "Primary Context",
          "explanation": "The text explicitly states the overriding principle is to 'Make the software usable. A manual that does this adapts the software to the user’s job, rather than making the user adapt to the software.' It emphasizes discovery, efficiency, and showing the user doing meaningful work to solve problems."
        }
      ],
      "concept": "Emphasis on problem-solving in documentation",
      "difficulty": "easy",
      "explanation_en": "The primary context stresses that effective software documentation focuses on making the software usable by adapting it to the user's job and facilitating problem-solving and efficiency, rather than forcing the user to adapt. The example illustrates how documentation helps users discover insights and perform meaningful work relevant to their professional tasks.",
      "explanation_mn": "Үндсэн агуулгад дурдсанаар, програм хангамжийн үр дүнтэй баримт бичиг нь хэрэглэгчийг дасан зохицоход хүчлэх бус, харин програм хангамжийг хэрэглэгчийн ажилд нийцүүлж, асуудлыг шийдвэрлэх, үр ашгийг нэмэгдүүлэхэд чиглэсэн байх нь чухал. Жишээ нь баримт бичиг нь хэрэглэгчдэд шинэ ойлголт олох, мэргэжлийн ажилтай нь холбоотой утга учиртай ажил хийхэд хэрхэн тусалдагийг харуулсан.",
      "question_number": 8,
      "page_reference": "31-58"
    },
    {
      "question_en": "What is the primary objective of a task-oriented software manual?",
      "question_mn": "Ажил даалгаварт чиглэсэн программ хангамжийн гарын авлагын үндсэн зорилго юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To present information in a strictly linear, step-by-step format.",
          "text_mn": "Мэдээллийг зөвхөн шугаман, алхам алхмаар хэлбэрээр танилцуулах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "A step-by-step format is common in tutorials, which can be part of task-oriented documentation, but it is a method of presentation, not the overarching primary objective of making the software adaptable to the user's job."
        },
        {
          "id": "B",
          "text_en": "To adapt the software to the user's job.",
          "text_mn": "Программ хангамжийг хэрэглэгчийн ажлын хэрэгцээнд нийцүүлэх.",
          "is_correct": true,
          "source": "Page 1",
          "explanation": "The text states that a manual that makes software usable 'adapts the software to the user’s job, rather than making the user adapt to the software.' This is the core principle of task-oriented documentation."
        },
        {
          "id": "C",
          "text_en": "To list all available software features and functions.",
          "text_mn": "Программ хангамжийн боломжит бүх функц, онцлогуудыг жагсаах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While features are part of software, simply listing them is characteristic of a feature-oriented approach, not a task-oriented one, which prioritizes user workflows and goals."
        },
        {
          "id": "D",
          "text_en": "To provide detailed technical specifications of the program.",
          "text_mn": "Программын техникийн нарийвчилсан үзүүлэлтүүдийг өгөх.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Technical specifications are important for developers or advanced users but are not the primary goal of a task-oriented manual, which focuses on usability for the end-user's job."
        }
      ],
      "concept": "Task-oriented organization of manuals/help systems",
      "difficulty": "easy",
      "explanation_en": "A task-oriented software manual's primary goal is to make the software usable by focusing on how it integrates into the user's workflow and helps them achieve their specific job-related tasks. It adapts the software to the user's needs, rather than requiring the user to adapt to the software's structure. This contrasts with documentation that focuses solely on features or technical details.",
      "explanation_mn": "Ажил даалгаварт чиглэсэн программ хангамжийн гарын авлагын үндсэн зорилго нь программ хангамжийг хэрэглэгчийн ажлын урсгалд хэрхэн нэгтгэх, тэдэнд ажилтай нь холбоотой тодорхой даалгавруудыг гүйцэтгэхэд нь туслах замаар хэрэглэхэд хялбар болгох явдал юм. Энэ нь программ хангамжийг хэрэглэгчийн хэрэгцээнд нийцүүлдэг бөгөөд хэрэглэгчийг программ хангамжийн бүтэцтэй нийцүүлэхийг шаарддаггүй. Энэ нь зөвхөн функц эсвэл техникийн нарийвчилсан мэдээлэлд төвлөрсөн баримт бичгээс ялгаатай.",
      "question_number": 9,
      "page_reference": "31-58"
    },
    {
      "question_en": "What is a key characteristic of effective software documentation that supports user interaction with software?",     
      "question_mn": "Хэрэглэгчийн программ хангамжтай харилцах харилцааг дэмждэг үр дүнтэй программ хангамжийн баримт бичгийн гол шинж чанар юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "It prioritizes the software's internal logic and structure over how users typically perform their work.",
          "text_mn": "Энэ нь хэрэглэгчид ажлаа хэрхэн хийдгээс илүүтэйгээр программ хангамжийн дотоод логик болон бүтцийг чухалчилдаг.",   
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This contradicts the core principle of effective documentation which is to adapt the software to the user's job, not to make the user adapt to the software's internal logic."
        },
        {
          "id": "B",
          "text_en": "It adapts the software to the user's job, allowing them to complete meaningful tasks.",
          "text_mn": "Энэ нь программ хангамжийг хэрэглэгчийн ажилд тохируулж, утга учиртай даалгавруудыг гүйцэтгэх боломжийг олгодог.",   
          "is_correct": true,
          "source": "Page 1-2",
          "explanation": "The primary context emphasizes that effective documentation 'adapts the software to the user’s job, rather than making the user adapt to the software.' The example manual facilitates users 'doing meaningful work' and discovering insights."
        },
        {
          "id": "C",
          "text_en": "It requires users to adjust their job processes to align with the software's predefined methods.",
          "text_mn": "Энэ нь хэрэглэгчдийг өөрсдийн ажлын процессыг программ хангамжийн урьдчилан тодорхойлсон аргад нийцүүлэхийг шаарддаг.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This is the opposite of the principle stated in the primary context, which is to adapt the software to the user's job, not the other way around."
        },
        {
          "id": "D",
          "text_en": "It exhaustively details every technical feature of the software for expert users.",
          "text_mn": "Энэ нь программ хангамжийн бүх техникийн онцлог шинж чанарыг мэргэжлийн хэрэглэгчдэд зориулан нарийвчлан тайлбарладаг.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While providing technical details can be part of documentation, the primary context highlights 'task orientation' and making the software *usable* by adapting it to the user's job, which is a broader goal than just listing features."
        }
      ],
      "concept": "Facilitating both routine and complex tasks through documentation",
      "difficulty": "easy",
      "explanation_en": "Effective software documentation focuses on making the software usable by adapting it to the user's job. This approach, referred to as task orientation, enables users to perform meaningful work, discover insights from their data, and achieve their objectives efficiently, rather than forcing them to conform to the software's internal structure or methods.",
      "explanation_mn": "Үр дүнтэй программ хангамжийн баримт бичиг нь программ хангамжийг хэрэглэгчийн ажилд тохируулан ашиглах боломжтой болгоход чиглэгддэг. Энэхүү 'даалгавар төвтэй' арга нь хэрэглэгчдэд программ хангамжийн дотоод бүтэц, арга барилд дасан зохицохыг шаардахын оронд утга учиртай ажлуудыг гүйцэтгэх, өгөгдлөөсөө ойлголт олж авах, зорилгодоо үр дүнтэй хүрэх боломжийг олгодог.",
      "question_number": 10,
      "page_reference": "31-58"
    }
  ]
}