{
  "total_generated": 10,
  "mcqs": [
    {
      "question_en": "How do the elaborative and minimalist approaches primarily serve software education?",
      "question_mn": "Программ хангамжийг заахын тулд нарийвчилсан болон минималист аргууд юунд үндсэндээ үйлчилдэг вэ?",      
      "choices": [
        {
          "id": "A",
          "text_en": "To develop innovative features within the software for exploration.",
          "text_mn": "Программ хангамжийн доторх шинэлэг функцүүдийг судлахад зориулж хөгжүүлэх.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "These approaches concern teaching *about* software, not developing new features *within* the software itself."
        },
        {
          "id": "B",
          "text_en": "To guide the design of teaching modules for effective software instruction.",
          "text_mn": "Программ хангамжийн үр дүнтэй сургалтын хичээлийн модулиудын загварыг боловсруулахад удирдамж болгох.",  
          "is_correct": true,
          "source": "Page 30",
          "explanation": "The text explicitly states these approaches show \"how to design your teaching modules according to their principles.\""
        },
        {
          "id": "C",
          "text_en": "To define user interface standards for new software applications.",
          "text_mn": "Шинэ программ хангамжийн хэрэглэгчийн интерфэйсийн стандартыг тодорхойлох.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This refers to software design itself, not the pedagogical approaches for teaching it."
        },
        {
          "id": "D",
          "text_en": "To categorize user skill levels for personalized learning paths.",
          "text_mn": "Хэрэглэгчийн ур чадварын түвшинг хувийн сургалтын замуудад ангилах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While user analysis is important, these approaches are about the instructional design, not primarily user categorization."
        }
      ],
      "concept": "Elaborative and minimalist approaches to teaching software",
      "difficulty": "medium",
      "explanation_en": "The primary context clearly states that the elaborative and minimalist approaches are introduced to show \"how to design your teaching modules according to their principles.\" Therefore, their main purpose is to serve as guiding frameworks for creating effective software instruction materials and methods. The other options describe related but not central aspects of these specific teaching approaches.",
      "explanation_mn": "Эхэн дэх агуулгад нарийвчилсан болон минималист аргуудыг \"тэдгээрийн зарчмуудын дагуу сургалтын модулиудаа хэрхэн зохиохыг\" харуулах зорилгоор танилцуулсан гэж тодорхой заасан. Иймээс эдгээр аргуудын үндсэн зорилго нь программ хангамжийн үр дүнтэй зааварчилгааны материал, аргуудыг бий болгох удирдамж болох явдал юм. Бусад сонголтууд нь эдгээр сургалтын аргуудын гол зорилго биш, харин холбогдох бусад асуудлыг илэрхийлдэг.",
      "question_number": 1,
      "page_reference": "60-82"
    },
    {
      "question_en": "What is the primary objective of task-oriented software tutorials?",
      "question_mn": "Таск-чиглэсэн программ хангамжийн сургалтын үндсэн зорилго юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To highlight only the most advanced and rarely used software functionalities.",
          "text_mn": "Программ хангамжийн хамгийн дэвшилтэт болон ховор хэрэглэгддэг функцуудыг онцлох.",
          "is_correct": false,
          "source": "Related but incorrect",
          "explanation": "Task-oriented tutorials focus on skills for relevant user actions and scenarios, which typically include common and essential tasks, not exclusively advanced or rarely used functionalities."
        },
        {
          "id": "B",
          "text_en": "To introduce all available software features comprehensively to new users.",
          "text_mn": "Шинэ хэрэглэгчдэд программ хангамжийн бүх боломжуудыг иж бүрнээр танилцуулах.",
          "is_correct": false,
          "source": "Related but incorrect",
          "explanation": "Task-oriented tutorials focus on specific skills needed for tasks, not a comprehensive overview of all features, especially if some are not relevant to immediate user actions."
        },
        {
          "id": "C",
          "text_en": "To enable users to master specific software skills for meaningful workplace application.",
          "text_mn": "Хэрэглэгчдэд ажлын байран дээр программын ур чадварыг утга учиртай хэрэглэхэд сургах.",
          "is_correct": true,
          "source": "Page 31",
          "explanation": "Task-oriented tutorials are designed to teach specific skills, supporting user actions and scenarios. The goal is for users to master these skills to combine program features meaningfully in the workplace, effectively performing tasks by memory."
        },
        {
          "id": "D",
          "text_en": "To provide solutions for common software errors and troubleshooting guides.",
          "text_mn": "Нийтлэг программ хангамжийн алдаа болон асуудал шийдвэрлэх гарын авлагаар хангах.",
          "is_correct": false,
          "source": "Related but incorrect",
          "explanation": "While product support may include troubleshooting, the primary goal of a tutorial is to teach initial skills for performing tasks, not primarily to resolve errors."
        }
      ],
      "concept": "Tutorials as a form of task-oriented product support documentation",
      "difficulty": "medium",
      "explanation_en": "Task-oriented tutorials are explicitly designed to teach users the specific software skills required to perform concrete actions and scenarios relevant to their work. The goal is to enable users to meaningfully combine program features to accomplish tasks in the workplace, rather than just knowing general features or troubleshooting.",
      "explanation_mn": "Таск-чиглэсэн сургалтууд нь хэрэглэгчдэд ажлын уялдаатай үйлдэл, нөхцөл байдлыг гүйцэтгэхэд шаардлагатай программ хангамжийн тодорхой ур чадварыг заахад зориулагдсан байдаг. Энэ нь хэрэглэгчдэд программын боломжуудыг ажлын байран дээрх даалгавруудыг биелүүлэхийн тулд утга учиртай хослуулах боломжийг олгох зорилготой, ерөнхий функц эсвэл алдааг олж засварлах талаар мэдэхээс илүү юм.",
      "question_number": 2,
      "page_reference": "60-82"
    },
    {
      "question_en": "What is the primary function of user analysis in designing effective software tutorials?",
      "question_mn": "Үр дүнтэй програм хангамжийн гарын авлага боловсруулахад хэрэглэгчийн дүн шинжилгээний үндсэн үүрэг юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To determine the optimal length and format of the tutorial content.",
          "text_mn": "Гарын авлагын агуулгын оновчтой урт, форматыг тодорхойлох.",
          "is_correct": false,
          "source": null,
          "explanation": null
        },
        {
          "id": "B",
          "text_en": "To identify specific skills and actions users need to learn for their tasks.",
          "text_mn": "хэрэглэгчдийн даалгаврыг гүйцэтгэхэд шаардлагатай тодорхой ур чадвар, үйлдлийг тодорхойлох.",
          "is_correct": true,
          "source": "Page ??",
          "explanation": null
        },
        {
          "id": "C",
          "text_en": "To draw upon the author's personal experience with software learning difficulties.",
          "text_mn": "Зохиогчийн програм хангамж сурах үеийн хувийн туршлагаас суралцах.",
          "is_correct": false,
          "source": null,
          "explanation": null
        },
        {
          "id": "D",
          "text_en": "To evaluate the effectiveness of existing teaching modules and materials.",
          "text_mn": "Одоо байгаа сургалтын модуль, материалыг үр дүнтэй эсэхийг үнэлэх.",
          "is_correct": false,
          "source": null,
          "explanation": null
        }
      ],
      "concept": "The role of user analysis in identifying skills to teach in tutorials",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly states that a 'thorough user analysis' helps 'identify what skills you need to teach.' It emphasizes linking user actions and scenarios to the specific skills required to support those scenarios within the software.",
      "explanation_mn": "Үндсэн агуулгад 'нарийн хэрэглэгчийн дүн шинжилгээ' нь 'заах ёстой ур чадварыг тодорхойлоход' тусалдаг гэж тодорхой заасан. Энэ нь хэрэглэгчийн үйлдэл, нөхцөл байдлыг програм хангамжийн хүрээнд эдгээр нөхцөл байдлыг дэмжихэд шаардлагатай тодорхой ур чадваруудтай холбохыг онцолж байна.",
      "question_number": 3,
      "page_reference": "60-82"
    },
    {
      "question_en": "What is the primary consideration when designing tutorials to teach software skills effectively?",       
      "question_mn": "Програм хангамжийн ур чадварыг үр дүнтэй заах гарын авлага зохиохдоо юуг хамгийн түрүүнд анхаарах ёстой вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Aligning content with specific user actions and the required program skills.",
          "text_mn": "Агуулгыг хэрэглэгчийн тодорхой үйлдлүүд болон шаардлагатай програмын ур чадваруудтай уялдуулах.",        
          "is_correct": true,
          "source": "Page 31",
          "explanation": "The primary context stresses the importance of identifying user actions and scenarios first, then determining the specific program skills needed to accomplish those actions. This ensures the tutorial is tailored to real-world tasks."
        },
        {
          "id": "B",
          "text_en": "Covering all program features to ensure a thorough understanding.",
          "text_mn": "Бүрэн гүйцэд ойлголтыг баталгаажуулахын тулд програмын бүх функцийг хамруулах.",
          "is_correct": false,
          "source": "Page 31",
          "explanation": "This is a plausible distractor because teaching program features is part of tutorials, but the text emphasizes selecting *specific* skills relevant to user actions, not covering *all* features comprehensively."
        },
        {
          "id": "C",
          "text_en": "Making tutorials interactive and easily accessible online.",
          "text_mn": "Гарын авлагуудыг интерактив, онлайнаар хялбар хүртээмжтэй болгох.",
          "is_correct": false,
          "source": "Page 30",
          "explanation": "While the text mentions online and demonstration-type tutorials as important forms, this relates to the *delivery method* of tutorials, not the primary *content planning* consideration based on user needs."
        },
        {
          "id": "D",
          "text_en": "Highlighting advanced features demonstrated in award-winning examples.",
          "text_mn": "Шагналт жишээнүүдээр харуулсан дэвшилтэт функцуудыг онцлох.",
          "is_correct": false,
          "source": "Page 30",
          "explanation": "The text mentions an award-winning example with advanced features, but the core guideline for designing tutorials focuses on identifying user actions and basic skills, not solely prioritizing advanced features or award-winning content for every tutorial."
        }
      ],
      "concept": "Planning tutorials around specific user actions and associated program skills",
      "difficulty": "medium",
      "explanation_en": "The primary context emphasizes identifying specific user actions or scenarios and then deciding which program skills are necessary to support these actions. This ensures the tutorial is task-oriented and relevant to the user's needs in the workplace, rather than just covering all features or focusing on delivery methods. The correct approach involves tailoring the content to enable users to perform meaningful actions.",
      "explanation_mn": "Эх текст нь хэрэглэгчийн тодорхой үйлдлүүд эсвэл нөхцөл байдлыг тодорхойлж, дараа нь эдгээр үйлдлүүдийг дэмжихэд ямар програмын ур чадварууд шаардлагатайг шийдвэрлэхийг чухалчилдаг. Энэ нь гарын авлага нь бүх функцийг хамруулах эсвэл хүргэх аргад анхаарахаас илүүтэйгээр хэрэглэгчийн ажлын байран дахь хэрэгцээнд чиглэсэн, ач холбогдолтой байхыг баталгаажуулдаг. Зөв хандлага нь хэрэглэгчдэд утга учиртай үйлдлүүдийг гүйцэтгэх боломжийг олгохын тулд агуулгыг тохируулах явдал юм.",  
      "question_number": 4,
      "page_reference": "60-82"
    },
    {
      "question_en": "What is a primary goal of well-designed software tutorials?",
      "question_mn": "Сайн зохиогдсон програм хангамжийн гарын авлагын үндсэн зорилго юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To provide valuable information about project planning and required resources.",
          "text_mn": "Төслийн төлөвлөлт болон шаардлагатай нөөцийн талаар үнэ цэнэтэй мэдээлэл өгөх.",
          "is_correct": false
        },
        {
          "id": "B",
          "text_en": "To enable users to perform software skills by memory.",
          "text_mn": "Хэрэглэгчдэд програм хангамжийн ур чадварыг цээжээр гүйцэтгэх боломжийг олгох.",
          "is_correct": true
        },
        {
          "id": "C",
          "text_en": "To characterize main trends in tutorial design for meeting user task needs.",
          "text_mn": "Хэрэглэгчийн ажлын хэрэгцээг хангахын тулд гарын авлагын дизайны гол чиг хандлагыг тодорхойлох.",        
          "is_correct": false
        },
        {
          "id": "D",
          "text_en": "To combine memories of learning difficulties with observation of others.",
          "text_mn": "Суралцахдаа учирсан бэрхшээлийн дурсамжийг бусдыг ажиглахтай хослуулах.",
          "is_correct": false
        }
      ],
      "concept": "Designing tutorials to enable users to perform software skills by memory",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly states that documentation like the Essential TitleMotion tutorial is 'designed to teach software skills so that the user can perform them by memory.' This highlights the core objective of such tutorials. The other options describe aspects of tutorial creation or how to read the chapter for different purposes, but not the fundamental goal of the tutorial's design for the end-user.",
      "explanation_mn": "Үндсэн контекстэд Essential TitleMotion гарын авлага зэрэг баримт бичгийг 'хэрэглэгчдэд програм хангамжийн ур чадварыг цээжээр гүйцэтгэх боломжийг олгох зорилгоор' бүтээсэн гэж тодорхой заасан байдаг. Энэ нь ийм гарын авлагын гол зорилгыг онцолж байна. Бусад сонголтууд нь гарын авлага бүтээх эсвэл бүлгийг өөр өөр зорилгоор хэрхэн унших тухай өгүүлдэг боловч хэрэглэгчид зориулсан гарын авлагын дизайны үндсэн зорилго биш юм.",
      "question_number": 5,
      "page_reference": "60-82"
    },
    {
      "question_en": "What is a key principle for designing task-oriented software tutorials?",
      "question_mn": "Даалгавар төвтэй програм хангамжийн гарын авлага зохиоход ямар зарчим гол үүрэг гүйцэтгэдэг вэ?",        
      "choices": [
        {
          "id": "A",
          "text_en": "Minimizing the amount of instructional content to reduce learning time.",
          "text_mn": "Сургалтын хугацааг багасгахын тулд зааварчилгааны агуулгыг хязгаарлах.",
          "is_correct": false,
          "source": null,
          "explanation": null
        },
        {
          "id": "B",
          "text_en": "Providing comprehensive details about every software feature and function.",
          "text_mn": "Програм хангамжийн бүх онцлог, функцийг иж бүрэн нарийвчлан тайлбарлах.",
          "is_correct": false,
          "source": null,
          "explanation": null
        },
        {
          "id": "C",
          "text_en": "Encouraging users to explore software features without specific guidance.",
          "text_mn": "Хэрэглэгчдийг тодорхой зааваргүйгээр програм хангамжийн функцийг судлахыг дэмжих.",
          "is_correct": false,
          "source": null,
          "explanation": null
        },
        {
          "id": "D",
          "text_en": "Identifying specific user actions and the skills needed to perform workplace tasks.",
          "text_mn": "Хэрэглэгчийн тодорхой үйлдлүүд болон ажлын байран дээрх даалгаврыг гүйцэтгэхэд шаардлагатай ур чадварыг тодорхойлох.",
          "is_correct": true,
          "source": "Page 31",
          "explanation": "Task-oriented tutorials, as described in the text, prioritize identifying specific user actions and the necessary skills to accomplish meaningful tasks in a workplace setting. This approach stems from a thorough user analysis to ensure the documentation directly supports how users will practically apply the software."
        }
      ],
      "concept": "Principles of task-oriented documentation as applied to tutorials",
      "difficulty": "medium",
      "explanation_en": "Task-oriented tutorials, as described in the text, prioritize identifying specific user actions and the necessary skills to accomplish meaningful tasks in a workplace setting. This approach stems from a thorough user analysis to ensure the documentation directly supports how users will practically apply the software.",
      "explanation_mn": "Текстэд дурдсанаар, даалгавар төвтэй гарын авлага нь хэрэглэгчийн тодорхой үйлдлүүд болон ажлын байран дээр утга учиртай даалгавруудыг гүйцэтгэхэд шаардлагатай ур чадварыг тодорхойлоход чиглэгддэг. Энэхүү арга нь хэрэглэгчийн нарийн дүн шинжилгээнд тулгуурлаж, програм хангамжийг хэрхэн практикт ашиглахыг шууд дэмжих зорилготой юм.",
      "question_number": 6,
      "page_reference": "60-82"
    },
    {
      "question_en": "In designing software tutorials, what is the primary guideline for effectively linking program features to user actions?",
      "question_mn": "Програм хангамжийн гарын авлага зохиохдоо програмын функцуудыг хэрэглэгчийн үйлдлүүдтэй үр дүнтэй холбох гол удирдамж юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Present all program features comprehensively before demonstrating any user tasks.",
          "text_mn": "Хэрэглэгчийн даалгавар үзүүлэхээс өмнө програмын бүх функцийг иж бүрэн танилцуулах.",
          "is_correct": false
        },
        {
          "id": "B",
          "text_en": "Prioritize teaching advanced features that users can perform entirely from memory.",
          "text_mn": "Хэрэглэгчид бүрэн санах ойн тусламжтайгаар гүйцэтгэх боломжтой нарийн функцуудыг заахад анхаарах.",      
          "is_correct": false
        },
        {
          "id": "C",
          "text_en": "Identify user actions and scenarios first, then determine the necessary program skills.",
          "text_mn": "Хэрэглэгчийн үйлдлүүд болон нөхцөл байдлыг эхлээд тодорхойлж, шаардлагатай програмын ур чадварыг тогтоох.",
          "is_correct": true,
          "source": "Page 31"
        },
        {
          "id": "D",
          "text_en": "Categorize features by their location within the software's graphical user interface.",
          "text_mn": "Функцуудыг програмын график хэрэглэгчийн интерфэйс доторх байршлаар нь ангилах.",
          "is_correct": false
        }
      ],
      "concept": "Guidelines for tying program features to user actions in tutorial design",
      "difficulty": "medium",
      "explanation_en": "The primary guideline for connecting program features to user actions in tutorial design is to first identify the specific actions or scenarios users need to perform through thorough user analysis. Once these user needs are established, designers can then determine which program skills and features are essential to accomplish those tasks meaningfully in the workplace.",
      "explanation_mn": "Програм хангамжийн гарын авлагын загварт програмын функцуудыг хэрэглэгчийн үйлдлүүдтэй холбох гол удирдамж нь хэрэглэгчийн нарийвчилсан дүн шинжилгээгээр дамжуулан хэрэглэгчдийн гүйцэтгэх шаардлагатай тодорхой үйлдлүүд эсвэл нөхцөл байдлыг эхлээд тодорхойлох явдал юм. Хэрэглэгчийн эдгээр хэрэгцээг тогтоосны дараа дизайнерууд ажлын байран дээр эдгээр даалгавруудыг утга учиртай гүйцэтгэхэд ямар програмын ур чадвар, функцууд зайлшгүй шаардлагатайг тодорхойлж болно.",
      "question_number": 7,
      "page_reference": "60-82"
    },
    {
      "question_en": "What is the primary consideration when selecting program features for a software tutorial?",
      "question_mn": "Програм хангамжийн гарын авлагад багтаах онцлог шинж чанаруудыг сонгоход юуг хамгийн түрүүнд харгалзан үздэг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "All available features to ensure the tutorial is exhaustively comprehensive.",
          "text_mn": "Гарын авлагыг иж бүрэн, бүх талыг хамарсан байлгахын тулд боломжит бүх онцлог шинж чанарууд.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "The text does not advocate for including all features; instead, it highlights the importance of selecting features that are relevant to specific user roles and their tasks, not generic comprehensive coverage."
        },
        {
          "id": "B",
          "text_en": "Features that support specific user job scenarios and meaningful workplace application.",
          "text_mn": "Хэрэглэгчийн ажлын тодорхой хувилбарууд болон ажлын байранд утга учиртай хэрэглээг дэмжих онцлог шинж чанарууд.",
          "is_correct": true,
          "source": "Page ??",
          "explanation": "The text emphasizes identifying user actions and scenarios based on user analysis, and teaching skills that enable users to \"combine program features meaningfully in the workplace\" for their specific roles, such as teaching freehand tools to artists versus line tools to draftspersons."
        },
        {
          "id": "C",
          "text_en": "The most technically advanced or complex features of the software.",
          "text_mn": "Програм хангамжийн хамгийн дэвшилтэт буюу нарийн төвөгтэй онцлог шинж чанарууд.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While advanced features might be demonstrated, the primary criterion for selection is not their technical complexity but their relevance to user job performance and ability to be used meaningfully in the workplace based on user analysis."
        },
        {
          "id": "D",
          "text_en": "Features that are easiest for the documentation writer to explain or demonstrate.",
          "text_mn": "Баримт бичиг зохиогчид тайлбарлах эсвэл үзүүлэхэд хамгийн хялбар онцлог шинж чанарууд.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "The text focuses on user-centric design, prioritizing what the user needs to learn for their tasks, rather than the convenience of the documentation writer in explaining or demonstrating features."
        }
      ],
      "concept": "Criteria for selecting program features for tutorials (central to job performance, essential for efficient use)",
      "difficulty": "medium",
      "explanation_en": "The primary context highlights that feature selection should be driven by user analysis, focusing on skills required for specific job scenarios. Tutorials should teach how to combine program features meaningfully in the workplace, tailored to different user roles and their practical needs.",
      "explanation_mn": "Үндсэн текстээс харахад, онцлог шинж чанарыг сонгохдоо хэрэглэгчийн дүн шинжилгээнд тулгуурлан, ажлын тодорхой хувилбаруудад шаардлагатай ур чадваруудад анхаарлаа хандуулах ёстойг онцолсон. Гарын авлага нь програмын онцлог шинж чанаруудыг ажлын байранд утга учиртай хослуулахыг заах ёстой бөгөөд энэ нь хэрэглэгчийн янз бүрийн үүрэг, тэдний практик хэрэгцээнд нийцсэн байна.",
      "question_number": 8,
      "page_reference": "60-82"
    },
    {
      "question_en": "What is the foundational step in designing effective software tutorials?",
      "question_mn": "Үр дүнтэй програм хангамжийн гарын авлага зохиохын үндсэн алхам юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Observing user difficulties with new software and learning processes.",
          "text_mn": "Шинэ програм хангамжтай хэрэглэгчийн бэрхшээл, суралцах үйл явцыг ажиглах.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While important for refining tutorials, observing user difficulties is a part of ongoing improvement and user analysis, not the initial content structuring and planning."
        },
        {
          "id": "B",
          "text_en": "Applying either elaborative or minimalist teaching approaches immediately.",
          "text_mn": "Дэлгэрэнгүй эсвэл минималист заах аргыг нэн даруй хэрэглэх.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Applying teaching approaches comes after identifying what content needs to be taught, not as the initial foundational step."
        },
        {
          "id": "C",
          "text_en": "Identifying specific user actions and the required program skills for those tasks.",
          "text_mn": "Хэрэглэгчийн тодорхой үйлдлүүд болон тэдгээрт шаардагдах програмын ур чадварыг тодорхойлох.",
          "is_correct": true,
          "source": "Page ??",
          "explanation": "The primary context emphasizes that the foundational step in designing effective tutorials is to 'Identify User Actions You Need to Support' and then 'Decide on what skills you want to teach to support these scenarios.' This involves a thorough user analysis to determine what specific tasks users need to perform and what program skills are essential for accomplishing those tasks meaningfully in the workplace."
        },
        {
          "id": "D",
          "text_en": "Designing visually engaging interfaces and interactive elements.",
          "text_mn": "Нүдэнд таатай интерфэйс, интерактив элементүүдийг зохиох.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Designing visual and interactive elements relates to the presentation and delivery of the tutorial, which follows the foundational planning of its content and objectives."
        }
      ],
      "concept": "Structuring lesson plans based on identified user actions and necessary program skills",
      "difficulty": "medium",
      "explanation_en": "The primary context clearly states that the initial step in tutorial design is to 'Identify User Actions You Need to Support' through user analysis and then 'Decide on what skills you want to teach to support these scenarios.' This forms the basis for structuring lesson plans, ensuring that the tutorial focuses on practical, task-oriented skills relevant to the user's needs. Without first understanding the user's required actions and the specific program skills to accomplish them, an effective lesson plan cannot be created.",
      "explanation_mn": "Үндсэн агуулга нь гарын авлагын дизайны анхны алхам бол хэрэглэгчийн шинжилгээгээр дамжуулан 'Дэмжих шаардлагатай хэрэглэгчийн үйлдлүүдийг тодорхойлж', дараа нь 'Эдгээр хувилбаруудыг дэмжихэд ямар ур чадварыг заахаа шийдэх' явдал гэдгийг тодорхой заасан. Энэ нь хичээлийн төлөвлөгөөг бүтэцлэх үндэс болж, гарын авлага нь хэрэглэгчийн хэрэгцээнд нийцсэн практик, даалгавар чиглэсэн ур чадваруудад анхаарлаа хандуулах баталгаа болдог. Хэрэглэгчийн шаардлагатай үйлдлүүд болон тэдгээрийг гүйцэтгэхэд шаардлагатай програмын тодорхой ур чадваруудыг эхлээд ойлгохгүйгээр үр дүнтэй хичээлийн төлөвлөгөөг боловсруулах боломжгүй.",
      "question_number": 9,
      "page_reference": "60-82"
    },
    {
      "question_en": "What combination of design elements most effectively enables users to apply software skills meaningfully?",
      "question_mn": "Хэрэглэгчдэд програм хангамжийн ур чадварыг үр дүнтэй ашиглах боломжийг олгоход дизайны ямар элементүүдийн хослол хамгийн үр дүнтэй вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Exhaustive descriptions of every software function available to the user.",
          "text_mn": "Хэрэглэгчид зориулсан програмын функц бүрийн дэлгэрэнгүй тайлбар.",
          "is_correct": false,
          "source": "Page 31",
          "explanation": "The text suggests tailoring teaching to specific user roles and their required actions, such as teaching different drawing tools to artists versus draftspersons, implying a selective, not exhaustive, approach to features within a tutorial."
        },
        {
          "id": "B",
          "text_en": "Instructions derived from the author's personal struggles learning similar software.",
          "text_mn": "Зохиогчийн өөрийн програм сурах явцад гарсан бэрхшээлээс үүдэлтэй зааварчилгаа.",
          "is_correct": false,
          "source": "Page 31",
          "explanation": "The text advises tutorial writers to 'rely on memories of your own learning' as a guideline for their design process, but this is an input for the author, not a component directly presented within the tutorial for the user."    
        },
        {
          "id": "C",
          "text_en": "Comprehensive guides to software installation and basic system requirements.",
          "text_mn": "Програм хангамж суулгах, системийн үндсэн шаардлагуудын иж бүрэн гарын авлага.",
          "is_correct": false,
          "source": "Page 31",
          "explanation": "While important for overall documentation, installation guides and system requirements are not core components for teaching users how to apply software skills meaningfully within a tutorial's design."
        },
        {
          "id": "D",
          "text_en": "Integrated graphics illustrating features and real-world workplace scenarios.",
          "text_mn": "Функцийг харуулсан нэгдсэн график дүрслэл болон бодит ажлын байрны нөхцөл байдал.",
          "is_correct": true,
          "source": "Page 31",
          "explanation": "The primary context highlights that effective tutorials use visual aids, as demonstrated by figures illustrating meaningful interaction with software through technology. It also emphasizes designing around user actions and scenarios relevant to their specific roles and how they will 'combine program features meaningfully in the workplace.'"
        }
      ],
      "concept": "Components of effective tutorial design, including integrated graphics and workplace examples",
      "difficulty": "medium",
      "explanation_en": "The primary context emphasizes that effective tutorials use visual aids, as shown by Figure 2.1 and Figure 2.2, which illustrate meaningful interaction with software through technology. It also stresses the importance of designing tutorials around user actions and scenarios relevant to their specific roles and how they will \"combine program features meaningfully in the workplace.\" Therefore, integrated graphics and real-world workplace examples are crucial design components for users to apply skills effectively.",
      "explanation_mn": "Өгөгдсөн эх сурвалжид үр дүнтэй гарын авлага нь програм хангамжтай утга учиртай харилцан үйлчлэлийг харуулсан 2.1 ба 2.2-р зургуудаар нотлогдсон харааны хэрэглэгдэхүүн ашиглах ёстойг онцолжээ. Мөн хэрэглэгчийн үүрэг, тэдний \"ажлын байрандаа програмын онцлог шинж чанаруудыг утга учиртай хослуулах\" хэрэгцээнд нийцсэн үйлдлүүд болон нөхцөл байдлуудад тулгуурлан гарын авлагыг боловсруулахын чухлыг тэмдэглэсэн. Иймд, нэгдсэн график дүрслэл болон бодит ажлын байрны жишээнүүд нь хэрэглэгчдэд ур чадварыг үр дүнтэй ашиглахад чухал дизайны бүрэлдэхүүн хэсгүүд юм.",
      "question_number": 10,
      "page_reference": "60-82"
    }
  ]
}