{
  "total_generated": 10,
  "mcqs": [
    {
      "question_en": "When designing software tutorials based on elaborative or minimalist principles, what fundamental objective should primarily guide the selection of user actions and skill instruction?",
      "question_mn": "Програм хангамжийн сургалтын гарын авлагыг дэлгэрэнгүй эсвэл минималист зарчмуудаар боловсруулахдаа хэрэглэгчийн үйлдлүүд болон ур чадварын зааварчилгааг сонгоход ямар үндсэн зорилго удирдлага болох ёстой вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To maximize user engagement and curiosity through interactive elements, fostering a broader appreciation for the software's overall capabilities and design.",
          "text_mn": "Интерактив элементүүдээр дамжуулан хэрэглэгчийн оролцоо, сониуч занг дээд зэргээр нэмэгдүүлж, програм хангамжийн ерөнхий чадамж, дизайныг илүү өргөн хүрээнд ойлгоход туслах.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Engagement is beneficial, but it's a means to an end. The core objective is concrete skill acquisition for task completion, not solely broader appreciation or curiosity about design."
        },
        {
          "id": "B",
          "text_en": "To enable users to master specific software skills, perform them by memory, and meaningfully combine program features to accomplish tasks effectively in their workplace scenarios.",
          "text_mn": "Хэрэглэгчдийг тодорхой програм хангамжийн ур чадварыг эзэмшүүлж, тэдгээрийг цээжээр гүйцэтгэх, мөн програмын онцлогийг ажлын байрандаа үүргээ үр дүнтэй гүйцэтгэхэд утга учиртайгаар хослуулах чадвартай болгох.",
          "is_correct": true,
          "source": "Page 30-31",
          "explanation": "The text explicitly states the goal is to 'teach software skills so that the user can perform them by memory' and 'meet user task needs,' emphasizing how users 'combine program features meaningfully in the workplace.' This directly guides the selection of user actions and skills."
        },
        {
          "id": "C",
          "text_en": "To equip users with robust troubleshooting skills, enabling them to independently resolve common software issues and interpret complex error messages effectively.",
          "text_mn": "Хэрэглэгчдийг програм хангамжийн нийтлэг асуудлыг бие даан шийдвэрлэх, нарийн төвөгтэй алдааны мессежийг үр дүнтэй тайлбарлах чадвартай болгох.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Troubleshooting is a valuable skill, but the text focuses on teaching users to perform tasks and combine features meaningfully, not primarily on identifying and resolving issues that may arise during use."
        },
        {
          "id": "D",
          "text_en": "To ensure users fully grasp the underlying software architecture and explore all advanced features, preparing them for comprehensive system administration.",
          "text_mn": "Хэрэглэгчдийг үндсэн програм хангамжийн архитектурыг бүрэн ойлгож, бүх дэвшилтэт функцуудыг судлах чадвартай болгож, иж бүрэн системийн удирдлагад бэлтгэх.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While understanding features is important, the primary goal outlined in the text is task-oriented skill mastery and memory-based performance, not comprehensive system administration or deep architectural understanding."
        }
      ],
      "concept": "Elaborative and minimalist approaches to teaching software",
      "difficulty": "hard",
      "explanation_en": "The primary context repeatedly emphasizes that software tutorials, especially those incorporating elaborative or minimalist approaches, aim to enable users to 'perform skills by memory' and 'combine program features meaningfully in the workplace' to meet 'user task needs.' This involves identifying specific user actions and skills necessary to support real-world scenarios. The goal is practical, task-oriented mastery, not just exploration, troubleshooting, or general system understanding. The correct answer synthesizes these key objectives, highlighting the focus on memorized skill application for effective task accomplishment.",
      "explanation_mn": "Үндсэн агуулгад програм хангамжийн сургалтын гарын авлага, ялангуяа дэлгэрэнгүй эсвэл минималист арга барилыг ашигласан нь хэрэглэгчдэд 'ур чадварыг цээжээр гүйцэтгэх' болон 'ажлын байрандаа програмын онцлогийг утга учиртай хослуулах' чадвартай болгож, 'хэрэглэгчийн даалгаврын хэрэгцээг хангах' зорилготой болохыг удаа дараа онцолж байна. Энэ нь бодит амьдралын хувилбаруудыг дэмжихэд шаардлагатай хэрэглэгчийн тодорхой үйлдэл, ур чадварыг тодорхойлохыг шаарддаг. Зорилго нь зөвхөн судлах, алдааг олж засварлах, эсвэл системийн ерөнхий ойлголт биш, харин практик, даалгавар дээр суурилсан ур чадварыг эзэмших явдал юм. Зөв хариулт нь эдгээр гол зорилгыг нэгтгэж, үр дүнтэй даалгавар гүйцэтгэхэд зориулсан цээжээр гүйцэтгэх ур чадварт анхаарлаа хандуулдаг.",
      "question_number": 1,
      "page_reference": "60-82"
    },
    {
      "question_en": "When designing teaching modules, what is the fundamental principle for effectively integrating elaborative and minimalist approaches to teach software skills?",
      "question_mn": "Сургалтын модулийг боловсруулахдаа програм хангамжийн ур чадварыг заахын тулд нарийвчилсан болон минималист аргуудыг үр дүнтэй хослуулах үндсэн зарчим юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Aligning teaching modules with user-specific actions and workplace scenarios, enabling meaningful integration of software features into daily tasks.",
          "text_mn": "Сургалтын модулийг хэрэглэгчийн онцлог үйлдэл, ажлын байрны нөхцөл байдалтай уялдуулж, програм хангамжийн функцийг өдөр тутмын ажилд утга учиртай нэгтгэх боломжийг олгох.",
          "is_correct": true,
          "source": "Page ??",
          "explanation": "The text emphasizes that when designing teaching modules (tutorials) using elaborative and minimalist approaches, the fundamental principle is to 'Identify User Actions You Need to Support' through 'thorough user analysis' and 'Decide on what skills you want to teach to support these scenarios.' The ultimate goal is to teach users 'how to combine program features meaningfully in the workplace.' Therefore, aligning instruction with the specific, task-oriented needs of users in their professional context is paramount for effective software skill acquisition and application. This ensures that the teaching is relevant, practical, and directly supports users in their actual job functions, which is a core tenet for both elaborative and minimalist designs."
        },
        {
          "id": "B",
          "text_en": "Designing interactive exercises that provide immediate feedback, fostering a trial-and-error learning environment for rapid skill acquisition.",
          "text_mn": "Шуурхай хариу үйлдэл үзүүлдэг интерактив дасгалуудыг боловсруулж, туршилт-алдааны сургалтын орчинг бүрдүүлснээр ур чадварыг хурдан эзэмших.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "This distractor describes a teaching methodology or a feature of a tutorial (interactive exercises, feedback) rather than the foundational principle guiding what content to teach or how to structure the learning path based on user needs and workplace relevance when integrating elaborative and minimalist approaches."
        },
        {
          "id": "C",
          "text_en": "Ensuring comprehensive coverage of all software features and functions, allowing users to explore capabilities at their own pace and skill level.",
          "text_mn": "Програм хангамжийн бүх функц, үүргийг иж бүрэн хамруулж, хэрэглэгчдэд өөрийн хурд, ур чадварын түвшинд боломжуудыг судлах боломж олгох.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "This distractor focuses on comprehensive coverage and user exploration, which, while beneficial in some learning contexts, isn't highlighted as the fundamental integrating principle for module design when applying elaborative and minimalist approaches. The text prioritizes specific, task-oriented skills for workplace application over generic feature exploration."
        },
        {
          "id": "D",
          "text_en": "Structuring documentation logically with clear progression from basic to advanced topics, optimizing for cognitive load and information retention across user groups.",
          "text_mn": "Баримт бичгийг үндсэнээс нарийвчилсан сэдвүүдэд тодорхой дэс дараалалтайгаар логик байдлаар бүтэцчилж, хэрэглэгчийн бүх бүлгийн танин мэдэхүйн ачаалал, мэдээллийг тогтоох чадварыг оновчтой болгох.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "This distractor addresses general documentation structure and pedagogical theory (cognitive load), which are important for overall instructional design. However, it does not represent the core principle of tailoring software teaching modules to specific user actions and their meaningful application in the workplace, which is central to the text's discussion of elaborative and minimalist approaches."
        }
      ],
      "concept": "Designing teaching modules based on elaborative and minimalist principles",
      "difficulty": "hard",
      "explanation_en": "The text emphasizes that when designing teaching modules (tutorials) using elaborative and minimalist approaches, the fundamental principle is to 'Identify User Actions You Need to Support' through 'thorough user analysis' and 'Decide on what skills you want to teach to support these scenarios.' The ultimate goal is to teach users 'how to combine program features meaningfully in the workplace.' Therefore, aligning instruction with the specific, task-oriented needs of users in their professional context is paramount for effective software skill acquisition and application. This ensures that the teaching is relevant, practical, and directly supports users in their actual job functions, which is a core tenet for both elaborative and minimalist designs. Distractor B focuses on comprehensive coverage and exploration, which deviates from the text's emphasis on targeted, workplace-relevant skills. Distractor C describes a teaching methodology rather than the foundational content design principle. Distractor D addresses general documentation structure and cognitive load, which, while important, does not capture the specific principle of tailoring content to user actions for meaningful workplace application as described in the primary context.",
      "explanation_mn": "Уг текст нь нарийвчилсан болон минималист аргуудыг ашиглан сургалтын модулийг (зааварчилгааг) зохион бүтээхдээ үндсэн зарчим нь \"хэрэглэгчийн дүн шинжилгээгээр\" \"дэмжих шаардлагатай хэрэглэгчийн үйлдлүүдийг тодорхойлох\", мөн \"эдгээр нөхцөл байдлыг дэмжихэд ямар ур чадвар заахыг шийдэх\" явдал гэдгийг онцолж байна. Эцсийн зорилго нь хэрэглэгчдэд \"програм хангамжийн функцийг ажлын байранд утга учиртай хослуулахыг\" заах юм. Иймээс, зааварчилгааг хэрэглэгчдийн мэргэжлийн орчин дахь тодорхой, даалгавар дээр суурилсан хэрэгцээтэй уялдуулах нь програм хангамжийн ур чадварыг үр дүнтэй эзэмшиж, хэрэглэхэд чухал ач холбогдолтой. Энэ нь сургалтыг хамааралтай, практик байлгаж, хэрэглэгчдийг ажлын үүргээ гүйцэтгэхэд шууд дэмждэг бөгөөд энэ нь нарийвчилсан болон минималист загваруудын аль алиных нь гол зарчим юм. В хариулт нь иж бүрэн хамралт болон судлахыг онцолж байгаа нь текстийн ажлын байртай холбоотой, зорилтот ур чадварт чиглэсэн ач холбогдлоос хазайж байна. С хариулт нь агуулгын үндсэн дизайны зарчмаас илүүтэйгээр сургалтын арга зүйг тодорхойлж байна. D хариулт нь баримт бичгийн ерөнхий бүтэц болон танин мэдэхүйн ачааллыг хөндөж байгаа боловч, анхдагч контентод дурдсан хэрэглэгчийн үйлдлүүд болон ажлын байранд утга учиртай хэрэглэхэд агуулгыг тохируулах тусгай зарчмыг илэрхийлэхгүй.",
      "question_number": 2,
      "page_reference": "60-82"
    },
    {
      "question_en": "What fundamental principle drives the design of effective task-oriented software tutorials that truly empower users?",
      "question_mn": "Хэрэглэгчдийг бодитоор чадавхжуулах, үр дүнтэй даалгавар-чиглэсэн программ хангамжийн гарын авлага зохиохын үндсэн зарчим юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Streamlining the tutorial development process by estimating required resources and time, ensuring efficient project completion.",
          "text_mn": "Шаардлагатай нөөц, хугацааг тооцоолж, гарын авлага боловсруулах үйл явцыг хялбаршуулж, төслийг үр дүнтэй дуусгах.",
          "is_correct": false,
          "source": null,
          "explanation": "Estimating resources and time is crucial for project planning and management of tutorial creation, as mentioned in the text. However, this pertains to the logistics of development, not the fundamental design principle that empowers users by focusing on their task needs and skill acquisition."
        },
        {
          "id": "B",
          "text_en": "Structuring content to facilitate rote memorization of software commands and interface elements, enabling quick recall during operation.",
          "text_mn": "Программ хангамжийн тушаал болон интерфэйсийн элементүүдийг цээжлэхэд хялбар байхаар контентыг зохион байгуулж, ашиглалтын явцад хурдан санах боломжийг олгох.",
          "is_correct": false,
          "source": null,
          "explanation": "The text emphasizes teaching skills to combine features meaningfully and allowing for 'software exploration,' which contrasts with rote memorization. While performance by memory is an outcome, it's a result of skill mastery and understanding application, not just memorizing commands."
        },
        {
          "id": "C",
          "text_en": "Identifying specific user actions through analysis to teach skills for meaningfully combining software features within their workplace scenarios.",
          "text_mn": "Хэрэглэгчийн тодорхой үйлдлүүдийг шинжлэх ухааны үндэслэлтэйгээр тодорхойлж, программ хангамжийн функцуудыг ажлын байрандаа утга учиртай хослуулах ур чадварыг заах.",
          "is_correct": true,
          "source": "Primary Context",
          "explanation": "The text emphasizes identifying specific user actions and scenarios via thorough user analysis, then teaching the precise skills required to combine program features meaningfully in the workplace. This approach ensures users gain practical proficiency to perform tasks effectively, often from memory or through exploration, which is the core goal of task-oriented documentation."
        },
        {
          "id": "D",
          "text_en": "Highlighting all advanced software functionalities and providing step-by-step instructions for each to ensure comprehensive feature knowledge.",
          "text_mn": "Программ хангамжийн бүх дэвшилтэт функцуудыг онцолж, тус бүрд нь алхам алхмаар зааварчилгаа өгч, функцийн талаар иж бүрэн мэдлэг олгох.",
          "is_correct": false,
          "source": null,
          "explanation": "While tutorials do explain features, the fundamental principle for task-oriented design is to focus on user actions and scenarios, teaching specific skills for meaningful application in the workplace, rather than merely providing comprehensive knowledge of all features."
        }
      ],
      "concept": "Writing task-oriented tutorials, including online and demonstration types",
      "difficulty": "hard",
      "explanation_en": "The core principle for designing effective task-oriented software tutorials, as outlined in the text, is centered on the user's real-world needs. This involves a comprehensive user analysis to pinpoint specific actions and scenarios relevant to their job. The tutorial then teaches the necessary skills to empower users to meaningfully combine various software features to accomplish those tasks in their workplace, ultimately leading to proficiency and the ability to perform tasks from memory or through exploration. The distractors either focus on secondary aspects (like project management), misinterpret the goal (rote memorization vs. skill application), or present a less task-focused approach (highlighting all features rather than specific user actions).",
      "explanation_mn": "Үр дүнтэй даалгавар-чиглэсэн программ хангамжийн гарын авлага зохиохын гол зарчим нь хэрэглэгчийн бодит хэрэгцээнд тулгуурладаг. Энэ нь хэрэглэгчийн нарийн дүн шинжилгээ хийж, тэдний ажилд хамаарах тодорхой үйлдлүүд болон нөхцөл байдлыг тодорхойлоход оршино. Гарын авлага нь хэрэглэгчдэд янз бүрийн программ хангамжийн функцуудыг ажлын байрандаа утга учиртай хослуулах, эдгээр даалгаврыг гүйцэтгэхэд шаардлагатай ур чадварыг олгохыг заана. Энэ нь эцэстээ ур чадварыг эзэмшиж, даалгавруудыг санах ойгоор эсвэл судлах замаар гүйцэтгэх чадварт хүргэдэг. Бусад хариултууд нь хоёрдогч асуудалд (төслийн менежмент гэх мэт) анхаарлаа хандуулах, зорилгыг буруу тайлбарлах (цээжлэх vs. ур чадвар хэрэглэх), эсвэл даалгавар-чиглэсэн бус хандлагыг (бүх функцийг онцлох vs. тодорхой хэрэглэгчийн үйлдлүүд) харуулах тул буруу юм.",
      "question_number": 3,
      "page_reference": "60-82"
    },
    {
      "question_en": "When designing software tutorials, what fundamental principle should guide the selection of skills after a thorough user analysis?",
      "question_mn": "Програм хангамжийн гарын авлага зохиохдоо, хэрэглэгчийн иж бүрэн шинжилгээний дараа ямар үндсэн зарчим ур чадварын сонголтыг чиглүүлэх ёстой вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Identifying skills that enable users to accomplish specific work-related actions and meaningfully integrate software features into their professional workflows.",
          "text_mn": "Хэрэглэгчдэд ажлын байран дээр тодорхой үйл ажиллагааг гүйцэтгэх, програм хангамжийн боломжуудыг мэргэжлийн үйл явцдаа утга учиртай нэгтгэх ур чадварыг тодорхойлох.",
          "is_correct": true
        },
        {
          "id": "B",
          "text_en": "Selecting only the essential functions that can be taught in the shortest possible time to maximize learning efficiency.",
          "text_mn": "Суралцах үр ашгийг нэмэгдүүлэхийн тулд хамгийн богино хугацаанд зааж болох зайлшгүй функцуудыг л сонгох.",
          "is_correct": false
        },
        {
          "id": "C",
          "text_en": "Focusing on the advanced and complex features to showcase the software's full potential and cater to expert users primarily.",
          "text_mn": "Програм хангамжийн бүрэн чадавхийг харуулах, ялангуяа мэргэшсэн хэрэглэгчдэд зориулж дэвшилтэт болон нарийн төвөгтэй функцуудад анхаарах.",
          "is_correct": false
        },
        {
          "id": "D",
          "text_en": "Prioritizing the most basic software navigation and interaction techniques to ensure universal accessibility for all user levels.",
          "text_mn": "Бүх хэрэглэгчийн түвшинд нийцсэн хамгийн энгийн програм хангамжийн навигаци, харилцан үйлчлэлийн аргуудыг чухалчлах.",
          "is_correct": false
        }
      ],
      "concept": "User analysis for identifying necessary skills to teach in tutorials",
      "difficulty": "hard",
      "explanation_en": "The primary context emphasizes that a thorough user analysis helps identify specific user actions and scenarios that need support. The fundamental principle for selecting skills is to enable users to accomplish these work-related tasks and meaningfully combine program features within their specific professional context. This ensures the tutorial directly addresses the user's practical needs and workplace applications. Distractor B focuses on universal basics, which is a prerequisite but not the primary driver for specific skill selection based on diverse user needs. Distractor C overemphasizes advanced features for all users, contrary to tailoring skills based on different roles and their specific actions. Distractor D prioritizes teaching speed over the direct alignment of skills with identified user task needs through user analysis.",
      "explanation_mn": "Үндсэн эх сурвалжид хэрэглэгчийн нарийвчилсан шинжилгээ нь дэмжлэг шаардлагатай хэрэглэгчийн тодорхой үйлдэл, нөхцөл байдлыг тодорхойлоход тусалдаг гэдгийг онцолсон. Ур чадвар сонгох үндсэн зарчим нь хэрэглэгчдэд ажлын байран дээрх эдгээр даалгавруудыг гүйцэтгэх, програмын функцуудыг өөрсдийн мэргэжлийн нөхцөл байдалд утга учиртай хослуулах боломжийг олгоход оршино. Энэ нь гарын авлага нь хэрэглэгчийн практик хэрэгцээ, ажлын байрны хэрэглээнд шууд хариулж байгааг баталгаажуулдаг. В хариулт нь бүх нийтийн үндсэн ур чадварт анхаардаг бөгөөд энэ нь урьдчилсан нөхцөл боловч янз бүрийн хэрэглэгчийн хэрэгцээнд үндэслэсэн тодорхой ур чадвар сонголтын гол хөдөлгөгч хүч биш юм. С хариулт нь бүх хэрэглэгчдэд зориулсан дэвшилтэт функцуудыг хэт онцолдог бөгөөд энэ нь өөр өөр үүрэг, тэдний тодорхой үйлдлүүдэд үндэслэн ур чадварыг тохируулах зарчимтай зөрчилдөнө. D хариулт нь ур чадварыг хэрэглэгчийн шинжилгээгээр тодорхойлсон даалгаврын хэрэгцээтэй шууд уялдуулахаас илүү сургалтын хурдыг чухалчилдаг.",
      "question_number": 4,
      "page_reference": "60-82"
    },
    {
      "question_en": "When designing software tutorials to truly adapt a program to user needs, what fundamental principle should guide the instructional planning?",
      "question_mn": "Хэрэглэгчийн хэрэгцээнд програмыг жинхэнэ утгаар нь тааруулах программ хангамжийн гарын авлага зохиохдоо, зааварчилгааны төлөвлөлтийг ямар суурь зарчим удирдах ёстой вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Adopting a minimalist approach that presents only the essential steps for common tasks, allowing users to explore and discover advanced functionalities independently.",
          "text_mn": "Зөвхөн нийтлэг даалгавруудын үндсэн алхмуудыг танилцуулдаг минималист арга барилыг хэрэглэж, хэрэглэгчдэд дэвшилтэт функцуудыг бие даан судлах, нээх боломжийг олгох.",
          "is_correct": false,
          "source": "Related but incorrect idea",
          "explanation": "The primary context emphasizes that instructional planning for tutorials should 'Identify User Actions You Need to Support' by relying on user analysis to determine what skills to teach. It explicitly states that 'Any actions or scenarios your user would participate in make good problems for users in tutorials' and that the goal is to teach how to 'combine program features meaningfully in the workplace.' This approach ensures tutorials directly address how users will apply software skills in their specific jobs, making the learning highly relevant and effective for adapting the program to their needs. The other options describe valid pedagogical approaches or documentation strategies but do not capture this core principle of aligning tutorial content directly with specific user workplace actions and scenarios."
        },
        {
          "id": "B",
          "text_en": "Designing for an explorative learning style, where users are encouraged to experiment freely with software features to develop their own understanding through trial and error.",
          "text_mn": "Судалгааны аргаар суралцах хэв маягт зориулж дизайн хийх, ингэснээр хэрэглэгчид програм хангамжийн функцуудыг чөлөөтэй туршиж үзэн, алдаа онооны замаар өөрсдийн ойлголтыг хөгжүүлэхийг уриалах.",
          "is_correct": false,
          "source": "Related but incorrect idea",
          "explanation": "The primary context emphasizes that instructional planning for tutorials should 'Identify User Actions You Need to Support' by relying on user analysis to determine what skills to teach. It explicitly states that 'Any actions or scenarios your user would participate in make good problems for users in tutorials' and that the goal is to teach how to 'combine program features meaningfully in the workplace.' This approach ensures tutorials directly address how users will apply software skills in their specific jobs, making the learning highly relevant and effective for adapting the program to their needs. The other options describe valid pedagogical approaches or documentation strategies but do not capture this core principle of aligning tutorial content directly with specific user workplace actions and scenarios."
        },
        {
          "id": "C",
          "text_en": "Prioritizing specific user actions and authentic workplace scenarios, enabling users to meaningfully combine software features for job-relevant task accomplishment.",
          "text_mn": "Тодорхой хэрэглэгчийн үйлдлүүд болон бодит ажлын байрны нөхцөл байдлыг чухалчлан үзэж, хэрэглэгчдэд ажлын холбогдолтой даалгавруудыг гүйцэтгэхийн тулд программ хангамжийн функцуудыг утга учиртай хослуулахыг заах.",
          "is_correct": true,
          "source": "Page 31",
          "explanation": "The primary context emphasizes that instructional planning for tutorials should 'Identify User Actions You Need to Support' by relying on user analysis to determine what skills to teach. It explicitly states that 'Any actions or scenarios your user would participate in make good problems for users in tutorials' and that the goal is to teach how to 'combine program features meaningfully in the workplace.' This approach ensures tutorials directly address how users will apply software skills in their specific jobs, making the learning highly relevant and effective for adapting the program to their needs. The other options describe valid pedagogical approaches or documentation strategies but do not capture this core principle of aligning tutorial content directly with specific user workplace actions and scenarios."
        },
        {
          "id": "D",
          "text_en": "Providing exhaustive coverage of every software feature and menu option, ensuring users have access to all possible information within the documentation.",
          "text_mn": "Программ хангамжийн бүх функц болон цэсийн сонголтуудыг бүрэн дүүрэн хамруулж, хэрэглэгчдэд баримт бичгийн хүрээнд бүх боломжит мэдээллийг хүртээмжтэй болгох.",
          "is_correct": false,
          "source": "Related but incorrect idea",
          "explanation": "The primary context emphasizes that instructional planning for tutorials should 'Identify User Actions You Need to Support' by relying on user analysis to determine what skills to teach. It explicitly states that 'Any actions or scenarios your user would participate in make good problems for users in tutorials' and that the goal is to teach how to 'combine program features meaningfully in the workplace.' This approach ensures tutorials directly address how users will apply software skills in their specific jobs, making the learning highly relevant and effective for adapting the program to their needs. The other options describe valid pedagogical approaches or documentation strategies but do not capture this core principle of aligning tutorial content directly with specific user workplace actions and scenarios."
        }
      ],
      "concept": "Planning tutorials around specific user actions and workplace scenarios",
      "difficulty": "hard",
      "explanation_en": "The primary context emphasizes that instructional planning for tutorials should 'Identify User Actions You Need to Support' by relying on user analysis to determine what skills to teach. It explicitly states that 'Any actions or scenarios your user would participate in make good problems for users in tutorials' and that the goal is to teach how to 'combine program features meaningfully in the workplace.' This approach ensures tutorials directly address how users will apply software skills in their specific jobs, making the learning highly relevant and effective for adapting the program to their needs. The other options describe valid pedagogical approaches or documentation strategies but do not capture this core principle of aligning tutorial content directly with specific user workplace actions and scenarios.",
      "explanation_mn": "Эхлэлийн хэсэгт зааварчилгааны төлөвлөлт нь ямар ур чадваруудыг заах ёстойг тодорхойлохын тулд хэрэглэгчийн анализад тулгуурлан 'Дэмжих шаардлагатай хэрэглэгчийн үйлдлүүдийг тодорхойлох' ёстойг онцолсон. Энэ нь 'Таны хэрэглэгчийн оролцох аливаа үйлдэл эсвэл нөхцөл байдал нь гарын авлагын хэрэглэгчдэд зориулсан сайн асуудал болдог' бөгөөд зорилго нь 'програмын функцуудыг ажлын байранд утга учиртай хослуулахыг' заах явдал гэж тодорхой заасан. Энэ арга нь гарын авлага нь хэрэглэгчид програм хангамжийн ур чадварыг өөрсдийн тодорхой ажилд хэрхэн хэрэглэхийг шууд заадаг тул програмыг тэдний хэрэгцээнд дасан зохицуулахад маш чухал бөгөөд үр дүнтэй болгодог. Бусад сонголтууд нь сурган хүмүүжүүлэх зөв хандлага эсвэл баримтжуулалтын стратегийг тодорхойлдог боловч гарын авлагын агуулгыг тодорхой хэрэглэгчийн ажлын байрны үйлдэл, нөхцөл байдалтай шууд уялдуулах энэхүү үндсэн зарчмыг агуулаагүй болно.",
      "question_number": 5,
      "page_reference": "60-82"
    },
    {
      "question_en": "When designing effective software tutorials that integrate learning with practical application, what is the foundational step for lesson planning?",
      "question_mn": "Програм хангамжийн сургалтыг үр дүнтэй болгож, сургалтыг практик хэрэглээтэй нэгтгэхдээ хичээлийн төлөвлөгөөний үндсэн алхам юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Identifying specific user workplace scenarios and determining the precise program skills and feature combinations needed to accomplish them meaningfully.",
          "text_mn": "Хэрэглэгчийн ажлын байран дахь тодорхой хувилбаруудыг тодорхойлж, тэдгээр хувилбаруудыг утга учиртай гүйцэтгэхэд шаардлагатай програмын ур чадвар, онцлог шинж чанаруудыг тодорхойлох.",
          "is_correct": true,
          "source": "Page 31",
          "explanation": "This choice directly reflects the text's guidance to 'Identify User Actions You Need to Support' through user analysis, then 'Decide on what skills you want to teach to support these scenarios,' ensuring users learn 'how to combine program features meaningfully in the workplace.' This establishes the core mapping between tasks and skills."
        },
        {
          "id": "B",
          "text_en": "Analyzing various learning styles and cognitive loads to tailor the tutorial's pace and interactivity for optimal user engagement.",
          "text_mn": "Сургалтын хурд болон интерактив байдлыг оновчтой болгохын тулд янз бүрийн суралцах хэв маяг, танин мэдэхүйн ачааллыг шинжлэх.",
          "is_correct": false,
          "source": "Related concept (distractor)",
          "explanation": "Considering learning styles and cognitive load is crucial for effective instructional design. However, this is an aspect of *how* the content is delivered and structured, not the *foundational step* of *what* content (i.e., which skills for which tasks) should be included in the lesson plan."
        },
        {
          "id": "C",
          "text_en": "Cataloging all available software functions and features to ensure comprehensive coverage, allowing users to explore tools independently.",
          "text_mn": "Бүх боломжит програмын функц, онцлогуудыг жагсаан бүртгэж, иж бүрэн хамрах хүрээг баталгаажуулах, ингэснээр хэрэглэгчдэд хэрэгслүүдийг бие даан судлах боломж олгох.",
          "is_correct": false,
          "source": "Related concept (distractor)",
          "explanation": "While comprehensive coverage can be beneficial, simply cataloging features without explicit linkage to user tasks or scenarios doesn't align with the primary context's emphasis on task-oriented teaching and applying features 'meaningfully in the workplace.' It misses the critical step of mapping skills to practical application."
        },
        {
          "id": "D",
          "text_en": "Implementing an iterative design process with early user testing to refine tutorial effectiveness and address common pain points.",
          "text_mn": "Сургалтын үр дүнг сайжруулж, нийтлэг бэрхшээлүүдийг шийдвэрлэхийн тулд хэрэглэгчийн эрт үеийн туршилттай давтамжит дизайны процессыг хэрэгжүүлэх.",
          "is_correct": false,
          "source": "Related concept (distractor)",
          "explanation": "Iterative design and user testing are vital for improving the quality and usability of any documentation. However, these are processes for *refinement* and *validation* of the tutorial, occurring after the initial lesson plan content has been developed. They are not the *foundational planning step* for determining the core content itself."
        }
      ],
      "concept": "Mapping program skills, commands, and workplace tasks for lesson plan development",
      "difficulty": "hard",
      "explanation_en": "The primary context emphasizes that effective tutorial design begins with a thorough user analysis to identify the specific 'user actions' or 'scenarios' they will encounter in their workplace. The foundational step involves deciding what 'skills you want to teach to support these scenarios,' understanding that user actions can only be accomplished if users have 'mastered certain skills from the program' and know 'how to combine program features meaningfully in the workplace.' Therefore, the correct approach is to map specific real-world tasks to the exact program skills and feature combinations required to perform them. Distractors B, C, and D describe important aspects of documentation and learning design (comprehensive coverage, learning styles, iterative testing), but they do not represent the *foundational step* of linking *workplace tasks* to *program skills* for initial lesson content development, which is central to task-oriented documentation.",
      "explanation_mn": "Эх эх сурвалжид үр дүнтэй сургалтын загвар нь хэрэглэгчийн ажлын байранд тулгарах тодорхой 'хэрэглэгчийн үйлдэл' эсвэл 'сценарийг' тодорхойлох гүнзгий хэрэглэгчийн шинжилгээнээс эхэлдэг болохыг онцолсон. Үндсэн алхам нь эдгээр сценарийг дэмжихийн тулд 'ямар ур чадвар заахыг хүсэж байгаагаа' шийдэж, хэрэглэгчийн үйлдлүүд зөвхөн хэрэглэгчид 'програмын тодорхой ур чадварыг эзэмшсэн' бөгөөд 'програмын онцлог шинж чанаруудыг ажлын байранд утга учиртай нэгтгэж чадвал' л гүйцэтгэгдэх боломжтойг ойлгох явдал юм. Иймд зөв арга нь бодит ажлын байрны тодорхой үйлдлүүдийг гүйцэтгэхэд шаардлагатай програмын ур чадвар болон онцлог шинж чанаруудын хослолыг зураглах явдал юм. Хэрэглэгчийг төөрөгдүүлэх B, C, D сонголтууд нь баримт бичиг болон сургалтын дизайны чухал талуудыг (иж бүрэн хамрах хүрээ, суралцах хэв маяг, давтамжит туршилт) тайлбарлаж байгаа хэдий ч хичээлийн агуулгыг хөгжүүлэхэд 'ажлын байрны даалгавруудыг' 'програмын ур чадваруудтай' холбох *үндсэн алхам* биш бөгөөд энэ нь даалгавар дээр суурилсан баримт бичгийн гол цөм юм.",
      "question_number": 6,
      "page_reference": "60-82"
    },
    {
      "question_en": "What fundamental principle underpins the use of software exploration to effectively teach software skills?",
      "question_mn": "Програм хангамжийн ур чадварыг үр дүнтэй заахад программ хангамжийг судлах үндсэн зарчим юу вэ?",        
      "choices": [
        {
          "id": "A",
          "text_en": "To ensure users strictly adhere to predefined steps within documentation, guaranteeing consistent execution and minimizing operational deviations.",
          "text_mn": "Хэрэглэгчид баримт бичгийн дагуу тодорхойлсон алхмуудыг чанд мөрдөж, тогтвортой гүйцэтгэлийг баталгаажуулж, үйл ажиллагааны хазайлтыг багасгах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Exploration implies more than strict adherence to steps; it encourages understanding to the point where users can apply skills from memory and combine features meaningfully, rather than just follow instructions precisely."      
        },
        {
          "id": "B",
          "text_en": "To facilitate users' rapid acclimatization to core software operations, enabling immediate functional use and minimizing the initial learning curve.",
          "text_mn": "Хэрэглэгчдийг програм хангамжийн үндсэн үйлдлүүдэд хурдан дасгах, улмаар шууд ашиглах боломжийг олгож, эхний сурах хугацааг багасгах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Software exploration aims for a deeper, memory-based understanding and meaningful application, which goes beyond mere rapid acclimatization or quick initial functional use. It focuses on internalizing skills."
        },
        {
          "id": "C",
          "text_en": "To foster a profound comprehension of software functionalities, empowering users to meaningfully integrate features and recall tasks from memory in practical settings.",
          "text_mn": "Програм хангамжийн үйл ажиллагааны талаар гүн гүнзгий ойлголт өгөх, хэрэглэгчдэд онцлог шинж чанаруудыг утга учиртайгаар нэгтгэх, практик нөхцөлд даалгавруудыг санах ойгоос гүйцэтгэх чадварыг олгох.",
          "is_correct": true,
          "source": "Page 31",
          "explanation": "The primary context explicitly states that a style of teaching relying on principles of software exploration aims to 'teach software skills so that the user can perform them by memory' and 'how to combine program features meaningfully in the workplace.' This indicates that the core objective is to cultivate a deep, internalized understanding of the software, enabling users to independently apply and recall skills for practical, task-oriented scenarios, rather than merely following instructions or quick familiarity."
        },
        {
          "id": "D",
          "text_en": "To develop users' capacity for diagnosing and resolving complex software issues autonomously, thereby reducing reliance on external technical support.",
          "text_mn": "Хэрэглэгчдийн нарийн төвөгтэй програм хангамжийн асуудлыг бие даан оношлох, шийдвэрлэх чадварыг хөгжүүлэх, улмаар гадны техникийн дэмжлэгээс хамаарах байдлыг бууруулах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While problem-solving is a valuable skill, the text emphasizes performing tasks from memory and combining features meaningfully in the workplace as the goal of exploration, not primarily troubleshooting complex issues."
        }
      ],
      "concept": "Principles of software exploration for teaching software skills",
      "difficulty": "hard",
      "explanation_en": "The passage clearly links the 'style of teaching that relies on principles of software exploration' to the objective of teaching 'software skills so that the user can perform them by memory' and 'how to combine program features meaningfully in the workplace.' This highlights that the fundamental principle is to cultivate a deep, internalized understanding of the software's functionalities. This enables users to not only recall tasks without documentation but also to innovatively integrate features for practical, real-world application, making the learning robust and adaptable. The distractors represent plausible but secondary or incorrect objectives for a teaching approach centered on 'exploration' as described in the context.",
      "explanation_mn": "Эхний хэсэгт 'програм хангамжийг судлах зарчимд тулгуурласан заах арга'-ыг 'хэрэглэгчдэд програм хангамжийн ур чадварыг санах ойгоор гүйцэтгэх чадвартай болгох' болон 'ажлын байранд програмын онцлог шинж чанаруудыг утга учиртайгаар хослуулах' зорилготой холбож тайлбарласан. Энэ нь програм хангамжийн үйл ажиллагааны талаар гүн гүнзгий, дотоод ойлголтыг бий болгох нь үндсэн зарчим болохыг онцолж байна. Энэ нь хэрэглэгчдэд баримт бичиггүйгээр даалгавруудыг санах төдийгүй, практик, бодит хэрэглээнд онцлог шинж чанаруудыг шинэлэг байдлаар нэгтгэх боломжийг олгож, сургалтыг бат бөх, дасан зохицох чадвартай болгоно. Бусад сонголтууд нь энэхүү 'судлах' арга барилтай холбоотой байж болох боловч, өгөгдсөн контекст дэх гол зорилго биш юм.",
      "question_number": 7,
      "page_reference": "60-82"
    },
    {
      "question_en": "What fundamental design principle underpins award-winning software tutorials, enabling users to master skills for workplace application?",
      "question_mn": "Шагналт программ хангамжийн гарын авлагын үндсэн загварын зарчим юу вэ, энэ нь хэрэглэгчдэд ажлын байранд хэрэглэх ур чадварыг эзэмших боломжийг олгодог вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Award-winning tutorials prioritize teaching specific software skills for user recall and application within workplace scenarios, integrating principles of software exploration and meaningful interaction.",
          "text_mn": "Шагналт гарын авлагууд нь хэрэглэгчдэд ажлын байран дахь тодорхой нөхцөл байдалд програм хангамжийн ур чадварыг санаж, хэрэглэхэд чухал ач холбогдол өгч, програм хангамжийг судлах болон утга учиртай харилцан үйлчлэлийн зарчмуудыг нэгтгэдэг.",
          "is_correct": true,
          "source": "Page ??",
          "explanation": "The text states that award-winning tutorials teach software skills so users 'can perform them by memory,' are designed to 'meet user task needs,' 'rely on principles of software exploration,' and illustrate 'meaningful interaction about software.' The focus is on practical application within user-identified scenarios, not just comprehensive feature listing or theoretical understanding."
        },
        {
          "id": "B",
          "text_en": "Successful tutorials primarily emphasize theoretical explanations and the underlying architecture of the software, ensuring a deep conceptual understanding before any practical steps.",
          "text_mn": "Амжилттай гарын авлагууд нь голчлон програм хангамжийн онолын тайлбар болон суурь архитектурыг онцолж, аливаа практик алхмуудаас өмнө гүнзгий ойлголтыг баталгаажуулдаг.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "This is incorrect. The context highlights teaching 'software skills so that the user can perform them by memory' and meeting 'user task needs,' which prioritizes practical, task-oriented application over a sole focus on theoretical or architectural understanding."
        },
        {
          "id": "C",
          "text_en": "Effective tutorials focus on comprehensively detailing every software feature and function, aiming for a complete reference rather than specific task-oriented training.",
          "text_mn": "Үр дүнтэй гарын авлагууд нь програм хангамжийн бүх онцлог, функцийг иж бүрэн нарийвчлан тайлбарлаж, тодорхой үүрэгт чиглэсэн сургалтаас илүүтэйгээр бүрэн лавлагаа болохыг зорьдог.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "This is incorrect. While comprehensive information can be useful, the text emphasizes 'task-oriented documentation' and teaching skills to support 'user actions' and 'scenarios,' indicating a focus on specific application rather than exhaustive feature lists as the primary characteristic of award-winning tutorials."
        },
        {
          "id": "D",
          "text_en": "Highly rated tutorials strictly adhere to a minimalist approach, providing only the bare minimum information to force users into independent discovery without any guided instruction.",
          "text_mn": "Өндөр үнэлгээтэй гарын авлагууд нь минималист хандлагыг чанд баримталж, хэрэглэгчдийг удирдамжгүйгээр бие даан судлахад хүргэхийн тулд хамгийн бага мэдээллийг өгдөг.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "This is incorrect. The text mentions both 'elaborative and minimalist approaches' and refers to the award-winning example as illustrating 'advanced features' and showing 'the basics of design,' suggesting a balance or a more guided approach to ensure users can 'perform them by memory,' rather than strictly bare minimum for forced discovery."
        }
      ],
      "concept": "Characteristics of award-winning tutorial documentation (e.g., direct instruction, focus on user tasks, meaningful interaction)",
      "difficulty": "hard",
      "explanation_en": "The primary context highlights that award-winning tutorials, like the Essential TitleMotion example, are designed to teach software skills for users to perform 'by memory' within specific 'user actions' and 'scenarios' relevant to the workplace. This approach integrates 'principles of software exploration' and fosters 'meaningful interaction about software' to meet user task needs effectively. The focus is on practical skill mastery and application, not just comprehensive feature lists, theoretical concepts, or a restrictive minimalist approach that neglects guided learning for skill retention.",       
      "explanation_mn": "Үндсэн контекстээс харахад Essential TitleMotion-ийн жишээ шиг шагналт гарын авлагууд нь хэрэглэгчдэд ажлын байран дахь тодорхой 'хэрэглэгчийн үйлдэл' болон 'сценари'-уудад програм хангамжийн ур чадварыг 'санаж' гүйцэтгэхэд зориулагдсан байдаг. Энэ хандлага нь хэрэглэгчийн үүрэг даалгаврын хэрэгцээг үр дүнтэй хангахын тулд 'програм хангамжийг судлах зарчим'-уудыг нэгтгэж, 'програм хангамжийн талаарх утга учиртай харилцан үйлчлэл'-ийг дэмждэг. Гол анхаарал нь практик ур чадварыг эзэмших, хэрэглэхэд чиглэсэн бөгөөд зөвхөн иж бүрэн жагсаалт, онолын ойлголт эсвэл ур чадварыг тогтооход чиглэсэн удирдамжтай сургалтыг үл тоомсорлосон хязгаарлагдмал минималист хандлага биш юм.",
      "question_number": 8,
      "page_reference": "60-82"
    },
    {
      "question_en": "When designing effective software tutorials, what fundamental principle should guide the selection of program features to teach for optimal user proficiency and application?",
      "question_mn": "Програм хангамжийн үр дүнтэй сургалтын гарын авлага зохиохдоо хэрэглэгчийн ур чадвар, хэрэглээг оновчтой болгохын тулд ямар суурь зарчим программын онцлог шинж чанаруудыг сонгоход чиглүүлэх ёстой вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Emphasizing features that directly support specific user actions and scenarios crucial for job performance, enabling meaningful integration into their daily workplace tasks.",
          "text_mn": "Ажлын гүйцэтгэлд чухал хэрэглэгчийн тодорхой үйлдэл, нөхцөл байдлыг шууд дэмждэг онцлог шинж чанаруудыг чухалчлах нь тэдгээрийг ажлын байрандаа утга учиртай нэгтгэх боломжийг олгоно.",
          "is_correct": true,
          "source": "Page 31",
          "explanation": "This choice directly reflects the text's emphasis on identifying 'User Actions You Need to Support' and 'what skills you need to teach' to support 'scenarios' that allow users to 'combine program features meaningfully in the workplace.'"
        },
        {
          "id": "B",
          "text_en": "Covering all major program functionalities comprehensively to ensure users have a complete understanding of the software's entire capability set.",
          "text_mn": "Програмын бүх үндсэн функцүүдийг иж бүрэн хамруулах нь хэрэглэгчдэд программын бүх чадавхийг бүрэн ойлгоход тусална.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While comprehensiveness can be a goal, the primary context emphasizes selecting *specific* skills and actions relevant to job performance, not covering *all* major functionalities."
        },
        {
          "id": "C",
          "text_en": "Focusing on advanced or unique features that differentiate the software from competitors, showcasing its innovative capabilities and potential.",
          "text_mn": "Програмыг өрсөлдөгчдөөс ялгаж буй дэвшилтэт эсвэл өвөрмөц онцлогт анхаарлаа төвлөрүүлж, түүний шинэлэг чадавхи, боломжуудыг харуулах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Showcasing advanced or unique features is often a marketing goal, not the fundamental principle for selecting tutorial content aimed at optimal user proficiency for job performance as described in the primary context."
        },
        {
          "id": "D",
          "text_en": "Prioritizing features that are simplest to learn initially, gradually introducing more complex tools as the user's confidence and familiarity grow.",
          "text_mn": "Хамгийн энгийн сурахад хялбар онцлог шинж чанаруудыг эхэндээ чухалчилж, хэрэглэгчийн итгэл үнэмшил, танил тал нэмэгдэхийн хэрээр илүү нарийн хэрэгслүүдийг танилцуулах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This is a sound pedagogical strategy, but the text's core principle for feature *selection* is based on user actions and workplace relevance, not primarily on ease of initial learning."
        }
      ],
      "concept": "Guidelines for selecting program features for tutorials (central to job performance, essential for efficient use)",
      "difficulty": "hard",
      "explanation_en": "The correct answer emphasizes that selecting program features for tutorials should primarily focus on identifying specific user actions and scenarios relevant to their job performance. The text explicitly states, 'Decide on what skills you want to teach to support these scenarios' and highlights 'how to combine program features meaningfully in the workplace.' This approach ensures the tutorial is highly practical and directly applicable to the user's needs. Distractor B is incorrect because the text promotes *selection* based on user needs, not comprehensive coverage. Distractor C, while pedagogically sound for pacing, isn't the *primary principle for feature selection* outlined. Distractor D focuses on product differentiation rather than user task support, which is not the core principle described.",
      "explanation_mn": "Зөв хариулт нь сургалтын гарын авлагын программын онцлог шинж чанарыг сонгохдоо хэрэглэгчийн ажлын гүйцэтгэлд хамааралтай тодорхой үйлдлүүд болон нөхцөл байдлыг тодорхойлоход голчлон анхаарах ёстойг онцолж байна. Эх бичигт 'Эдгээр хувилбарыг дэмжихийн тулд ямар ур чадварыг заахыг хүсэж байгаагаа шийдээрэй' гэж тодорхой заасан бөгөөд 'программыг ажлын байрандаа утга учиртай хэрхэн нэгтгэх' нь чухал гэдгийг онцолжээ. Энэ арга барил нь сургалтын гарын авлагыг маш практик бөгөөд хэрэглэгчийн хэрэгцээнд шууд нийцсэн байлгахад тусална. В хувилбар буруу, учир нь текст нь хэрэглэгчийн хэрэгцээнд тулгуурлан *сонголт хийхийг* дэмждэг болохоос биш иж бүрэн хамрахыг дэмждэггүй. С хувилбар нь сурган хүмүүжүүлэх арга зүйн хувьд зөв боловч *онцлог шинж чанарыг сонгох гол зарчим* биш юм. D хувилбар нь бүтээгдэхүүний ялгааг онцолдог болохоос биш хэрэглэгчийн ажлыг дэмжихэд чиглэгдээгүй бөгөөд энэ нь тайлбарласан гол зарчим биш юм.",
      "question_number": 9,
      "page_reference": "60-82"
    },
    {
      "question_en": "When designing direct instruction tutorials, what fundamental principle ensures users can effectively apply learned features to real-world tasks?",
      "question_mn": "Шууд зааварчилгааны хичээл боловсруулахдаа, хэрэглэгчид сурсан онцлог шинж чанаруудыг бодит амьдралын даалгаварт үр дүнтэй ашиглаж чадахуйц байлгахын тулд ямар суурь зарчмыг баримтлах ёстой вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Focusing on user-specific actions and scenarios identified through analysis, explicitly teaching how to meaningfully combine program features for workplace task accomplishment.",
          "text_mn": "Хэрэглэгчийн задлан шинжилгээгээр тодорхойлсон үйлдэл, нөхцөл байдалд анхаарлаа төвлөрүүлж, програмын онцлог шинж чанаруудыг ажлын байрны даалгаврыг гүйцэтгэхэд хэрхэн утга учиртай нэгтгэн ашиглахыг тодорхой заах.",
          "is_correct": true,
          "source": "Page 31",
          "explanation": "The text explicitly states that a core aspect of designing effective tutorials is to 'Identify User Actions You Need to Support' through user analysis, deciding 'what skills you want to teach to support these scenarios.' It emphasizes teaching users 'how to combine program features meaningfully in the workplace.' This principle ensures that the instruction is task-oriented, relevant, and directly applicable to a user's job."
        },
        {
          "id": "B",
          "text_en": "Organizing the tutorial around abstract software concepts and theoretical foundations before introducing any practical, hands-on application steps.",
          "text_mn": "Хичээлийг абстракт програм хангамжийн ойлголт болон онолын үндэслэлийг тойруулан зохион байгуулж, дараа нь ямар нэгэн практик, гардан хэрэглээний алхмуудыг танилцуулах.",
          "is_correct": false,
          "source": null,
          "explanation": "Direct instruction tutorials, particularly for software, are inherently practical and task-oriented. The primary context emphasizes supporting 'user actions' and teaching skills to perform scenarios, which suggests an immediate connection to practical application rather than starting with abstract theoretical foundations."
        },
        {
          "id": "C",
          "text_en": "Presenting an exhaustive overview of all software functionalities and menu options, allowing users to discover relevant features through self-directed exploration.",
          "text_mn": "Програм хангамжийн бүх функц болон цэсийн сонголтуудыг дэлгэрэнгүй танилцуулж, хэрэглэгчдэд өөрөө судлах замаар холбогдох онцлог шинж чанаруудыг нээх боломж олгох.",
          "is_correct": false,
          "source": null,
          "explanation": "While 'software exploration' is mentioned in the broader context, direct instruction tutorials, as described, focus on explicitly teaching specific skills for user tasks, not on exhaustive overviews or self-directed discovery of *all* features. This approach contrasts with the focused, task-oriented nature of direct instruction for meaningful application."
        },
        {
          "id": "D",
          "text_en": "Emphasizing rapid completion of basic operational steps, assuming users will naturally infer the deeper, meaningful application of features over time.",
          "text_mn": "Үндсэн үйлдлийн алхмуудыг хурдан гүйцэтгэхэд анхаарлаа хандуулж, хэрэглэгчид онцлог шинж чанаруудын гүн гүнзгий, утга учиртай хэрэглээг цаг хугацааны явцад өөрөө ойлгоно гэж үзэх.",
          "is_correct": false,
          "source": null,
          "explanation": "The text highlights the importance of teaching users 'how to combine program features meaningfully in the workplace,' indicating that deep, meaningful application should be explicitly taught, not merely inferred. Simply focusing on rapid basic steps without connecting them to practical, combined use falls short of the goal for effective direct instruction."
        }
      ],
      "concept": "Organization of direct instruction tutorials (e.g., explicit style, focus on one task, integrated graphics)",
      "difficulty": "hard",
      "explanation_en": "The primary context emphasizes that effective direct instruction tutorials must 'Identify User Actions You Need to Support' by relying on user analysis to decide 'what skills you want to teach to support these scenarios.' Crucially, it highlights that successful learning means users master how to 'combine program features meaningfully in the workplace.' Therefore, the fundamental principle is to explicitly tie the teaching of skills to specific, analyzed user tasks and scenarios, ensuring the user learns not just how to use features, but how to combine them purposefully for their real-world job functions. This aligns with an explicit style, a focus on relevant tasks, and implicitly, the need for integrated graphics to illustrate these combined actions.",
      "explanation_mn": "Эх сурвалж нь үр дүнтэй шууд зааварчилгааны хичээлүүд 'Хэрэглэгчийн дэмжих шаардлагатай үйлдлүүдийг тодорхойлох'-д хэрэглэгчийн дүн шинжилгээнд тулгуурлан 'эдгээр нөхцөл байдлыг дэмжихэд ямар ур чадвар заахыг хүсэж байгаагаа шийдэх' ёстойг онцолсон. Хамгийн гол нь, амжилттай суралцах нь хэрэглэгчид 'програмын онцлог шинж чанаруудыг ажлын байранд утга учиртай нэгтгэх' арга замыг эзэмших гэдгийг тодотгосон. Иймээс суурь зарчим нь ур чадварыг сургахыг тодорхой, задлан шинжилсэн хэрэглэгчийн даалгавар, нөхцөл байдалтай холбож, хэрэглэгч зөвхөн онцлог шинж чанаруудыг хэрхэн ашиглахыг биш, харин бодит ажлын үүргийнхээ төлөө 'тэдгээрийг хэрхэн зорилготойгоор нэгтгэх' тухай сурах явдал юм. Энэ нь тодорхой хэв маяг, холбогдох даалгавруудад төвлөрөх, мөн эдгээр нэгдсэн үйлдлүүдийг харуулахын тулд нэгдсэн графикийн хэрэгцээтэй уялдаатай.",
      "question_number": 10,
      "page_reference": "60-82"
    }
  ]
}