{
  "total_generated": 10,
  "mcqs": [
    {
      "question_en": "Which characteristic fundamentally defines a software procedure?",
      "question_mn": "Програм хангамжийн процедурын үндсэн тодорхойлолт юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Its natural chronological order suitable for various media.",
          "text_mn": "Төрөл бүрийн медиад тохиромжтой, байгалийн дарааллаар явагддаг байдал.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While procedures do fall into a chronological order and work in various media, these are characteristics of procedures, not their fundamental definition. The core definition focuses on the step-by-step commands for a meaningful operation."
        },
        {
          "id": "B",
          "text_en": "The tacit knowledge it evokes from the user's context.",
          "text_mn": "Хэрэглэгчийн контекстээс үүсгэдэг далд мэдлэг.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "The tacit knowledge evoked in the user and the user's context are important aspects related to the *application* and *skill* associated with a procedure, but they do not constitute the definition of the procedure itself as a series of commands."
        },
        {
          "id": "C",
          "text_en": "A step-by-step series of commands for a meaningful operation.",
          "text_mn": "Утга учиртай үйлдлийг гүйцэтгэх алхам алхмаар тушаалуудын цуврал.",
          "is_correct": true,
          "source": "Page ??",
          "explanation": "The text explicitly defines a procedure as 'a step-by-step series of commands for accomplishing a meaningful operation with a software program.' This highlights both the sequential nature and the purpose-driven aspect of a procedure in the workplace."
        },
        {
          "id": "D",
          "text_en": "The writer's ability to clarify its place in larger workplace activities.",
          "text_mn": "Бичигчийн түүнийг ажлын байрны томоохон үйл ажиллагаанд хэрхэн нийцүүлэхийг тодорхойлох чадвар.",        
          "is_correct": false,
          "source": "Page ??",
          "explanation": "This describes the role and responsibility of the writer in documenting procedures, clarifying how they fit into a larger context. However, it does not define what a procedure itself inherently is."
        }
      ],
      "concept": "Definition of a procedure as a step-by-step series of commands for meaningful software operations",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly defines a procedure as 'a step-by-step series of commands for accomplishing a meaningful operation with a software program.' This definition emphasizes both the sequential nature ('step-by-step commands') and the practical purpose ('meaningful operation') in a user's workflow. The other options describe features, writer's roles, or user interactions, rather than the core definitional elements of a procedure.",
      "explanation_mn": "Анхдагч контекстэд процедур нь 'програм хангамжийн тусламжтайгаар утга учиртай үйлдлийг гүйцэтгэх алхам алхмаар тушаалуудын цуврал' хэмээн тодорхойлогдсон байдаг. Энэ тодорхойлолт нь дараалсан шинж чанар ('алхам алхмаар тушаалууд') болон хэрэглэгчийн ажлын урсгалын практик зорилгыг ('утга учиртай үйлдэл') онцолдог. Бусад сонголтууд нь процедурын онцлог шинж чанарууд, бичигчийн үүрэг эсвэл хэрэглэгчийн харилцан үйлчлэлийг тайлбарладаг боловч процедурын үндсэн тодорхойлолтод хамаарахгүй.",
      "question_number": 1,
      "page_reference": "93-121"
    },
    {
      "question_en": "What is the primary goal of well-designed procedures in product support documentation?",
      "question_mn": "Бүтээгдэхүүний дэмжлэгийн баримт бичигт сайн боловсруулсан процедурын үндсэн зорилго юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To clarify how operations fit into larger workplace actions and activities.",
          "text_mn": "Үйлдлүүд ажлын байрны томоохон үйлдэл, үйл ажиллагаанд хэрхэн нийцэж байгааг тодруулах.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Understanding how procedures fit into a larger context is a secondary goal related to providing meaning, but the *primary* goal of the procedure's design is to enable the user to perform the immediate operation with maximum usability and efficiency. This option focuses on contextual understanding rather than direct task performance."
        },
        {
          "id": "B",
          "text_en": "To evoke tacit, understood knowledge that the user already possesses.",
          "text_mn": "Хэрэглэгчийн аль хэдийн эзэмшсэн далд, ойлгогдсон мэдлэгийг сэрээх.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Procedures may indeed evoke existing user knowledge, but this is a consequence of their interaction with the user's context, not the primary design goal. The focus of designing procedures is to guide the user to complete a task efficiently, leveraging their knowledge where appropriate, but not solely to 'evoke' it."
        },
        {
          "id": "C",
          "text_en": "To offer users maximum usability and efficiency for tasks.",
          "text_mn": "Хэрэглэгчдэд даалгаврыг гүйцэтгэхэд дээд зэргийн хэрэглэх боломж, үр ашгийг олгох.",
          "is_correct": true,
          "source": "Page ??",
          "explanation": "The primary context explicitly states that the purpose of discussing procedure elements is 'to offer your user maximum usability and efficiency.' This goal ensures users can effectively and easily accomplish their tasks. While other options describe characteristics or secondary goals, they are not the overarching design objective for user benefit."     
        },
        {
          "id": "D",
          "text_en": "To present information in a clear, chronological, step-by-step order.",
          "text_mn": "Мэдээллийг тодорхой, дараалсан, алхам алхмаар байдлаар танилцуулах.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While presenting information clearly and chronologically is a characteristic of well-designed procedures, it is a *method* or *means* to achieve the primary goal, not the goal itself. The ultimate purpose is user usability and efficiency."
        }
      ],
      "concept": "Purpose of procedures: to offer users maximum usability and efficiency in task-oriented product support",    
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly states that the purpose of discussing procedure elements is 'to offer your user maximum usability and efficiency.' This goal ensures users can effectively and easily accomplish their tasks. While other options describe characteristics or secondary goals, they are not the overarching design objective for user benefit.",     
      "explanation_mn": "Үндсэн контекстэд процедурын элементүүдийг хэлэлцэх зорилго нь 'хэрэглэгчдэд дээд зэргийн хэрэглэх боломж, үр ашгийг олгох' гэж тодорхой заасан байдаг. Энэ зорилго нь хэрэглэгчид даалгавраа үр дүнтэй, хялбар гүйцэтгэх боломжийг баталгаажуулдаг. Бусад сонголтууд нь процедурын шинж чанар эсвэл хоёрдогч зорилгуудыг тайлбарлаж байгаа боловч хэрэглэгчийн ашиг тусын ерөнхий дизайны зорилго биш юм.",
      "question_number": 2,
      "page_reference": "93-121"
    },
    {
      "question_en": "Which characteristic is fundamental to task-oriented procedures, ensuring user efficiency?",
      "question_mn": "Даалгавар дээр суурилсан процедурын гол шинж чанар нь юу вэ, энэ нь хэрэглэгчийн үр ашгийг баталгаажуулдаг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Procedures naturally follow a chronological order, indicated by step numbers.",
          "text_mn": "Процедурууд нь алхам дугаараар илэрхийлэгддэг, цаг хугацааны дарааллыг байгалиасаа дагадаг.",
          "is_correct": true,
          "source": "Page ??",
          "explanation": "The primary context explicitly states that task-oriented procedures 'fall naturally into a chronological order' and this order is 'indicated by the step numbers.' This sequential nature is fundamental for users to follow instructions efficiently and effectively."
        },
        {
          "id": "B",
          "text_en": "Procedures serve as building blocks for larger actions or activities.",
          "text_mn": "Процедурууд нь илүү том үйлдлүүд эсвэл үйл ажиллагааны үндсэн блок болж үйлчилдэг.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Procedures indeed act as 'building blocks for these larger actions,' which describes their role within a broader activity/action/operations model. However, this is their function within a larger system, not their inherent structural characteristic related to order."
        },
        {
          "id": "C",
          "text_en": "They relate tasks to meaningful workplace activities for user context.",
          "text_mn": "Тэд даалгавруудыг хэрэглэгчийн нөхцөл байдалд тохирсон утга учиртай ажлын үйл ажиллагаатай холбодог.",   
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While relating tasks to meaningful workplace activities is crucial for the procedure's 'meaningfulness,' it describes the external application or purpose, not the internal structural characteristic of how procedures are ordered."
        },
        {
          "id": "D",
          "text_en": "They evoke tacit, understood knowledge from the user's context.",
          "text_mn": "Тэд хэрэглэгчийн нөхцөл байдлаас чимээгүй, ойлгогдсон мэдлэгийг төрүүлдэг.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "The text mentions that 'the “skill” in a procedure lies not in the procedure itself, but in the tacit, understood knowledge that it evokes in the user.' This refers to the cognitive interaction with the user's context, not the inherent order or structure of the procedure itself."
        }
      ],
      "concept": "Chronological order as a fundamental characteristic of procedures",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly states that task-oriented procedures 'fall naturally into a chronological order' and this order is 'indicated by the step numbers.' This sequential nature is fundamental for users to follow instructions efficiently and effectively. While other options describe important aspects of procedures, chronological order is their inherent structural characteristic.",
      "explanation_mn": "Үндсэн агуулгад даалгавар дээр суурилсан процедурууд нь 'байгалиасаа цаг хугацааны дарааллыг дагадаг' бөгөөд энэ дараалал нь 'алхам дугаараар илэрхийлэгддэг' гэж тодорхой заасан байдаг. Энэхүү дараалсан шинж чанар нь хэрэглэгчдэд зааврыг үр дүнтэй, үр ашигтайгаар дагахад чухал ач холбогдолтой юм. Бусад сонголтууд нь процедурын чухал талуудыг тайлбарлаж байгаа хэдий ч цаг хугацааны дараалал нь тэдний дотоод бүтцийн үндсэн шинж чанар юм.",
      "question_number": 3,
      "page_reference": "93-121"
    },
    {
      "question_en": "What primarily determines a procedure's meaningfulness for users?",
      "question_mn": "Процедурын ач холбогдлыг хэрэглэгчдэд юу голчлон тодорхойлдог вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Its application to larger, real-world workplace activities.",
          "text_mn": "Түүний ажлын байрны томоохон, бодит үйл ажиллагаанд хэрэглэгдэх чадвар.",
          "is_correct": true,
          "source": "Page 64",
          "explanation": "The text explicitly states that \"The 'meaning' or meaningfulness of a procedure comes from its application to work,\" and that writers should clarify how procedures \"fit into the larger picture of actions and activities in the user’s workplace.\" This emphasizes that procedures are meaningful when integrated into broader, real-world tasks, not merely as isolated operations."
        },
        {
          "id": "B",
          "text_en": "The tacit, understood knowledge it evokes in the user.",
          "text_mn": "Хэрэглэгчийн дотоод мэдлэг, ойлголтыг өдөөж өгөх чадвар.",
          "is_correct": false,
          "source": "Page 64",
          "explanation": "The text notes that procedures evoke tacit knowledge, but this is a consequence or a way users interact with the procedure, rather than the primary determinant of the procedure's inherent meaningfulness itself. Meaningfulness stems from its application to work, which then leverages the user's tacit knowledge."
        },
        {
          "id": "C",
          "text_en": "Its ability to maximize user efficiency and effectiveness.",
          "text_mn": "Хэрэглэгчийн үр ашиг, үр нөлөөг дээд зэргээр нэмэгдүүлэх чадвар.",
          "is_correct": false,
          "source": "Page 63",
          "explanation": "Maximizing user efficiency and effectiveness is a goal of well-designed procedures, but the text defines meaningfulness specifically by how the procedure connects to larger workplace activities, not just its immediate utility." 
        },
        {
          "id": "D",
          "text_en": "Its clear, chronological, step-by-step instruction format.",
          "text_mn": "Түүний тодорхой, дараалсан, алхам алхмаар зааварчилгааны формат.",
          "is_correct": false,
          "source": "Page 63",
          "explanation": "While procedures are typically step-by-step and chronological, this describes their structure, not the primary source of their meaningfulness as defined in the text."
        }
      ],
      "concept": "The concept that procedure meaningfulness stems from its application to larger workplace activities, not the operation itself",
      "difficulty": "medium",
      "explanation_en": "The text explicitly states that \"The 'meaning' or meaningfulness of a procedure comes from its application to work,\" and that writers should clarify how procedures \"fit into the larger picture of actions and activities in the user’s workplace.\" This emphasizes that procedures are meaningful when integrated into broader, real-world tasks, not merely as isolated operations.",
      "explanation_mn": "Уг текстэд \"Үйл ажиллагааны \"утга\" буюу ач холбогдол нь түүнийг ажилд хэрэглэхээс гардаг\" бөгөөд зохиолчид үйл ажиллагааг \"хэрэглэгчийн ажлын байрны үйлдэл, үйл ажиллагааны өргөн хүрээний зураглалд хэрхэн нийцэж байгааг тодруулах\" ёстой гэж тодорхой заасан. Энэ нь үйл ажиллагаа нь зөвхөн тусгаарлагдсан үйлдэл бус, харин бодит амьдрал дээрх өргөн хүрээний даалгавартай нэгдэх үед утга учиртай болдог болохыг онцолж байна.",
      "question_number": 4,
      "page_reference": "93-121"
    },
    {
      "question_en": "What is a writer's primary responsibility when documenting procedures for users?",
      "question_mn": "Процедурыг хэрэглэгчдэд баримтжуулах үед зохиогчийн үндсэн үүрэг юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Clarifying how procedures contribute to users' larger workplace actions and activities.",
          "text_mn": "Процедурууд хэрхэн хэрэглэгчийн ажлын байран дахь томоохон үйл ажиллагаанд хувь нэмэр оруулж буйг тодруулах.",
          "is_correct": true,
          "source": "Page ??",
          "explanation": "The text explicitly states the writer's job is to 'clarify how they [procedures] fit into the larger picture of actions and activities in the user’s workplace.' This emphasizes connecting individual procedures to the user's broader work goals and context."
        },
        {
          "id": "B",
          "text_en": "Identifying all standard, prose, parallel, and context-sensitive help available.",
          "text_mn": "Стандарт, үргэлжилсэн, зэрэгцээ, мөн нөхцөл байдалд мэдрэмжтэй тусламжуудыг тодорхойлох.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "The text mentions these types of help as things to find, but it's not the primary responsibility of a writer *when documenting procedures* to clarify their role in the user's broader workplace context."
        },
        {
          "id": "C",
          "text_en": "Ensuring procedures are step-by-step commands for meaningful operations.",
          "text_mn": "Процедурууд нь утга учиртай үйлдлүүдийн алхам алхмын командуудыг баталгаажуулах.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While procedures are step-by-step, this choice describes the nature of a procedure itself, not the writer's specific role in clarifying its broader context."
        },
        {
          "id": "D",
          "text_en": "Maximizing user efficiency and effectiveness through detailed design elements.",
          "text_mn": "Нарийвчилсан дизайны элементүүдээр хэрэглэгчийн үр ашиг, үр нөлөөг дээд зэргээр нэмэгдүүлэх.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Maximizing efficiency and effectiveness is a goal of good documentation design, but it's a broader outcome, not the writer's specific responsibility of clarifying the contextual fit of procedures within larger workplace activities."
        }
      ],
      "concept": "Writer's role in clarifying how procedures fit into the user's broader workplace actions and activities",    
      "difficulty": "medium",
      "explanation_en": "The text explicitly states the writer's job is to 'clarify how they [procedures] fit into the larger picture of actions and activities in the user’s workplace.' This emphasizes connecting individual procedures to the user's broader work goals and context, rather than just detailing the steps or designing for efficiency in isolation.",
      "explanation_mn": "Эх бичигт зохиогчийн үүрэг нь 'процедурууд хэрэглэгчийн ажлын байран дахь үйл ажиллагаа, үйлдлийн том зураглалд хэрхэн нийцэж буйг тодруулах' гэж тодорхой заасан. Энэ нь тухайн процедурын алхмуудыг нарийвчлан тайлбарлах эсвэл үр ашгийг нэмэгдүүлэхээс илүүтэйгээр, бие даасан процедуруудыг хэрэглэгчийн ажлын өргөн хүрээний зорилго, нөхцөл байдалтай холбохыг онцолж байна.",
      "question_number": 5,
      "page_reference": "93-121"
    },
    {
      "question_en": "What is the primary role of individual procedures within the user's broader workplace activities?",      
      "question_mn": "Хэрэглэгчийн ажлын байрны өргөн хүрээний үйл ажиллагаанд бие даасан журам ямар үндсэн үүрэг гүйцэтгэдэг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To primarily evoke tacit, understood knowledge rather than providing explicit steps.",
          "text_mn": "Илэрхий алхмуудыг өгөхөөс илүүтэйгээр, үндсэндээ далд, ойлгогдсон мэдлэгийг өдөөх.",
          "is_correct": false,
          "source": "Page 64",
          "explanation": "The text notes that skill lies in the tacit knowledge a procedure evokes, but procedures fundamentally provide explicit steps. Their primary role is to serve as building blocks for actions, not solely to evoke tacit knowledge." 
        },
        {
          "id": "B",
          "text_en": "They serve as fundamental building blocks for accomplishing larger, more complex user actions.",
          "text_mn": "Тэдгээр нь илүү том, нарийн төвөгтэй хэрэглэгчийн үйлдлүүдийг гүйцэтгэх үндсэн бүтцийн элемент болдог.", 
          "is_correct": true,
          "source": "Page 64",
          "explanation": "The text explicitly states that procedures 'act as building blocks for these larger actions,' fitting into the 'larger picture of actions and activities in the user’s workplace.'"
        },
        {
          "id": "C",
          "text_en": "To solely maximize user efficiency by providing direct step-by-step commands.",
          "text_mn": "Зөвхөн шууд алхам алхмаар тушаал өгөх замаар хэрэглэгчийн үр ашгийг дээд зэргээр нэмэгдүүлэх.",
          "is_correct": false,
          "source": "Page 63",
          "explanation": "While maximizing efficiency is a design goal, it is not the primary role of procedures as 'building blocks' for larger activities. Procedures contribute to efficiency, but their fundamental role is structural."
        },
        {
          "id": "D",
          "text_en": "To document operations by strictly adhering to a natural chronological sequence.",
          "text_mn": "Үйлдлүүдийг байгалийн жамаар цаг хугацааны дарааллыг чанд баримтлан баримтжуулах.",
          "is_correct": false,
          "source": "Page 63",
          "explanation": "Procedures typically follow chronological order, but this describes their structure, not their primary role as components for larger actions and activities within the workplace context."
        }
      ],
      "concept": "Procedures as 'building blocks' for larger user actions",
      "difficulty": "medium",
      "explanation_en": "The text explicitly states that procedures occur at the 'operations' level and 'act as building blocks for these larger actions,' which are part of the 'larger picture of actions and activities in the user’s workplace.' This highlights their fundamental role in enabling complex tasks. The other options describe attributes or design considerations of procedures but do not capture their primary function as foundational components for broader user activities.",
      "explanation_mn": "Текстэд журам нь 'үйл ажиллагааны' түвшинд явагддаг бөгөөд 'хэрэглэгчийн ажлын байрны үйлдэл, үйл ажиллагааны өргөн хүрээний зураглалын нэг хэсэг болох эдгээр томоохон үйлдлүүдийн бүтцийн элемент болдог' гэж тодорхой заасан байдаг. Энэ нь нарийн төвөгтэй ажлуудыг гүйцэтгэхэд тэдгээрийн гүйцэтгэх үндсэн үүргийг онцолж байна. Бусад сонголтууд нь журмын шинж чанар эсвэл дизайны үзүүлэлтүүдийг тайлбарлаж байгаа боловч хэрэглэгчийн өргөн хүрээний үйл ажиллагаанд зориулсан суурь бүрэлдэхүүн хэсэг болох үндсэн үүргийг нь харуулдаггүй.",
      "question_number": 6,
      "page_reference": "93-121"
    },
    {
      "question_en": "What primarily determines the meaningfulness of a procedure for a user?",
      "question_mn": "Хэрэглэгчийн хувьд горимын утга учир юугаар голчлон тодорхойлогддог вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "The intrinsic operational value of the task it helps accomplish.",
          "text_mn": "Гүйцэтгэхэд тусалдаг үйлдлийн дотоод ашиг тусаар.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "The text explicitly states that what makes a procedure meaningful does not necessarily reside in the operation itself. Instead, it is the user's application of that operation within their larger workplace activities and goals that provides meaning."
        },
        {
          "id": "B",
          "text_en": "The user's specific goals and how it integrates into their broader work context.",
          "text_mn": "Хэрэглэгчийн тодорхой зорилго болон түүний ажлын өргөн хүрээний нөхцөл байдалд хэрхэн нэгдэж байгаагаар.",
          "is_correct": true,
          "source": "Page ??",
          "explanation": "The text states that the \"meaning\" or meaningfulness of a procedure comes from its application to work, clarifying how it fits into the user's larger workplace activities, and the reasons and goals the user brings to the task. It emphasizes that meaningfulness does not necessarily reside in the operation itself but in the user's context."
        },
        {
          "id": "C",
          "text_en": "Its chronological step-by-step structure and clear commands.",
          "text_mn": "Түүний дараалсан үе шаттай бүтэц, тодорхой тушаалуудаар.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While clear structure and commands are important for usability, the text indicates they are not the primary determinant of a procedure's meaningfulness for the user. Meaningfulness stems from its application to the user's work context, not its internal structure alone."
        },
        {
          "id": "D",
          "text_en": "The specific software program it describes and its media format.",
          "text_mn": "Түүний тайлбарлаж буй тухайн програм хангамж болон медиа формат.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "The text mentions procedures work in practically all media, but the specific software or media format does not primarily determine the meaningfulness of a procedure from the user's perspective. The meaning comes from how it helps the user achieve their work goals."
        }
      ],
      "concept": "The significance of user context (goals, projects, awareness of work environment) in understanding and applying procedures",
      "difficulty": "medium",
      "explanation_en": "The primary context clearly states that the 'meaning' or meaningfulness of a procedure comes from its application to work, and how it fits into the user’s larger picture of actions and activities in their workplace. It emphasizes that the knowledge the user brings to the procedure, comprising their reasons and goals, creates this context of meaning. Therefore, the user's specific goals and how the procedure integrates into their work environment are the main determinants of its meaningfulness.",
      "explanation_mn": "Эхэн дэх агуулгад горимын \"утга учир\" буюу ач холбогдол нь түүний ажлын хэрэглээ, мөн хэрэглэгчийн ажлын байран дахь өргөн хүрээний үйл ажиллагаанд хэрхэн нийцэж байгаагаас үүдэлтэй гэдгийг тодорхой заасан. Энэ нь хэрэглэгчийн горимд хандах шалтгаан, зорилгоос үүсэх утга учир, нөхцөл байдлыг онцолж байна. Иймээс хэрэглэгчийн тодорхой зорилго болон горим нь тэдний ажлын орчинд хэрхэн нэгдэж байгаа нь утга учрыг тодорхойлох гол хүчин зүйл юм.",
      "question_number": 7,
      "page_reference": "93-121"
    },
    {
      "question_en": "What key design element helps establish a procedure's relevance to users' larger workplace activities?", 
      "question_mn": "Үйл явцын холбогдох байдлыг хэрэглэгчийн ажлын байрны томоохон үйл ажиллагаатай холбоход аль чухал дизайны элемент тусалдаг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Comprehensive troubleshooting tips within each step.",
          "text_mn": "Алхам бүрд багтсан иж бүрэн алдааг олж засварлах зөвлөмжүүд.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Troubleshooting tips are valuable for helping users resolve issues during a procedure. However, their main function is problem-solving, not establishing the initial relevance or connection of the procedure to larger user goals and workplace activities."
        },
        {
          "id": "B",
          "text_en": "Detailed embedded tables for quick data reference.",
          "text_mn": "Өгөгдлийг хурдан харахад зориулсан нарийвчилсан хүснэгтүүд.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Detailed tables can enhance documentation by providing quick reference, but they are not the primary element for establishing a procedure's overall relevance or meaningfulness within the user's broader workplace context."       
        },
        {
          "id": "C",
          "text_en": "Action-oriented introductions linking the task to user goals.",
          "text_mn": "Даалгаврыг хэрэглэгчийн зорилготой холбосон үйлдэлд чиглэсэн оршил.",
          "is_correct": true,
          "source": "Page 64",
          "explanation": "The text emphasizes that a procedure's 'meaning' or 'meaningfulness' comes from its application to work and clarifies that a writer's job is to explain how procedures 'fit into the larger picture of actions and activities in the user’s workplace.' An action-oriented introduction directly serves this purpose by providing context and linking the procedure to the user's broader objectives."
        },
        {
          "id": "D",
          "text_en": "Chronological step numbering for clear execution sequence.",
          "text_mn": "Гүйцэтгэлийн дарааллыг тодорхой болгох үе шаттай дугаарлалт.",
          "is_correct": false,
          "source": "Page 64",
          "explanation": "While chronological step numbering is crucial for user efficiency and understanding the sequence of operations, it primarily addresses the 'how' of the procedure, rather than its initial 'why' or 'relevance' to larger workplace activities, which is the focus of the question."
        }
      ],
      "concept": "Key elements of effective procedure design: action-oriented introductions, step numbers, tips, tables, elaborations",
      "difficulty": "medium",
      "explanation_en": "The primary context highlights that a procedure's 'meaning' comes from its application to work, and writers must clarify how procedures 'fit into the larger picture of actions and activities in the user’s workplace.' Action-oriented introductions directly fulfill this requirement by immediately connecting the procedure to the user's broader objectives and work context, thereby establishing its relevance. While other elements like step numbering are important for execution, they do not primarily establish this overarching relevance.",
      "explanation_mn": "Үндсэн контекст нь үйл явцын 'утга учир' нь түүний ажилд хэрэглэгдэхээс үүдэлтэй бөгөөд зохиолчид үйл явцууд хэрэглэгчийн 'ажлын байрны томоохон үйл ажиллагаанд хэрхэн нийцдэгийг' тодруулах ёстойг онцолсон. Үйлдэлд чиглэсэн оршил нь үйл явцыг хэрэглэгчийн илүү өргөн зорилго, ажлын нөхцөл байдалтай нэн даруй холбосноор энэхүү шаардлагыг хангаж, улмаар түүний хамаарлыг тогтоодог. Алхам дугаарлах гэх мэт бусад элементүүд гүйцэтгэлд чухал боловч эдгээр нь энэхүү ерөнхий хамаарлыг үндсэндээ тогтоодоггүй.",
      "question_number": 8,
      "page_reference": "93-121"
    },
    {
      "question_en": "At which level of the activity/action/operations model do procedures primarily function?",
      "question_mn": "Үйл ажиллагаа/үйлдэл/операторын загварын аль түвшинд процедурууд голчлон ажилладаг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "They correspond to the 'action' level, translating abstract goals into concrete user behaviors.",        
          "text_mn": "Тэд 'үйлдэл'-ийн түвшинтэй тохирч, хийсвэр зорилгуудыг хэрэглэгчийн тодорхой зан үйлд хөрвүүлдэг.",      
          "is_correct": false,
          "source": "Page ??",
          "explanation": "This is incorrect. While procedures involve concrete steps, the text places them specifically at the more granular 'operations' level, which serves as a building block for 'actions'."
        },
        {
          "id": "B",
          "text_en": "They operate at the 'operations' level, forming fundamental building blocks for larger tasks.",
          "text_mn": "Тэд 'операторын' түвшинд ажиллаж, илүү том даалгавруудын үндсэн бүтцийг бүрдүүлдэг.",
          "is_correct": true,
          "source": "Page ??",
          "explanation": "The primary context explicitly states, \"Procedures occur at the 'operations' level of that model.\" It further clarifies that they \"act as building blocks for these larger actions.\""
        },
        {
          "id": "C",
          "text_en": "They represent the overarching 'activity' level, guiding the entire user workflow.",
          "text_mn": "Тэд ерөнхий 'үйл ажиллагааны' түвшинг илэрхийлж, хэрэглэгчийн бүх ажлын урсгалыг чиглүүлдэг.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "This is incorrect. Procedures are not at the highest 'activity' level; rather, they are the 'operations' that build up to larger actions and activities."
        },
        {
          "id": "D",
          "text_en": "They function as a bridge between the model and user context, ensuring task relevance.",
          "text_mn": "Тэд загвар болон хэрэглэгчийн орчны хоорондох гүүр болж, даалгаврын хамаарлыг баталгаажуулдаг.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "This is incorrect. While procedures derive meaning from the user's context and clarify their fit into a larger picture, this choice describes a function or relationship rather than the specific 'level' at which they operate within the activity/action/operations model itself."
        }
      ],
      "concept": "Relationship between procedures and the activity/action/operations model (operating at the 'operations' level)",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly states that \"Procedures occur at the 'operations' level of that model\" and clarifies that they \"act as building blocks for these larger actions.\" Therefore, understanding their specific placement within the activity/action/operations hierarchy is key.",
      "explanation_mn": "Анхны контекст нь \"Процедурууд нь уг загварын 'операторын' түвшинд явагддаг\" гэдгийг тодорхой зааж, тэдгээрийг \"эдгээр томоохон үйлдлүүдийн бүтцийн суурь болдог\" гэж тайлбарладаг. Иймд, процедуруудын үйл ажиллагаа/үйлдэл/операторын шатлал дахь тодорхой байршлыг ойлгох нь чухал юм.",
      "question_number": 9,
      "page_reference": "93-121"
    },
    {
      "question_en": "What is essential for procedures to maximize user efficiency and effectiveness?",
      "question_mn": "Журмууд хэрэглэгчийн үр ашиг, үр нөлөөг дээд зэргээр нэмэгдүүлэхийн тулд юу зайлшгүй шаардлагатай вэ?",  
      "choices": [
        {
          "id": "A",
          "text_en": "Ensuring clear, concise, and unambiguous command instructions.",
          "text_mn": "Тодорхой, товч, хоёрдмол утгагүй командын зааварчилгааг баталгаажуулах.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Clear instructions are crucial for any documentation, but the primary context emphasizes the broader connection to workplace meaning and user context as the key factor for maximizing overall efficiency and effectiveness."       
        },
        {
          "id": "B",
          "text_en": "Adhering strictly to a chronological, step-by-step presentation.",
          "text_mn": "Дараалсан, алхам алхмаар танилцуулгыг чанд баримтлах.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While chronological order is a natural characteristic of procedures, the text implies that simply adhering to it does not inherently maximize efficiency and effectiveness; rather, the meaningfulness of the task in context is key."
        },
        {
          "id": "C",
          "text_en": "Connecting them to meaningful workplace activities and broader user goals.",
          "text_mn": "Тэднийг ажлын байрны утга учиртай үйл ажиллагаа болон хэрэглэгчийн өргөн хүрээний зорилготой холбох.",   
          "is_correct": true,
          "source": "Page 64",
          "explanation": "The text states that the 'meaning' or meaningfulness of a procedure comes from its application to work, and writers must clarify how procedures fit into the larger picture of actions and activities in the user's workplace to maximize efficiency and effectiveness."
        },
        {
          "id": "D",
          "text_en": "Incorporating thorough usability testing and user feedback.",
          "text_mn": "Хэрэглээний иж бүрэн туршилт, хэрэглэгчийн санал хүсэлтийг оруулах.",
          "is_correct": false,
          "source": "Page 63",
          "explanation": "Usability testing is mentioned as a method for checking and testing procedures (in Chapter 8), but it is a validation step rather than the fundamental design principle that intrinsically maximizes efficiency and effectiveness in the initial procedure design itself, which is focused on relating tasks to meaningful activities."
        }
      ],
      "concept": "Designing procedures to maximize user efficiency and effectiveness in the workplace",
      "difficulty": "medium",
      "explanation_en": "The primary text emphasizes that a procedure's 'meaning' and its ability to maximize user efficiency and effectiveness come from its application to work and how it fits into the user's larger workplace activities and goals. Simply following chronological order or clear commands is not enough; the procedure must be perceived as a building block for meaningful broader actions, informed by the user's context.",
      "explanation_mn": "Үндсэн текст нь журмын 'утга учир' болон хэрэглэгчийн үр ашиг, үр нөлөөг дээд зэргээр нэмэгдүүлэх чадвар нь түүнийг ажлын байранд ашиглах, мөн хэрэглэгчийн ажлын байрны өргөн хүрээний үйл ажиллагаа, зорилгод хэрхэн нийцэж байгаагаас үүдэлтэйг онцолдог. Зөвхөн дараалсан үе шатыг дагах эсвэл тодорхой тушаалыг биелүүлэх нь хангалтгүй; журам нь утга учиртай томоохон үйлдлүүдийн суурь болгон ойлгогдох ёстой бөгөөд хэрэглэгчийн нөхцөл байдлаас шалтгаална.",
      "question_number": 10,
      "page_reference": "93-121"
    }
  ]
}