{
  "total_generated": 10,
  "mcqs": [
    {
      "question_en": "What fundamental approach is paramount for ensuring the production of high-quality documentation?",      
      "question_mn": "Өндөр чанартай баримт бичиг боловсруулахад юу хамгийн чухал арга барил вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Utilizing the latest advanced documentation tools.",
          "text_mn": "Хамгийн сүүлийн үеийн дэвшилтэт баримт бичгийн хэрэгслүүдийг ашиглах.",
          "is_correct": false,
          "source": "Related concept",
          "explanation": "Advanced tools can certainly enhance efficiency and quality, but the primary context does not identify them as 'the key' factor for achieving quality documentation. Tools support the process, but are not the process itself."    
        },
        {
          "id": "B",
          "text_en": "Maximizing user involvement in every stage.",
          "text_mn": "Үйл явцын үе шат бүрт хэрэглэгчийн оролцоог нэмэгдүүлэх.",
          "is_correct": false,
          "source": "Related concept",
          "explanation": "While user involvement is important and can influence how processes vary, the text does not state it is 'the key' to producing quality documentation. It's a factor within or affecting the process, not the overarching key to quality itself."
        },
        {
          "id": "C",
          "text_en": "Conducting extensive and continuous content reviews.",
          "text_mn": "Агуулгын өргөн хүрээтэй, тасралтгүй хяналт шалгалт хийх.",
          "is_correct": false,
          "source": "Related concept",
          "explanation": "Extensive reviews are a crucial part of ensuring quality, but they are typically one step or component within a broader documentation process. The text emphasizes the entire 'process' as the key, not just a single stage like review."
        },
        {
          "id": "D",
          "text_en": "Adhering to a structured documentation process.",
          "text_mn": "Баримт бичгийн зохион байгуулалттай үйл явцыг дагаж мөрдөх.",
          "is_correct": true,
          "source": "Page 174",
          "explanation": "The text explicitly states: 'The key to producing quality documentation is to follow a process.' This directly identifies a structured process as the paramount approach."
        }
      ],
      "concept": "Documentation processes as a key to quality documentation",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly states, 'The key to producing quality documentation is to follow a process.' This highlights that a systematic, structured approach to documentation development is fundamental for ensuring high-quality output. While other factors mentioned in the distractors (user involvement, tools, reviews) are important, they either represent components of a process or factors influencing its variation, rather than the core 'key' to quality itself.",
      "explanation_mn": "Эхэн дэх текстийн хэсэгт 'Чанарын баримт бичиг боловсруулахын гол түлхүүр нь үйл явцыг дагаж мөрдөх явдал юм' гэж тодорхой заасан байдаг. Энэ нь баримт бичиг боловсруулах үйл явцын системтэй, бүтэцлэгдсэн арга барил нь өндөр чанартай үр дүн гаргахад үндсэн ач холбогдолтой болохыг онцолж байна. Бусад сонголтуудад дурдагдсан хүчин зүйлс (хэрэглэгчийн оролцоо, хэрэгсэл, хяналт) нь чухал боловч, тэдгээр нь үйл явцын бүрэлдэхүүн хэсэг эсвэл түүний хувилбарт нөлөөлөх хүчин зүйлс бөгөөд чанарын гол түлхүүр биш юм.",
      "question_number": 1,
      "page_reference": "203-246"
    },
    {
      "question_en": "What factors primarily influence the variability of documentation processes?",
      "question_mn": "Баримт бичгийн үйл явцын хувьсах чанарт юу голлон нөлөөлдөг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Company characteristics, software development circumstances, and user involvement.",
          "text_mn": "Компанийн онцлог, програм хангамж хөгжүүлэх нөхцөл байдал, хэрэглэгчийн оролцоо.",
          "is_correct": true,
          "source": "Page 174",
          "explanation": "The text explicitly states that documentation processes vary depending on 'the circumstances of how software is developed,' 'characteristics of the company,' and 'the degree of user involvement.'"
        },
        {
          "id": "B",
          "text_en": "Documentation tools, team size, and geographical distribution.",
          "text_mn": "Баримтжуулах хэрэгслүүд, багийн бүтэц, газарзүйн байршил.",
          "is_correct": false,
          "source": "Related Concept",
          "explanation": "These are practical considerations for a documentation project but are not listed in the text as the fundamental reasons for variations in the documentation process itself."
        },
        {
          "id": "C",
          "text_en": "Industry standards, regulatory compliance, and project deadlines.",
          "text_mn": "Салбарын стандарт, зохицуулалтын шаардлага, төслийн хугацаа.",
          "is_correct": false,
          "source": "Related Concept",
          "explanation": "These external factors are important for documentation quality but are not highlighted in the primary text as the core elements determining the *variability* of the documentation process."
        },
        {
          "id": "D",
          "text_en": "Project scope, available budget, and market demand.",
          "text_mn": "Төслийн цар хүрээ, төсөв, зах зээлийн эрэлт.",
          "is_correct": false,
          "source": "Related Concept",
          "explanation": "While these factors can influence a project, the provided text does not identify them as the primary drivers of documentation process variability."
        }
      ],
      "concept": "Variability of documentation processes based on company, software, and user involvement",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly states, \"Processes vary, however, depending on the circumstances of how software is developed: Some companies follow programming processes that differ depending on the characteristics of the company. Processes also differ depending on the degree of user involvement.\" Therefore, company characteristics, software development circumstances, and user involvement are the stated factors.",
      "explanation_mn": "Эх сурвалж текстэд \"Үйл явц нь програм хангамжийг хөгжүүлсэн нөхцөл байдлаас хамаарч өөр өөр байдаг: Зарим компаниуд компанийн онцлогоос хамаарч өөр өөр програмчлалын үйл явцыг дагаж мөрддөг. Мөн үйл явц нь хэрэглэгчийн оролцооны түвшингээс хамаарч өөр байдаг\" гэж тодорхой заасан. Тиймээс компанийн онцлог, програм хангамж хөгжүүлэх нөхцөл байдал, хэрэглэгчийн оролцоо нь баримтжуулалтын үйл явцын хувьсах чанарт нөлөөлөх хүчин зүйлс юм.",
      "question_number": 2,
      "page_reference": "203-246"
    },
    {
      "question_en": "Which activity is crucial during the initial research and planning phase of a documentation project?",   
      "question_mn": "Баримтжуулах төслийн эхний судалгаа, төлөвлөлтийн үе шатанд ямар үйл ажиллагаа чухал вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Preparing the maintenance guide for future updates.",
          "text_mn": "Ирээдүйн шинэчлэлтэд зориулсан засвар үйлчилгээний гарын авлагыг бэлтгэх.",
          "is_correct": false,
          "source": "Figure 6.1, Week 5",
          "explanation": "Preparing the maintenance guide is one of the final steps in the project, occurring after evaluation, as indicated in Week 5."
        },
        {
          "id": "B",
          "text_en": "Testing the document with selected test subjects.",
          "text_mn": "Сонгогдсон туршилтын субъектүүдээр баримт бичгийг турших.",
          "is_correct": false,
          "source": "Figure 6.1, Week 4",
          "explanation": "Testing is a distinct phase that takes place after initial writing and deployment, as shown in Week 4 of the schedule."
        },
        {
          "id": "C",
          "text_en": "Finalizing the document for online publication.",
          "text_mn": "Баримт бичгийг онлайн нийтлэлд бэлтгэж дуусгах.",
          "is_correct": false,
          "source": "Figure 6.1, Week 3",
          "explanation": "This activity occurs later in the project, during the deployment and initial public availability phase."
        },
        {
          "id": "D",
          "text_en": "Studying existing documents and visiting user sites.",
          "text_mn": "Одоо байгаа баримт бичгийг судлах, хэрэглэгчийн талбайд зочлох.",
          "is_correct": true,
          "source": "Figure 6.1, Week 1",
          "explanation": "The project schedule in Figure 6.1 explicitly lists \"Study existing documents\" and \"Visit user site\" in the first week, indicating these are key activities for initial research and understanding user needs."
        }
      ],
      "concept": "Nine-phase documentation process (stages)",
      "difficulty": "medium",
      "explanation_en": "The initial phase of any documentation project, as shown in Figure 6.1's schedule for the ONRS project, involves gathering foundational information. Tasks like 'Study existing documents' and 'Visit user site' are explicitly listed in Week 1, making them crucial for understanding the project's scope and user requirements before proceeding with design or writing.",
      "explanation_mn": "Баримтжуулах төслийн эхний үе шат нь ONRS төслийн хуваарьт (Зураг 6.1) харуулснаар үндсэн мэдээлэл цуглуулахыг хамардаг. 'Одоо байгаа баримт бичгийг судлах' болон 'Хэрэглэгчийн талбайд зочлох' зэрэг ажлууд эхний долоо хоногт тодорхой жагсаалтаар орсон бөгөөд энэ нь төслийн цар хүрээ, хэрэглэгчийн шаардлагыг ойлгоход зайлшгүй чухал үйл ажиллагаа юм.",    
      "question_number": 3,
      "page_reference": "203-246"
    },
    {
      "question_en": "What is a primary way to ensure quality in software documentation?",
      "question_mn": "Програм хангамжийн баримт бичгийн чанарыг баталгаажуулах үндсэн арга юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Integrating user feedback and testing throughout the documentation development process.",
          "text_mn": "Баримт бичиг боловсруулах үйл явц даяар хэрэглэгчийн санал хүсэлт, туршилтыг нэгтгэх.",
          "is_correct": true,
          "source": "Page 174, Figure 6.1",
          "explanation": "Figure 6.1's schedule, like the ONRS project, explicitly includes steps such as visiting user sites, preparing and getting user surveys, testing the document with test subjects, and conducting evaluations. This continuous involvement and incorporation of user feedback and testing are central to ensuring high-quality documentation that truly meets user needs."
        },
        {
          "id": "B",
          "text_en": "Strictly adhering to internal style guidelines and technical specifications.",
          "text_mn": "Байгууллагын дотоод хэв маягийн удирдамж, техникийн шаардлагыг чанд мөрдөх.",
          "is_correct": false,
          "source": null,
          "explanation": "While important for consistency and accuracy, adhering to internal guidelines alone does not primarily address the user-centric aspect of ensuring quality or directly involve users in the documentation improvement process."     
        },
        {
          "id": "C",
          "text_en": "Thoroughly outlining information and designing the interface upfront.",
          "text_mn": "Мэдээллийг нарийвчлан тоймлож, интерфэйсийг эхнээс нь нарийн зохион бүтээх.",
          "is_correct": false,
          "source": null,
          "explanation": "Initial planning and design are crucial first steps in any project. However, the text emphasizes ongoing user interaction (like testing and evaluation) beyond the initial design phase as key to ensuring overall quality in the long run."
        },
        {
          "id": "D",
          "text_en": "Expediting the writing and editing phases to meet project deadlines.",
          "text_mn": "Төслийн хугацаанд амжиж бичих, засварлах үе шатыг хурдасгах.",
          "is_correct": false,
          "source": null,
          "explanation": "Meeting deadlines is a project management goal, but expediting phases does not inherently guarantee quality, especially from a user-centric perspective. Rushing could compromise the thoroughness needed for effective user feedback integration."
        }
      ],
      "concept": "The importance of a user-centric approach in software documentation",
      "difficulty": "medium",
      "explanation_en": "The primary context highlights that producing quality documentation involves following a process, and these processes often depend on the degree of user involvement. Figure 6.1 provides a concrete example through the ONRS project schedule, which details various user-centric activities: visiting user sites, conducting user surveys, testing the document with users, reviewing test results, revising the document based on feedback, and ongoing evaluation by a user group. These steps collectively demonstrate that continuous integration of user feedback and testing throughout the entire development lifecycle is paramount to ensuring the documentation is effective and of high quality for its intended audience.",
      "explanation_mn": "Өгөгдсөн үндсэн текст нь чанартай баримт бичиг боловсруулах нь үйл явцыг дагахыг шаарддаг бөгөөд эдгээр үйл явц нь хэрэглэгчийн оролцооны түвшнээс хамаардаг болохыг онцолсон. Зураг 6.1 нь ONRS төслийн хуваариар дамжуулан бодит жишээг харуулсан бөгөөд энэ нь хэрэглэгчийн оролцоотой олон үйл ажиллагааг нарийвчлан тусгасан байдаг: хэрэглэгчийн сайтуудаар зочлох, хэрэглэгчийн судалгаа явуулах, баримт бичгийг хэрэглэгчдээр турших, туршилтын үр дүнг хянах, санал хүсэлтийн дагуу баримт бичгийг шинэчлэх, хэрэглэгчийн бүлгээр тасралтгүй үнэлүүлэх зэрэг болно. Эдгээр алхамууд нь хэрэглэгчийн санал хүсэлт, туршилтыг боловсруулалтын бүхий л үе шатанд тасралтгүй нэгтгэх нь баримт бичгийг үр дүнтэй, өндөр чанартай болгоход чухал ач холбогдолтой болохыг харуулж байна.",
      "question_number": 4,
      "page_reference": "203-246"
    },
    {
      "question_en": "What is a key aspect of team involvement in modern software documentation projects?",
      "question_mn": "Орчин үеийн програм хангамжийн баримтжуулалтын төслүүдэд багийн оролцооны гол тал юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Minimizing communication to avoid conflicts among team members.",
          "text_mn": "Багийн гишүүдийн хоорондын зөрчлөөс зайлсхийхийн тулд харилцаа холбоог багасгах.",
          "is_correct": false,
          "source": "General knowledge/Distractor",
          "explanation": "This is incorrect. The schedule includes 'Meeting to compare information' and other collaborative steps, implying active communication is crucial for coordination, not minimized."
        },
        {
          "id": "B",
          "text_en": "Streamlining work by assigning all tasks to the most experienced writer.",
          "text_mn": "Бүх ажлыг хамгийн туршлагатай зохиолчид хуваарилах замаар ажлыг хялбарчлах.",
          "is_correct": false,
          "source": "General knowledge/Distractor",
          "explanation": "This is incorrect. The context shows multiple distinct roles (Writer, Editor, Designer, Tester, Manager, Client Contact) actively involved, indicating a distribution of tasks, not sole reliance on one writer."
        },
        {
          "id": "C",
          "text_en": "Focusing solely on technological tools rather than human collaboration.",
          "text_mn": "Хүний хамтын ажиллагаанаас илүүтэйгээр зөвхөн технологийн хэрэгслүүдэд анхаарлаа хандуулах.",
          "is_correct": false,
          "source": "General knowledge/Distractor",
          "explanation": "This is incorrect. While technology is involved (e.g., 'Put document online'), the schedule primarily outlines human roles, tasks, and interactions, highlighting the collaborative aspect of the team."
        },
        {
          "id": "D",
          "text_en": "A coordinated effort involving individuals with specialized roles.",
          "text_mn": "Тусгай үүрэгтэй хувь хүмүүсийг оролцуулсан зохицуулалттай хүчин чармайлт.",
          "is_correct": true,
          "source": "Page 173-174, Figure 6.1",
          "explanation": "The provided schedule (Figure 6.1) explicitly details various team members (Writer, Editor, Graphics/Interface Designer, Tester, Manager, Client Contact) working together in a 'coordinated effort' throughout the documentation process. This demonstrates the necessity of diverse specialized roles collaborating to produce quality documentation."
        }
      ],
      "concept": "The role of teams in modern software documentation",
      "difficulty": "medium",
      "explanation_en": "The provided schedule (Figure 6.1) for the ONLINE NETWORK REFERENCE SYSTEM (ONRS) project explicitly details various team members (Writer, Editor, Graphics/Interface Designer, Tester, Manager, Client Contact) working together across different weeks. The text states that 'The plan shows how the members of the development team arranged the elements in the documentation process into a coordinated effort.' This clearly highlights that modern software documentation relies on a coordinated effort from individuals with diverse, specialized roles.",
      "explanation_mn": "ONLINE NETWORK REFERENCE SYSTEM (ONRS) төслийн өгөгдсөн хуваарь (Зураг 6.1) нь багийн олон гишүүдийг (Зохиолч, Редактор, График/Интерфэйс дизайнер, Туршигч, Менежер, Үйлчлүүлэгчтэй харилцах ажилтан) өөр өөр долоо хоногт хамтран ажиллахыг тодорхой харуулсан. Уг текстэд 'Энэ төлөвлөгөө нь баримтжуулалтын үйл явц дахь элементүүдийг хөгжүүлэлтийн багийн гишүүд хэрхэн зохицуулалттай хүчин чармайлт болгон зохион байгуулсныг харуулсан' гэж дурдсан. Энэ нь орчин үеийн програм хангамжийн баримтжуулалт нь олон талын, мэргэшсэн үүрэгтэй хувь хүмүүсийн зохицуулалттай хүчин чармайлтад тулгуурладаг болохыг тодорхой харуулж байна.",
      "question_number": 5,
      "page_reference": "203-246"
    },
    {
      "question_en": "In a software documentation project, what is the relationship between a writing group and a development team?",
      "question_mn": "Програм хангамжийн баримт бичгийн төсөлд бичих баг болон хөгжүүлэлтийн багийн хоорондын хамаарал юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "The writing group specializes in content creation as part of the development team's coordinated project effort.",
          "text_mn": "Бичих баг нь хөгжүүлэлтийн багийн зохицуулалттай төслийн хүрээнд агуулга бүтээхэд мэргэшдэг.",
          "is_correct": true,
          "source": "Primary Context",
          "explanation": "The primary context explicitly states that the development team arranges and coordinates the entire documentation process. Within this larger coordinated effort, the writing group is specifically tasked with gathering and assembling style guidelines, indicating their role as a specialized component focused on content creation and integration into the broader project."
        },
        {
          "id": "B",
          "text_en": "The development team is solely responsible for creating content, while the writing group manages project schedules.",
          "text_mn": "Хөгжүүлэлтийн баг нь зөвхөн агуулга үүсгэх үүрэгтэй бол бичих баг төслийн хуваарийг удирддаг.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This is incorrect. The primary context indicates the writing group's role in gathering and assembling style guidelines (content creation), and the development team's role in arranging elements into a 'coordinated effort' (overall project management, including schedules)."
        },
        {
          "id": "C",
          "text_en": "The writing group acts as external consultants, providing feedback to the internal development team.",   
          "text_mn": "Бичих баг нь гадаад зөвлөх үүргийг гүйцэтгэж, дотоод хөгжүүлэлтийн багт санал хүсэлт өгдөг.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This is incorrect. The text describes the writing group as 'members of the development team' or contributing to the team's effort, not as external consultants."
        },
        {
          "id": "D",
          "text_en": "The writing group and the development team are distinct entities with no overlapping responsibilities.", 
          "text_mn": "Бичих баг болон хөгжүүлэлтийн баг нь давхцах үүрэг хариуцлагагүй, тусдаа бие даасан нэгжүүд юм.",        
          "is_correct": false,
          "source": "Related Context",
          "explanation": "This is incorrect. The primary context emphasizes a 'coordinated effort' where the writing group contributes as part of the overall development team, implying overlapping responsibilities and integration."
        }
      ],
      "concept": "Difference between Development Teams and Writing Teams",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly states that the development team arranges and coordinates the entire documentation process, involving various roles. Within this larger coordinated effort, the writing group is specifically tasked with gathering and assembling style guidelines, indicating their role as a specialized component focused on content creation and integration into the broader project, rather than being a separate or supervisory entity.",
      "explanation_mn": "Анхдагч контекстэд хөгжүүлэлтийн баг нь баримт бичгийн бүх үйл явцыг зохион байгуулж, уялдуулдаг бөгөөд үүнд олон төрлийн үүрэг оролцдог гэж тодорхой заасан. Энэхүү өргөн цар хүрээтэй зохицуулалттай ажлын хүрээнд бичих баг нь загварын удирдамжийг цуглуулж, эмхэтгэх тусгай үүрэг гүйцэтгэдэг нь тэдний агуулга бүтээхэд чиглэсэн, төслийн бусад хэсэгтэй нэгдсэн мэргэшсэн бүрэлдэхүүн хэсэг болохыг харуулж байгаагаас гадна тусдаа эсвэл хяналтын байгууллага биш юм.",
      "question_number": 6,
      "page_reference": "203-246"
    },
    {
      "question_en": "Which characteristic best describes the development team for the ONRS project?",
      "question_mn": "ONRS төслийн хөгжүүлэлтийн багийг хамгийн сайн тодорхойлох шинж чанар юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "It is managed by one lead, ensuring efficient project coordination.",
          "text_mn": "Нэг ахлагчаар удирддаг бөгөөд төслийн үр ашигтай зохицуулалтыг баталгаажуулдаг.",
          "is_correct": false,
          "source": "Related Context (distractor)",
          "explanation": "A manager is part of the team, but the defining characteristic is the diverse skill sets involved, not solely the management structure. The text doesn't emphasize a single lead over the cross-functional nature."
        },
        {
          "id": "B",
          "text_en": "It mainly consists of experienced writers focusing on textual quality.",
          "text_mn": "Энэ нь голчлон туршлагатай зохиолчдоос бүрддэг бөгөөд бичвэрийн чанарт анхаардаг.",
          "is_correct": false,
          "source": "Related Context (distractor)",
          "explanation": "While writers are essential, the team includes many other roles beyond just writers, such as designers, editors, and testers, making 'mainly consists of writers' an incomplete description."
        },
        {
          "id": "C",
          "text_en": "It operates with specialized departments completing tasks sequentially.",
          "text_mn": "Энэ нь дараалсан үүргийг гүйцэтгэх тусгай хэлтэсүүдтэйгээр ажилладаг.",
          "is_correct": false,
          "source": "Related Context (distractor)",
          "explanation": "The schedule shows collaborative efforts (e.g., 'ALL' or multiple roles assigned to tasks), indicating integration rather than strict sequential work by isolated departments."
        },
        {
          "id": "D",
          "text_en": "It is cross-functional, integrating writers, designers, editors, and testers.",
          "text_mn": "Энэ нь зохиолч, дизайнер, редактор, туршигчийг нэгтгэсэн олон талт чиг үүрэгтэй.",
          "is_correct": true,
          "source": "Figure 6.1",
          "explanation": "The 'People Involved' section in Figure 6.1 lists a Writer (W), Graphics/Interface Designer (G), Editor (E), and Tester (T), in addition to Manager (M) and Client Contact (C). This diverse composition indicates a cross-functional team."
        }
      ],
      "concept": "Characteristics and composition of Development Teams (cross-functional nature)",
      "difficulty": "medium",
      "explanation_en": "The primary context, specifically Figure 6.1 'People Involved' and the detailed task schedule, clearly shows that the ONRS project team comprises a diverse set of roles, including Writer (W), Graphics/Interface Designer (G), Editor (E), Tester (T), Manager (M), and Client Contact (C). This integration of various skill sets indicates a cross-functional team approach, which is crucial for comprehensive documentation development.",
      "explanation_mn": "Эх сурвалж болох Зураг 6.1-ийн 'Оролцогч талууд' хэсэг болон үйл ажиллагааны нарийвчилсан хуваариас харахад ONRS төслийн баг нь Зохиолч (W), График/Интерфейсийн Дизайнер (G), Редактор (E), Туршигч (T), Менежер (M), Үйлчлүүлэгчтэй Харилцах (C) зэрэг олон төрлийн үүрэг гүйцэтгэгчдээс бүрдсэн байна. Эдгээр олон янзын ур чадварыг нэгтгэсэн нь баг нь олон талт чиг үүрэгтэй, цогц баримт бичгийн хөгжүүлэлтэд чухал ач холбогдолтой болохыг харуулж байна.",
      "question_number": 7,
      "page_reference": "203-246"
    },
    {
      "question_en": "Which professional roles form a comprehensive documentation project team, as demonstrated by the ONRS plan?",
      "question_mn": "ONRS төлөвлөгөөнд дурдсанаар баримт бичгийн төслийн цогц багийг ямар мэргэжлийн үүргүүд бүрдүүлдэг вэ?", 
      "choices": [
        {
          "id": "A",
          "text_en": "Software Developers, Quality Assurance Engineers, and Database Administrators.",
          "text_mn": "Програм хангамж Хөгжүүлэгчид, Чанарын Баталгаажуулалтын Инженерүүд, болон Өгөгдлийн Сангийн Администраторууд.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "These roles are typically associated with software development itself, rather than specifically the documentation project team as detailed in the provided schedule for creating user-facing guides and online references."
        },
        {
          "id": "B",
          "text_en": "Writer, Editor, Graphics/Interface Designer, Tester, Manager, and Client Contact.",
          "text_mn": "Зохиогч, Редактор, График/Интерфэйсийн Дизайнер, Тестер, Менежер, болон Үйлчлүүлэгчтэй Харилцах Ажилтан.",
          "is_correct": true,
          "source": "Figure 6.1, page 174",
          "explanation": "The ONRS project schedule in Figure 6.1 explicitly lists the key roles involved in the documentation development process: Writer (W), Graphics/Interface Designer (G), Editor (E), Tester (T), Manager (M), and Client Contact (C). These roles ensure a well-rounded team covering content, design, quality, project management, and external communication."     
        },
        {
          "id": "C",
          "text_en": "Content Creators, Editors, and a dedicated Proofreading Specialist.",
          "text_mn": "Контент Бүтээгчид, Редакторууд, болон тусгай Хянагч мэргэжилтэн.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While these roles are part of content development, they do not represent the full, multidisciplinary team outlined in the ONRS plan, which includes design, testing, management, and client interaction."
        },
        {
          "id": "D",
          "text_en": "Project Manager, Technical Writers, and User Experience Designers.",
          "text_mn": "Төслийн Менежер, Техникийн Зохиогчид, болон Хэрэглэгчийн Туршлагын Дизайнерууд.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Although some of these roles overlap conceptually, the ONRS plan specifies 'Writer,' 'Graphics/Interface Designer,' 'Editor,' 'Tester,' and 'Client Contact' in addition to 'Manager,' making this option less precise and complete than the correct answer."
        }
      ],
      "concept": "Characteristics and composition of Writing Teams (focus on writing/publications)",
      "difficulty": "medium",
      "explanation_en": "The ONRS project schedule in Figure 6.1 explicitly lists the key roles involved in the documentation development process: Writer (W), Graphics/Interface Designer (G), Editor (E), Tester (T), Manager (M), and Client Contact (C). These roles ensure a well-rounded team covering content creation, visual design, quality control, project oversight, and external communication, demonstrating a comprehensive composition for a documentation project.",
      "explanation_mn": "Зураг 6.1 дэх ONRS төслийн хуваарьт баримт бичгийг боловсруулах үйл явцад оролцох гол үүргүүдийг тодорхой заасан байдаг: Зохиогч (W), График/Интерфэйсийн Дизайнер (G), Редактор (E), Тестер (T), Менежер (M), болон Үйлчлүүлэгчтэй Харилцах Ажилтан (C). Эдгээр үүргүүд нь контент бүтээх, харагдах дизайныг гаргах, чанарын хяналт тавих, төслийн хяналт, гадаад харилцааг хамарсан цогц багийг бүрдүүлж, баримт бичгийн төслийн иж бүрэн бүрэлдэхүүнийг харуулдаг.",
      "question_number": 8,
      "page_reference": "203-246"
    },
    {
      "question_en": "Which team member primarily drives the creation and online deployment of the documentation product?",    
      "question_mn": "Баримт бичгийн бүтээгдэхүүнийг бүтээх, онлайнаар байршуулах ажлыг аль багийн гишүүн голчлон хариуцдаг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "The graphic designer, focused on interface design and visual elements.",
          "text_mn": "Интерфейсийн загвар болон харагдах байдалд төвлөрдөг график дизайнер.",
          "is_correct": false,
          "source": "Figure 6.1, tasks for 'G'",
          "explanation": "While the Graphics/Interface Designer (G) is involved in 'Design document/interface', their primary role is visual and interface design, not the overall creation and deployment of the content itself."
        },
        {
          "id": "B",
          "text_en": "The editor, ensuring quality and consistency through revision.",
          "text_mn": "Эхийг хянаж, чанар болон нэгдмэл байдлыг хангадаг редактор.",
          "is_correct": false,
          "source": "Figure 6.1, tasks for 'E'",
          "explanation": "The Editor (E) plays a crucial role in 'Edit document' and 'Final writing and editing', focusing on quality and consistency, but the primary content creation and online deployment tasks fall to the writer."
        },
        {
          "id": "C",
          "text_en": "The writer, who creates, revises, and deploys the document online.",
          "text_mn": "Баримт бичгийг боловсруулж, засварлаж, онлайнаар байршуулах үүрэгтэй бичигч.",
          "is_correct": true,
          "source": "Figure 6.1, tasks for 'W'",
          "explanation": "The writer's tasks in Figure 6.1, such as \"Initial writing of document,\" \"Revise written document,\" \"Put document online,\" and \"Troubleshoot online document,\" clearly show their central role in creating, refining, and publishing the documentation."
        },
        {
          "id": "D",
          "text_en": "The tester, validating functionality and user experience post-development.",
          "text_mn": "Бүтээгдэхүүн боловсруулагдсаны дараа үйл ажиллагаа болон хэрэглэгчийн туршлагыг баталгаажуулдаг туршигч.",
          "is_correct": false,
          "source": "Figure 6.1, tasks for 'T'",
          "explanation": "The Tester (T) is responsible for 'Test document' and 'Review test results', which are critical for quality assurance but occur after the initial development and deployment phases."
        }
      ],
      "concept": "Role of a Product Developer on a development team",
      "difficulty": "medium",
      "explanation_en": "The primary context, specifically Figure 6.1, details the \"Tentative Schedule\" for an online documentation project. The \"Writer (W)\" role is consistently assigned tasks such as \"Initial writing of document,\" \"Revise written document,\" \"Put document online,\" \"Troubleshoot online document,\" and \"Final writing and editing.\" These tasks directly cover the creation, development, and online deployment of the documentation product, making the writer the primary product developer in this context.",
      "explanation_mn": "Эхний эх сурвалж, тухайлбал Зураг 6.1 нь онлайн баримт бичгийн төслийн \"Урьдчилсан хуваарь\"-ийг харуулсан. \"Бичигч (W)\" үүрэгт \"Баримт бичгийн эхний бичилт\", \"Бичсэн баримт бичгийг засварлах\", \"Баримт бичгийг онлайнаар байршуулах\", \"Онлайн баримт бичгийн алдааг олж засах\", \"Эцсийн бичилт, засвар\"-ын ажлуудыг тогтмол хуваарилсан байна. Эдгээр ажлууд нь баримт бичгийн бүтээгдэхүүнийг бий болгох, хөгжүүлэх, онлайнаар байршуулах ажлыг шууд хамарч байгаа тул энэ нөхцөлд бичигч нь үндсэн бүтээгдэхүүн хөгжүүлэгч юм.",
      "question_number": 9,
      "page_reference": "203-246"
    },
    {
      "question_en": "What is a primary responsibility of the Project Manager (M) in the documentation development process?",  
      "question_mn": "Баримт бичиг боловсруулах үйл явцад Төслийн Менежер (М)-ийн үндсэн үүрэг юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Executing system tests and troubleshooting the online documentation.",
          "text_mn": "Системийн туршилт хийж, онлайн баримт бичгийн алдааг олж засварлах.",
          "is_correct": false,
          "source": "Figure 6.1",
          "explanation": "Testing and troubleshooting the online document are responsibilities of the Tester (T)."
        },
        {
          "id": "B",
          "text_en": "Coordinating team activities and assigning specific tasks to members.",
          "text_mn": "Багийн үйл ажиллагааг уялдуулан зохицуулж, гишүүдэд тодорхой үүрэг даалгавар өгөх.",
          "is_correct": true,
          "source": "Figure 6.1",
          "explanation": "The schedule (Figure 6.1) explicitly shows the Manager (M) assigning tasks such as user site visits and survey delivery. Furthermore, the Manager is included in \"ALL\" for crucial meetings like comparing information, designing the document/interface, and reviewing test results, all of which are essential for coordinating the overall team effort."      
        },
        {
          "id": "C",
          "text_en": "Performing the initial writing and final editing of the document.",
          "text_mn": "Баримт бичгийн анхны бичилт болон эцсийн засварлах ажлыг гүйцэтгэх.",
          "is_correct": false,
          "source": "Figure 6.1",
          "explanation": "Initial writing is assigned to the Writer (W) and editing to the Editor (E)."
        },
        {
          "id": "D",
          "text_en": "Creating the graphical elements and designing the user interface.",
          "text_mn": "График элементүүдийг үүсгэж, хэрэглэгчийн интерфэйсийг зохион бүтээх.",
          "is_correct": false,
          "source": "Figure 6.1",
          "explanation": "Graphical elements and interface design are primarily assigned to the Graphics/Interface Designer (G)."
        }
      ],
      "concept": "Role of a Project Manager on a development team",
      "difficulty": "medium",
      "explanation_en": "The schedule (Figure 6.1) explicitly shows the Manager (M) assigning tasks such as user site visits and survey delivery. Furthermore, the Manager is included in \"ALL\" for crucial meetings like comparing information, designing the document/interface, and reviewing test results, all of which are essential for coordinating the overall team effort.",      
      "explanation_mn": "Хуваарьт (Зураг 6.1) Менежер (М) нь хэрэглэгчийн сайтууд руу зочлох, судалгаа хүргэх зэрэг ажлуудыг хуваарилж байгааг тодорхой харуулсан. Нэмж дурдахад, Менежер нь мэдээллийг харьцуулах, баримт бичиг/интерфэйсийг боловсруулах, туршилтын үр дүнг хянах зэрэг чухал уулзалтуудад \"Бүгд\"-ийн бүрэлдэхүүнд багтдаг бөгөөд эдгээр нь багийн ерөнхий үйл ажиллагааг зохицуулахад чухал үүрэг гүйцэтгэдэг.",
      "question_number": 10,
      "page_reference": "203-246"
    }
  ]
}