{
  "total_generated": 10,
  "mcqs": [
    {
      "question_en": "What is a primary function of document review forms?",
      "question_mn": "Баримт бичгийн хяналтын маягтын үндсэн үүрэг юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Help reviewers respond consistently.",
          "text_mn": "Хянагчдад тууштай хариу өгөхөд тусалдаг.",
          "is_correct": true,
          "source": "Page 218",
          "explanation": "The form includes basic editing marks as a way of helping reviewers respond consistently, which standardizes the review process."
        },
        {
          "id": "B",
          "text_en": "Track reviewer time spent.",
          "text_mn": "Хянагчдын зарцуулсан цагийг хянах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While review time is managed, the primary function of review forms is not to track time, but to standardize feedback content."
        },
        {
          "id": "C",
          "text_en": "Demonstrate writer's authority.",
          "text_mn": "Зохиолчийн эрх мэдлийг харуулах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "The forms indicate a writer's professionalism and value for reviewer input, not their authority over reviewers."
        },
        {
          "id": "D",
          "text_en": "Establish project scope.",
          "text_mn": "Төслийн цар хүрээг тогтоох.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Document review forms are used during the review stage, not to establish the initial project scope." 
        }
      ],
      "concept": "Role of Document Review Forms in standardizing the review process",
      "difficulty": "easy",
      "explanation_en": "Document review forms are designed to help reviewers use standardized methods, like basic editing marks, to provide feedback consistently. This consistency is crucial for standardizing the review process and ensuring clear, accurate input.",
      "explanation_mn": "Баримт бичгийн хяналтын маягтууд нь хянагчдад стандартчилсан аргууд, тухайлбал, үндсэн засварлах тэмдэглэгээг ашиглан санал хүсэлтээ тууштай өгөхөд тусалдаг. Энэхүү тууштай байдал нь хяналтын процессыг стандартчилах, тодорхой, үнэн зөв мэдээлэл авахад чухал үүрэгтэй.",
      "question_number": 1,
      "page_reference": "247-269"
    },
    {
      "question_en": "Which is a key component of a document review transmittal letter?",
      "question_mn": "Баримт бичгийг хянахад зориулсан захидлын гол бүрэлдэхүүн хэсэг юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Project background, review type, and return deadline",
          "text_mn": "Төслийн нэмэлт мэдээлэл, шалгах төрөл, буцаах хугацаа",
          "is_correct": true,
          "source": "Page 218",
          "explanation": "Figure 7.1 annotations explicitly list project background, the kind of review information needed, and the return deadline as components of the transmittal letter."
        },
        {
          "id": "B",
          "text_en": "A detailed budget breakdown",
          "text_mn": "Нарийвчилсан төсвийн задаргаа",
          "is_correct": false,
          "source": "Page 218",
          "explanation": "A detailed budget breakdown is not mentioned as a component of a document review transmittal letter in Figure 7.1."
        },
        {
          "id": "C",
          "text_en": "Final publication and distribution list",
          "text_mn": "Эцсийн хэвлэлт болон түгээлтийн жагсаалт",
          "is_correct": false,
          "source": "Page 218",
          "explanation": "Final publication and distribution details are part of a later stage, not the initial review transmittal letter."
        },
        {
          "id": "D",
          "text_en": "Reviewer's personal editing preferences",
          "text_mn": "Шалгагчийн хувийн засварлах сонголтууд",
          "is_correct": false,
          "source": "Page 218",
          "explanation": "While instructions for marking are given, personal editing preferences are not a component of the letter itself."
        }
      ],
      "concept": "Key components of a successful document review transmittal letter (e.g., project background, review type, instructions, return deadlines)",
      "difficulty": "easy",
      "explanation_en": "Figure 7.1 illustrates that a transmittal letter includes background information about the project, clarifies the kind of review needed, and specifies the return deadline.",
      "explanation_mn": "Зураг 7.1-т дамжуулах захидал нь төслийн талаарх нэмэлт мэдээлэл, шалгах шаардлагатай зүйл болон буцаах хугацааг тодорхойлдог болохыг харуулсан.",
      "question_number": 2,
      "page_reference": "247-269"
    },
    {
      "question_en": "What do professional review forms encourage?",
      "question_mn": "Мэргэжлийн хяналтын маягт юуг дэмждэг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Fewer suggested changes.",
          "text_mn": "Цөөн өөрчлөлт санал болгох.",
          "is_correct": false,
          "source": null,
          "explanation": "The goal of forms is to get good feedback, not necessarily fewer changes."
        },
        {
          "id": "B",
          "text_en": "Easier document creation.",
          "text_mn": "Баримт бичиг үүсгэхэд хялбар.",
          "is_correct": false,
          "source": null,
          "explanation": "Review forms impact the review process, not the initial document creation process for the writer."   
        },
        {
          "id": "C",
          "text_en": "Faster review completion.",
          "text_mn": "Хяналтыг хурдан дуусгах.",
          "is_correct": false,
          "source": null,
          "explanation": "The text does not state that forms primarily encourage faster review completion."
        },
        {
          "id": "D",
          "text_en": "Accurate and specific information.",
          "text_mn": "Нарийн бөгөөд тодорхой мэдээлэл.",
          "is_correct": true,
          "source": "Page 218",
          "explanation": "Professional review forms are designed to encourage accurate and specific information from reviewers."
        }
      ],
      "concept": "Impact of professional review forms on reviewer feedback quality and writer credibility",
      "difficulty": "easy",
      "explanation_en": "The primary context explicitly states, 'Forms encourage accurate and spe- cific information from reviewers. They indicate, through their professionalism, that the writer takes the reviewer’s comments seriously as an added value to the documentation product.' This directly supports the idea that the main purpose and impact of these forms are to elicit high-quality feedback.",
      "explanation_mn": "Үндсэн контекстэд 'Маягтууд нь хянан шалгагчдаас нарийн бөгөөд тодорхой мэдээлэл авахыг дэмждэг. Тэдгээр нь өөрсдийн мэргэжлийн ур чадвараараа дамжуулан зохиогч хянан шалгагчийн санал хүсэлтийг баримт бичгийн үнэ цэнийг нэмэгдүүлэхэд чухал ач холбогдолтой гэж үздэгийг харуулдаг' гэж тодорхой заасан. Энэ нь эдгээр маягтуудын гол зорилго болон нөлөө нь өндөр чанартай санал хүсэлтийг олж авах явдал болохыг шууд дэмждэг.",
      "question_number": 3,
      "page_reference": "247-269"
    },
    {
      "question_en": "What document production activity requires the most careful planning?",
      "question_mn": "Баримт бичиг боловсруулах үйл ажиллагааны аль нь хамгийн их нарийн төлөвлөлт шаарддаг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Document writing.",
          "text_mn": "Баримт бичиг бичих.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While writing is crucial, the text highlights reviewing as demanding the most careful planning."     
        },
        {
          "id": "B",
          "text_en": "Document reviewing.",
          "text_mn": "Баримт бичиг хянах.",
          "is_correct": true,
          "source": "Page 218",
          "explanation": "The text explicitly states that reviewing may take more time and require more careful planning than any other document production activity."
        },
        {
          "id": "C",
          "text_en": "Document editing.",
          "text_mn": "Баримт бичиг засварлах.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Editing is part of the process, but the text specifies reviewing as the activity requiring the most careful planning."
        },
        {
          "id": "D",
          "text_en": "Document formatting.",
          "text_mn": "Баримт бичиг форматлах.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Formatting is a technical step, but not identified as requiring the most careful planning compared to reviewing."
        }
      ],
      "concept": "Significance of document review for increasing document usability and requiring careful planning",
      "difficulty": "easy",
      "explanation_en": "The text directly states that \"reviewing may take more of your time and require more careful planning than any other\" document production activity.",
      "explanation_mn": "Эх сурвалжид \"баримт бичиг хянах нь бусад баримт бичиг боловсруулах үйл ажиллагаанаас илүү их цаг хугацаа, нарийн төлөвлөлт шаарддаг\" гэж тодорхой заасан.",
      "question_number": 4,
      "page_reference": "247-269"
    },
    {
      "question_en": "What is an initial step in document review management?",
      "question_mn": "Баримт бичгийн хяналтыг удирдах эхний алхам юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Reviewing documentation objectives",
          "text_mn": "Баримт бичгийн зорилгыг хянах",
          "is_correct": true,
          "source": "Primary Context",
          "explanation": "The text emphasizes \"careful planning\" for the review stage and states the review form \"Gives background...about the project and the document.\" Understanding this background implicitly requires reviewing the document's objectives to ensure a focused review."
        },
        {
          "id": "B",
          "text_en": "Editing reviewer comments",
          "text_mn": "Хянагчийн сэтгэгдлийг засварлах",
          "is_correct": false,
          "source": "Primary Context",
          "explanation": "Editing reviewer comments occurs much later in the document review process, after comments have been received."
        },
        {
          "id": "C",
          "text_en": "Compiling reviewer lists",
          "text_mn": "Хянагчдын жагсаалт гаргах",
          "is_correct": false,
          "source": "Primary Context",
          "explanation": "While part of planning, compiling reviewer lists typically follows the initial step of defining the review's scope and objectives."
        },
        {
          "id": "D",
          "text_en": "Sending out review forms",
          "text_mn": "Хяналтын маягт илгээх",
          "is_correct": false,
          "source": "Primary Context",
          "explanation": "Sending out review forms is an action taken after initial planning and understanding the review's objectives."
        }
      ],
      "concept": "First step in document review management: Reviewing document objectives from the documentation plan",        
      "difficulty": "easy",
      "explanation_en": "The primary context stresses the need for \"careful planning\" in the review stage and mentions providing \"background about the project and the document\" to reviewers. This implicitly requires an initial step of reviewing the document's objectives to guide the review process effectively.",
      "explanation_mn": "Үндсэн агуулга нь хяналтын үе шатанд \"нарийн төлөвлөлт\" хийх шаардлагатайг онцолж, хянагчдад \"төсөл болон баримт бичгийн талаарх мэдээллийг\" өгдөг. Энэ нь хяналтын үйл явцыг үр дүнтэй удирдахын тулд баримт бичгийн зорилгыг эхлээд судлах шаардлагатайг шууд бусаар зааж өгдөг.",
      "question_number": 5,
      "page_reference": "247-269"
    },
    {
      "question_en": "What do document review forms primarily help ensure in documentation?",
      "question_mn": "Баримт бичгийн хяналтын маягт юуг голчлон баталгаажуулахад тусалдаг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Expedited design approvals",
          "text_mn": "Дизайны зөвшөөрлийг хурдасгах",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While reviews are part of approval, the primary function highlighted for the form is ensuring quality review feedback, not merely expediting design approvals."
        },
        {
          "id": "B",
          "text_en": "Automatic error correction",
          "text_mn": "Автомат алдаа засах",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Review forms facilitate feedback for manual correction, not automatic error correction."
        },
        {
          "id": "C",
          "text_en": "Accurate and consistent review information",
          "text_mn": "Нарийвчилсан, тууштай хяналтын мэдээлэл",
          "is_correct": true,
          "source": "Page ??",
          "explanation": "The text explicitly states that the review form \"helps ensure accurate and consistent review information\" for the documentation process."
        },
        {
          "id": "D",
          "text_en": "Creative content generation",
          "text_mn": "Бүтээлч агуулга үүсгэх",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Review forms focus on evaluating existing content, not generating new creative content."
        }
      ],
      "concept": "Role of document objectives in guiding content, design, and managerial verification during reviews",
      "difficulty": "easy",
      "explanation_en": "The primary context states that the document review form \"helps ensure accurate and consistent review information,\" which is crucial for effective managerial verification and quality control in the documentation process.",     
      "explanation_mn": "Анхан шатны контекстэд баримт бичгийн хяналтын маягт нь \"үнэн зөв, тууштай хяналтын мэдээллийг баталгаажуулахад тусалдаг\" гэж заасан бөгөөд энэ нь баримт бичгийн үйл явцад менежерийн үр дүнтэй хяналт болон чанарын хяналтад чухал үүрэг гүйцэтгэдэг.",
      "question_number": 6,
      "page_reference": "247-269"
    },
    {
      "question_en": "What type of review focuses on technical accuracy?",
      "question_mn": "Ямар төрлийн үнэлгээ техникийн үнэн зөв байдалд анхаардаг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "User Review",
          "text_mn": "Хэрэглэгчийн үнэлгээ",
          "is_correct": false,
          "source": null,
          "explanation": "This type of review focuses on usability and user experience, not solely technical accuracy."        
        },
        {
          "id": "B",
          "text_en": "Editorial Review",
          "text_mn": "Редакцийн үнэлгээ",
          "is_correct": false,
          "source": null,
          "explanation": "Editorial reviews focus on grammar, style, and consistency, which is distinct from technical accuracy, and the text notes reviewers are not expected to edit like a staff editor."
        },
        {
          "id": "C",
          "text_en": "Technical Review",
          "text_mn": "Техникийн үнэлгээ",
          "is_correct": true,
          "source": "Page 218, Figure 7.1",
          "explanation": "The review form explicitly asks reviewers to 'Please review the attached documentation for technical accuracy,' indicating a technical review."
        },
        {
          "id": "D",
          "text_en": "Subject Matter Expert Review",
          "text_mn": "Сэдвийн мэргэжилтний үнэлгээ",
          "is_correct": false,
          "source": null,
          "explanation": "While often overlapping with technical review, the specific instruction in the text points directly to 'technical accuracy' rather than general subject matter expertise."
        }
      ],
      "concept": "Types of document reviews based on reviewer expertise and focus (User, Technical, Subject Matter Expert)",   
      "difficulty": "easy",
      "explanation_en": "The document review form in Figure 7.1 from the Documentation and Training Center of Excellence at Texas Instruments specifically instructs reviewers to 'Please review the attached documentation for technical accuracy,' which defines a technical review.",
      "explanation_mn": "Texas Instruments-ийн Баримт бичиг, сургалтын төвийн Зураг 7.1 дэх баримт бичгийн хяналтын маягт нь хянагчдад 'хавсаргасан баримт бичгийг техникийн үнэн зөв байдлаар хянана уу' гэж тодорхой заасан нь техникийн үнэлгээг тодорхойлдог.",
      "question_number": 7,
      "page_reference": "247-269"
    },
    {
      "question_en": "What is a required focus for documentation reviewers?",
      "question_mn": "Баримт бичгийн хянагчдын заавал анхаарах зүйл юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Overall tutorial effectiveness",
          "text_mn": "Хичээлийн үр ашигтай байдал",
          "is_correct": false,
          "source": "Related context",
          "explanation": "While relevant to user reviews, the provided instructions specifically emphasize technical accuracy, not overall tutorial effectiveness."
        },
        {
          "id": "B",
          "text_en": "Visual design appeal",
          "text_mn": "Харагдах байдлын гоо зүй",
          "is_correct": false,
          "source": "Related context",
          "explanation": "While important for documentation, visual design appeal is not mentioned as a primary focus for reviewers in this context."
        },
        {
          "id": "C",
          "text_en": "Content marketing strategy",
          "text_mn": "Агуулгын маркетингийн стратеги",
          "is_correct": false,
          "source": "Related context",
          "explanation": "The review instructions do not include assessing the content's marketing strategy."
        },
        {
          "id": "D",
          "text_en": "Technical accuracy",
          "text_mn": "Техникийн нарийвчлал",
          "is_correct": true,
          "source": "Page 218",
          "explanation": "The DTCE review form explicitly asks reviewers to check the documentation for 'technical accuracy'." 
        }
      ],
      "concept": "Scope of User Reviews: Assessing task-oriented examples, usability, and tutorial effectiveness",
      "difficulty": "easy",
      "explanation_en": "The DTCE review form explicitly states the instruction: 'Please review the attached documentation for technical accuracy,' making technical accuracy a required focus for documentation reviewers.",
      "explanation_mn": "DTCE-ийн хяналтын маягтад 'Хавсаргасан баримт бичгийг техникийн нарийвчлалаар хянана уу' гэсэн заавар тодорхой заагдсан байдаг нь техникийн нарийвчлалыг баримт бичгийн хянагчдын зайлшгүй анхаарах зүйл болгож байна.",
      "question_number": 8,
      "page_reference": "247-269"
    },
    {
      "question_en": "What is a primary focus of document reviews?",
      "question_mn": "Баримт бичгийн хяналтын гол зорилго юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Technical accuracy",
          "text_mn": "Техникийн нарийвчлал",
          "is_correct": true,
          "source": "Page ??",
          "explanation": "The primary context states that documentation should be reviewed for 'technical accuracy,' indicating this as the main objective of the review."
        },
        {
          "id": "B",
          "text_en": "Formatting consistency",
          "text_mn": "Форматлахын тууштай байдал",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While consistency is important, the text explicitly highlights 'technical accuracy' as the direct goal for review, not formatting."
        },
        {
          "id": "C",
          "text_en": "Detailed stylistic editing",
          "text_mn": "Нарийвчилсан хэв маягийн засвар",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "The text notes that reviewers are not expected to edit a document the way a staff editor might, focusing instead on technical content."
        },
        {
          "id": "D",
          "text_en": "Timely submission deadlines",
          "text_mn": "Цаг тухайн үеийн хүргэх хугацаа",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Submission deadlines are a procedural aspect of the review process, not the primary focus of what is being reviewed."
        }
      ],
      "concept": "Scope of Technical Reviews: Verifying accuracy of procedures, reference information, and technical specifications",
      "difficulty": "easy",
      "explanation_en": "The primary context explicitly states, \"Please review the attached documentation for technical accuracy,\" identifying this as the core purpose of the review.",
      "explanation_mn": "Анхдагч контекстэд \"Хавсаргасан баримт бичгийг техникийн нарийвчлалаар хянана уу\" гэж тодорхой заасан нь хяналтын гол зорилгыг илтгэж байна.",
      "question_number": 9,
      "page_reference": "247-269"
    },
    {
      "question_en": "What is a key focus for document reviewers?",
      "question_mn": "Баримт бичгийн хянагчдын гол анхаарал юунд чиглэдэг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Adherence to budget",
          "text_mn": "Төсвийн хэрэгжилт",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Assessing budget adherence is outside the scope of a technical document review."
        },
        {
          "id": "B",
          "text_en": "Technical accuracy",
          "text_mn": "Техникийн нарийвчлал",
          "is_correct": true,
          "source": "Page 218",
          "explanation": "The document review form in Figure 7.1 explicitly asks reviewers to check for 'technical accuracy'." 
        },
        {
          "id": "C",
          "text_en": "Grammar and spelling",
          "text_mn": "Дүрэм болон үсэг бичлэг",
          "is_correct": false,
          "source": "Page 218",
          "explanation": "While editing marks are provided for consistency, the text clarifies that extensive editing is not the primary expectation for technical reviewers."
        },
        {
          "id": "D",
          "text_en": "Layout and formatting",
          "text_mn": "Байршил ба формат",
          "is_correct": false,
          "source": "Page 218",
          "explanation": "The primary context of the review form focuses on the content's accuracy rather than its visual presentation or layout."
        }
      ],
      "concept": "Scope of Subject Matter Expert (SME) Reviews: Confirming factual accuracy and completeness of background information",
      "difficulty": "easy",
      "explanation_en": "The review transmittal letter illustrated in Figure 7.1 specifically instructs reviewers to check the documentation for 'technical accuracy,' indicating this is a primary focus.",
      "explanation_mn": "Зураг 7.1-д үзүүлсэн хянан үзэх хуудас нь хянагчдад баримт бичгийг 'техникийн нарийвчлалыг' шалгахыг тусгайлан заасан нь энэ нь тэдний гол анхаарал болохыг харуулж байна.",
      "question_number": 10,
      "page_reference": "247-269"
    }
  ]
}