{
  "total_generated": 9,
  "mcqs": [
    {
      "question_en": "What is a primary purpose of using a structured documentation review form?",
      "question_mn": "Бүтцийн хувьд нэгдсэн баримт бичгийн хяналтын маягтыг ашиглахын гол зорилго юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To simplify the editing process for the document writer.",
          "text_mn": "Баримт бичиг зохиогчийн засварлах үйл явцыг хялбарчлах.",
          "is_correct": false,
          "source": null,
          "explanation": "Simplifying the writer's editing is a potential outcome, but the form's stated purpose centers on getting quality, consistent input from reviewers, not the writer's convenience."
        },
        {
          "id": "B",
          "text_en": "To reduce the overall time required for document revisions.",
          "text_mn": "Баримт бичгийн засвар хийхэд шаардагдах нийт хугацааг багасгах.",
          "is_correct": false,
          "source": null,
          "explanation": "While efficiency might be a secondary benefit, the primary context emphasizes accuracy and consistency of feedback, not time reduction."
        },
        {
          "id": "C",
          "text_en": "To ensure technical accuracy and consistent feedback from reviewers.",
          "text_mn": "Техникийн нарийвчлал, хянагчдаас тогтвортой санал хүсэлтийг хангах.",
          "is_correct": true,
          "source": "Page 218",
          "explanation": "The text states the form 'helps ensure accurate and consistent review information' and 'Forms encourage accurate and specific information from reviewers,' directly supporting this purpose."
        },
        {
          "id": "D",
          "text_en": "To formally approve the document for final publication.",
          "text_mn": "Баримт бичгийг эцсийн хэвлэлтэд албан ёсоор батлах.",
          "is_correct": false,
          "source": null,
          "explanation": "Review is part of a larger approval process, but the form itself is primarily for gathering specific, accurate review information, not for final publication sign-off."
        }
      ],
      "concept": "Purpose of documentation reviews (e.g., increasing document usability, ensuring accuracy and consistency)",  
      "difficulty": "medium",
      "explanation_en": "The text explicitly states that the DTCE Review Form 'helps ensure accurate and consistent review information' and 'Forms encourage accurate and specific information from reviewers.' Therefore, a primary purpose is to gather precise and reliable feedback to improve the document's technical accuracy and consistency.",
      "explanation_mn": "Уг текстэнд DTCE-ийн хяналтын маягт нь 'үнэн зөв, тууштай хяналтын мэдээллийг баталгаажуулахад тусалдаг' болон 'маягтууд нь хянагчдаас үнэн зөв, тодорхой мэдээллийг авахыг дэмждэг' гэж тодорхой заасан. Иймээс үндсэн зорилго нь баримт бичгийн техникийн нарийвчлал, тууштай байдлыг сайжруулахын тулд нарийн бөгөөд найдвартай санал хүсэлт цуглуулах явдал юм.",
      "question_number": 1,
      "page_reference": "247-269"
    },
    {
      "question_en": "Which component of a document review form primarily promotes consistent and accurate feedback from reviewers?",
      "question_mn": "Баримт бичгийн хяналтын маягтын аль бүрэлдэхүүн хэсэг нь хянагчдаас тогтмол бөгөөд үнэн зөв санал хүсэлт өгөхөд голлон хувь нэмэр оруулдаг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Clear instructions and standardized editing marks for reviewers.",
          "text_mn": "Хянагчдад зориулсан тодорхой зааварчилгаа, стандартчилсан засварлах тэмдэглэгээ.",
          "is_correct": true,
          "source": "Page ??",
          "explanation": "The primary context states, \"The form includes basic editing marks as a way of helping reviewers respond consistently\" and \"Gives clear instructions for marking the copy\". These elements directly contribute to standardizing how reviewers provide feedback, thereby ensuring greater consistency and accuracy in their responses."
        },
        {
          "id": "B",
          "text_en": "Comprehensive project background and document overview.",
          "text_mn": "Төслийн иж бүрэн мэдээлэл болон баримт бижгийн ерөнхий тойм.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While important for context, comprehensive project background and document overview do not primarily ensure the consistency and accuracy of the *feedback content* itself."
        },
        {
          "id": "C",
          "text_en": "An option to directly contact the writer for clarification or large additions.",
          "text_mn": "Бичиг баримт зохиогчтой шууд холбогдож тодруулга авах, эсвэл нэмэлт өөрчлөлт оруулах сонголт.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "The option to contact the writer facilitates detailed communication but is not a component of the form that primarily drives *consistent and accurate feedback marking* in the way standardized instructions and marks do."
        },
        {
          "id": "D",
          "text_en": "A complete list of all assigned reviewers and submission deadlines.",
          "text_mn": "Хяналтад томилогдсон бүх хянагчдын жагсаалт, мөн хугацааны хязгаар.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "A reviewer list and deadlines are crucial for managing the review process and ensuring timeliness, but they do not directly contribute to the consistency or accuracy of the *feedback content* provided."
        }
      ],
      "concept": "Components of an effective document review form (e.g., transmittal letter, reviewer instructions, basic editing marks)",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly highlights that \"clear instructions for marking the copy\" and the inclusion of \"basic editing marks\" are instrumental in helping reviewers \"respond consistently.\" These features directly standardize the review process, leading to more uniform and precise feedback. Other elements, while valuable for overall process management, do not primarily ensure the quality and consistency of the feedback content itself.",
      "explanation_mn": "Үндсэн эх сурвалжид \"хуулбарыг тэмдэглэх тодорхой зааварчилгаа\" болон \"үндсэн засварлах тэмдэглэгээг\" багтаах нь хянагчдад \"тогтмол хариу өгөхөд\" чухал үүрэг гүйцэтгэдэг гэж тодорхой онцолсон байдаг. Эдгээр онцлог шинж чанарууд нь хяналтын үйл явцыг шууд стандартчилж, илүү нэгдмэл бөгөөд нарийн санал хүсэлт өгөхөд хүргэдэг. Бусад элементүүд нь үйл явцын ерөнхий менежментийн хувьд үнэ цэнэтэй боловч санал хүсэлтийн агуулгын чанар, тогтвортой байдлыг голлон баталгаажуулдаггүй.",
      "question_number": 2,
      "page_reference": "247-269"
    },
    {
      "question_en": "Which guideline is essential for maximizing the value of the document review process?",
      "question_mn": "Баримт бичгийн хянан үзэх үйл явцын үнэ цэнийг нэмэгдүүлэхэд ямар удирдамж чухал вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Ensuring the use of professional forms to encourage detailed feedback.",
          "text_mn": "Нарийвчилсан санал хүсэлтийг дэмжихийн тулд мэргэжлийн маягт ашиглах.",
          "is_correct": false,
          "source": "Primary Context, Figure 7.1 description",
          "explanation": "Using professional forms helps encourage accurate and specific information, but it is a tool within the review process, not the fundamental guideline for maximizing its overall value through careful planning."
        },
        {
          "id": "B",
          "text_en": "Approaching the review stage with careful planning and great care.",
          "text_mn": "Хянан үзэх үе шатанд нягт нямбай төлөвлөлт, онцгой анхаарал хандуулах.",
          "is_correct": true,
          "source": "Primary Context, last paragraph",
          "explanation": "The text explicitly states that 'reviewing may take more of your time and require more careful planning than any other' activity, and to 'make the most of your investment,' one must 'approach the review stage with great care.' This underscores careful planning and a diligent approach as the primary guideline for maximizing the value of the review process."
        },
        {
          "id": "C",
          "text_en": "Providing reviewers with basic editing marks for consistent feedback.",
          "text_mn": "Хянагчдад тогтвортой санал хүсэлт өгөхөд зориулж үндсэн засварлах тэмдэглэгээг өгөх.",
          "is_correct": false,
          "source": "Primary Context, Figure 7.1 description",
          "explanation": "While providing editing marks is a good practice to ensure consistency, it is a specific tactic rather than an overarching guideline for maximizing the overall value of the entire review process."
        },
        {
          "id": "D",
          "text_en": "Giving clear instructions to reviewers on marking up proposed changes.",
          "text_mn": "Хянагчдад санал болгосон өөрчлөлтийг хэрхэн тэмдэглэх талаар тодорхой заавар өгөх.",
          "is_correct": false,
          "source": "Primary Context, Figure 7.1 description",
          "explanation": "Clear instructions improve the quality and clarity of reviewer feedback, which is important. However, it is a specific operational detail within the review process, not the overarching principle of careful planning to maximize the return on investment."
        }
      ],
      "concept": "Guidelines for managing document reviews (e.g., reviewing objectives, determining review type, establishing schedule)",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly emphasizes that 'reviewing may take more of your time and require more careful planning than any other' document production activity. It further states that to 'make the most of your investment,' one must 'approach the review stage with great care.' Therefore, the most essential guideline for maximizing the value of the document review process is to engage in careful planning and a diligent approach from the outset. The other options describe specific helpful practices within a well-managed review but do not represent the fundamental, overarching guideline for maximizing overall value and return on investment in the same way that careful planning does.",
      "explanation_mn": "Анхдагч контекстэд 'хянан үзэх нь бусад баримт бичиг боловсруулах үйл ажиллагаанаас илүү их цаг хугацаа, илүү нарийн төлөвлөлт шаарддагийг' тодорхой онцолсон. Мөн 'хөрөнгө оруулалтаа хамгийн үр дүнтэй ашиглахын тулд' 'хянан үзэх үе шатанд онцгой анхаарал хандуулах ёстой' гэж заасан. Иймээс баримт бичгийн хянан үзэх үйл явцын үнэ цэнийг нэмэгдүүлэх хамгийн чухал удирдамж бол эхнээс нь нягт нямбай төлөвлөлт, хичээнгүй хандах явдал юм. Бусад сонголтууд нь сайн зохион байгуулагдсан хянан үзэх үйл явцын хүрээнд хэрэгтэй тусгай практикуудыг тайлбарлаж байгаа боловч болгоомжтой төлөвлөлт шиг үнэ цэнийг нэмэгдүүлэх, хөрөнгө оруулалтын өгөөжийг дээшлүүлэх суурь, бүхэлд нь хамарсан удирдамж биш юм.",
      "question_number": 3,
      "page_reference": "247-269"
    },
    {
      "question_en": "What is the primary role of providing project background and specific review instructions to reviewers?",
      "question_mn": "Хянан шинжлэгчдэд төслийн үндсэн мэдээлэл болон хяналтын тусгай зааврыг өгөх нь ямар үндсэн үүрэгтэй вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "To ensure consistent application of editing marks across all reviewers.",
          "text_mn": "Бүх хянан шинжлэгчдийн дунд засварлах тэмдэглэгээг тууштай хэрэглэхийг баталгаажуулах.",
          "is_correct": false,
          "source": "Page 218",
          "explanation": "Providing editing marks is a separate function of the form to aid consistency, but it is distinct from providing project background and review objectives."
        },
        {
          "id": "B",
          "text_en": "To orient reviewers with project context and clarify specific objectives for their feedback.",
          "text_mn": "Хянан шинжлэгчдийг төслийн нөхцөл байдалтай танилцуулж, санал хүсэлтийн тодорхой зорилгыг тодруулах.",   
          "is_correct": true,
          "source": "Page 218",
          "explanation": "The reviewer guidelines explicitly state their purpose is to give background about the project and document, and indicate the kind of review information needed (e.g., technical accuracy). This helps reviewers understand the specific objectives and context for their task, ensuring their feedback is relevant and focused."
        },
        {
          "id": "C",
          "text_en": "To demonstrate the writer's professionalism and commitment to quality.",
          "text_mn": "Зохиогчийн мэргэжлийн ур чадвар, чанарт үнэнч байдлыг харуулах.",
          "is_correct": false,
          "source": "Page 218",
          "explanation": "While a professional form contributes to this perception, the primary function of these specific instructions is not merely to demonstrate professionalism but to guide the review itself."
        },
        {
          "id": "D",
          "text_en": "To expedite the review process by standardizing feedback submission.",
          "text_mn": "Санал хүсэлт өгөх үйл явцыг стандартчилан хяналтыг хурдасгах.",
          "is_correct": false,
          "source": "Page 218",
          "explanation": "While standardizing feedback can expedite the process, it's not the primary role of providing background and specific instructions related to document objectives."
        }
      ],
      "concept": "Role of document objectives in the review process and their restatement for reviewers",
      "difficulty": "medium",
      "explanation_en": "The reviewer guidelines, as illustrated in Figure 7.1, explicitly state their purpose is to 'Gives background To: about the project and the document' and 'Indicates the kind of review information Please review the attached documentation for technical accuracy.' This directly serves to orient the reviewer with the document's context and clarify the specific objectives for their review, ensuring their feedback is targeted and effective.",
      "explanation_mn": "Зураг 7.1-д харуулсан хянан шинжлэгчийн удирдамжид төсөл, баримт бичгийн талаарх 'үндсэн мэдээллийг өгөх', мөн 'техникийн нарийвчлал зэрэг шаардлагатай хяналтын мэдээллийн төрлийг зааж өгөх' нь тэдний зорилго гэж тодорхой заасан байдаг. Энэ нь хянан шинжлэгчдэд баримт бичгийн агуулгыг ойлгож, хяналтын тодорхой зорилгыг тодруулахад шууд тусалж, тэдний санал хүсэлтийг үр дүнтэй, зорилтот болгодог.",
      "question_number": 4,
      "page_reference": "247-269"
    },
    {
      "question_en": "What is the primary objective of the document review process detailed in the DTCE review form?",
      "question_mn": "DTCE-ийн хяналтын маягтанд дэлгэрэнгүй тайлбарласан баримт бичгийн хяналтын үйл явцын үндсэн зорилго юу вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Gathering feedback on the document's usability and effectiveness for end-users.",
          "text_mn": "Эцсийн хэрэглэгчдэд зориулсан баримт бичгийн ашиглалт, үр нөлөөний талаар санал хүсэлт цуглуулах.",      
          "is_correct": false,
          "source": null,
          "explanation": "The primary context emphasizes 'technical accuracy,' not user experience or usability, as the main goal of this specific review form."
        },
        {
          "id": "B",
          "text_en": "Conducting comprehensive grammatical and stylistic editing for improved readability.",
          "text_mn": "Уншигдахуйц байдлыг сайжруулахын тулд дүрмийн болон хэв маягийн цогц засвар хийх.",
          "is_correct": false,
          "source": null,
          "explanation": "While basic editing marks are provided, the text states 'you don’t expect reviewers to edit a document the way a staff editor might,' indicating this is not the primary objective."
        },
        {
          "id": "C",
          "text_en": "Streamlining the documentation workflow and managing reviewer assignments efficiently.",
          "text_mn": "Баримтжуулалтын ажлын урсгалыг оновчтой болгож, хянагчдын хуваарилалтыг үр дүнтэй удирдах.",
          "is_correct": false,
          "source": null,
          "explanation": "While the form contributes to process control, its explicit instruction and core function are related to the content's technical correctness, not primarily workflow management."
        },
        {
          "id": "D",
          "text_en": "Ensuring the technical accuracy and consistency of the documentation content.",
          "text_mn": "Баримт бичгийн агуулгын техникийн нарийвчлал, тууштай байдлыг хангах.",
          "is_correct": true,
          "source": "Page 218",
          "explanation": "The DTCE review form explicitly instructs reviewers to 'review the attached documentation for technical accuracy.' The form's design and purpose are to 'help ensure accurate and consistent review information' concerning the technical content."
        }
      ],
      "concept": "Types of document reviews (User Review, Technical Review, Subject Matter Expert Review)",
      "difficulty": "medium",
      "explanation_en": "The DTCE review form explicitly instructs reviewers to 'review the attached documentation for technical accuracy.' The form's design and purpose, as described, are to 'help ensure accurate and consistent review information' specifically concerning the technical content, not primarily editorial style, user experience, or workflow management.",
      "explanation_mn": "DTCE-ийн хяналтын маягт нь хянагчдад 'хавсаргасан баримт бичгийг техникийн нарийвчлалтай эсэхийг шалгах' зааварчилгааг тодорхой өгсөн. Маягтын зорилго нь техникийн агуулгын талаар 'үнэн зөв, тууштай хяналтын мэдээллийг хангах' явдал бөгөөд гол зорилго нь редакцын хэв маяг, хэрэглэгчийн туршлага эсвэл ажлын урсгалыг удирдах биш юм.",
      "question_number": 5,
      "page_reference": "247-269"
    },
    {
      "question_en": "What is the primary focus of a technical reviewer when evaluating documentation?",
      "question_mn": "Баримт бичгийг үнэлэхдээ техникийн шинжээчийн гол анхаарал юунд чиглэдэг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Verifying that all required documentation sections are complete.",
          "text_mn": "Шаардлагатай баримт бичгийн бүх хэсэг бүрэн эсэхийг шалгах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Completeness is an important part of any document review, but the specific instruction for the technical reviewer in the primary context is centered on ensuring 'technical accuracy,' not just the presence of sections."
        },
        {
          "id": "B",
          "text_en": "Evaluating the clarity and readability for the intended user audience.",
          "text_mn": "Зорилтот хэрэглэгчийн ойлгоход хялбар байдал, тодорхой байдлыг үнэлэх.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "Clarity and readability are crucial for user experience, often a focus for user-centric reviews. However, the primary context for a *technical* reviewer emphasizes 'technical accuracy' rather than user-friendliness as the main goal."
        },
        {
          "id": "C",
          "text_en": "Ensuring the technical accuracy of the information presented.",
          "text_mn": "Танилцуулсан мэдээллийн техникийн үнэн зөвийг баталгаажуулах.",
          "is_correct": true,
          "source": "Page 218",
          "explanation": "The DTCE Review Form explicitly instructs reviewers to 'Please review the attached documentation for technical accuracy.' This indicates that the primary responsibility of a technical reviewer, in this context, is to ensure the factual correctness of the technical details within the document. Other aspects, while important, are not presented as the core focus for technical accuracy review on this form."
        },
        {
          "id": "D",
          "text_en": "Checking for consistent formatting and adherence to style guidelines.",
          "text_mn": "Форматлал болон загварын удирдамжийн дагаж мөрдөлтийг шалгах.",
          "is_correct": false,
          "source": "Related Context",
          "explanation": "While consistency and adherence to style guides are important aspects of documentation review, the provided text specifically highlights technical accuracy as the primary focus for a technical reviewer on the DTCE form, not formatting."
        }
      ],
      "concept": "Responsibilities and focus areas for different types of reviewers (e.g., users for task-orientation, technical for accuracy)",
      "difficulty": "medium",
      "explanation_en": "The DTCE Review Form explicitly instructs reviewers to \"Please review the attached documentation for technical accuracy.\" This indicates that the primary responsibility of a technical reviewer, in this context, is to ensure the factual correctness of the technical details within the document. Other aspects, while important, are not presented as the core focus for technical accuracy review on this form.",
      "explanation_mn": "DTCE-ийн Хяналтын маягтад \"Хавсаргасан баримт бичгийг техникийн нарийвчлалыг шалгана уу\" гэж тодорхой заасан байдаг. Энэ нь техникийн шинжээчийн энэ нөхцөл дэх үндсэн үүрэг нь баримт бичгийн доторх техникийн мэдээллийн баримтын үнэн зөвийг баталгаажуулах явдал гэдгийг харуулж байна. Бусад чухал асуудлууд нь энэ маягт дээр техникийн нарийвчлалын хяналтын гол анхаарал болгон танилцуулагдаагүй байна.",
      "question_number": 6,
      "page_reference": "247-269"
    },
    {
      "question_en": "What is a key benefit of meticulously planning the document review stage?",
      "question_mn": "Баримт бичгийн хяналтын үе шатыг нарийвчлан төлөвлөх нь ямар гол ач холбогдолтой вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Fostering stronger collaboration between writers and reviewers.",
          "text_mn": "Зохиолч болон шүүмжлэгчдийн хоорондын хамтын ажиллагааг бэхжүүлэх.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Encouraging collaboration is a positive aspect of the review process, often facilitated by good communication and form design, but the text specifically links careful *planning* of the stage to maximizing the investment of time and resources, not primarily to collaboration."
        },
        {
          "id": "B",
          "text_en": "Achieving greater consistency and accuracy in reviewer feedback.",
          "text_mn": "Шүүмжлэгчийн санал хүсэлтийн тууштай байдал, үнэн зөв байдлыг нэмэгдүүлэх.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While consistency and accuracy are important outcomes, the text attributes these more directly to the use of professional forms and clear instructions, rather than being the primary benefit of the overarching planning of the review stage itself."
        },
        {
          "id": "C",
          "text_en": "Providing reviewers with precise guidelines for marking changes.",
          "text_mn": "Шүүмжлэгчдэд өөрчлөлтийг тэмдэглэх нарийн удирдамжийг өгөх.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "Providing precise guidelines is a benefit derived from the *content* and *design* of review forms, not the primary strategic benefit of *planning the entire review stage* to optimize investment and time."
        },
        {
          "id": "D",
          "text_en": "Ensuring the most effective use of time and resources invested in the review process.",
          "text_mn": "Хяналтын үйл явцад оруулсан цаг хугацаа, нөөцийг хамгийн үр дүнтэй ашиглахыг баталгаажуулах.",
          "is_correct": true,
          "source": "Page 218",
          "explanation": "The text emphasizes that reviewing demands significant time and careful planning. Meticulous planning is crucial to maximize the 'investment' (time and resources) in the review process, ensuring that the effort put into reviews yields the best possible outcome."
        }
      ],
      "concept": "Importance of careful planning and scheduling for document reviews",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly states that document reviewing \"may take more of your time and require more careful planning than any other\" activity, and that to \"make the most of your investment,\" the review stage must be approached with \"great care.\" This directly supports the idea that meticulous planning ensures the most effective use of time and resources.",
      "explanation_mn": "Үндсэн контекстэд баримт бичгийг хянах нь бусад аливаа үйл ажиллагаанаас илүү их цаг хугацаа, нарийн төлөвлөгөө шаардддаг бөгөөд \"хөрөнгө оруулалтаа хамгийн сайн ашиглахын тулд\" хяналтын үе шатад \"маш болгоомжтой\" хандах ёстой гэж тодорхой заасан. Энэ нь нарийн төлөвлөлт нь цаг хугацаа, нөөцийг хамгийн үр дүнтэй ашиглах баталгаа болдог гэсэн санааг шууд дэмждэг.",
      "question_number": 7,
      "page_reference": "247-269"
    },
    {
      "question_en": "Which feature of a documentation review form primarily guides reviewers on the specific feedback required?",
      "question_mn": "Баримт бичгийн хянан шалгах маягтын аль онцлог нь хянагчдад шаардлагатай тодорхой санал хүсэлтийг голчлон чиглүүлдэг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Offering detailed explanations for various grammatical edits.",
          "text_mn": "Янз бүрийн дүрмийн засваруудад зориулсан нарийвчилсан тайлбарыг санал болгох.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "The form provides basic editing marks to help reviewers respond consistently but clarifies that reviewers are not expected to edit like a staff editor, and the main request is for technical accuracy, not comprehensive grammatical edits."
        },
        {
          "id": "B",
          "text_en": "Highlighting the writer's commitment to valuing all feedback equally.",
          "text_mn": "Зохиогчийн бүх санал хүсэлтийг ижил үнэлэх амлалтыг онцлох.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "The form's professionalism indicates that the writer takes comments seriously, but this is an outcome or perception, not the primary mechanism for guiding reviewers on *what specific feedback* is required."
        },
        {
          "id": "C",
          "text_en": "Specifying the exact type of review needed, like technical accuracy.",
          "text_mn": "Техникийн нарийвчлал гэх мэт шаардлагатай хянан шалгах төрлийг тодорхой заах.",
          "is_correct": true,
          "source": "Page ??",
          "explanation": "The DTCE review form explicitly states the purpose of the review, such as 'Please review the attached documentation for technical accuracy,' and notes that it 'Indicates the kind of review information the writer needs from the reviewer.' This directly guides reviewers on the specific type of feedback expected."
        },
        {
          "id": "D",
          "text_en": "Ensuring logistical consistency for returning marked-up copies.",
          "text_mn": "Тэмдэглэгээ хийсэн хуулбаруудыг буцаахад логистикийн нэгдмэл байдлыг хангах.",
          "is_correct": false,
          "source": "Page ??",
          "explanation": "While the form clarifies where to send marked-up copies, its primary role in guiding specific feedback is not logistical consistency but defining the nature of the review itself."
        }
      ],
      "concept": "Content and purpose of a review cover letter (including questions for reviewers)",
      "difficulty": "medium",
      "explanation_en": "The primary context explicitly states that the review form 'Indicates the kind of review information the writer needs from the reviewer' and gives an example: 'Please review the attached documentation for technical accuracy.' This demonstrates that a key feature of the form is to clearly specify the type of feedback the writer expects, directly guiding the reviewer's focus.",
      "explanation_mn": "Анхны контектэд хянан шалгах маягт нь 'Зохиогчид хянагчаас ямар төрлийн хянан шалгах мэдээлэл шаардлагатайг заана' гэж тодорхой заасан бөгөөд жишээ болгон 'Хавсаргасан баримт бичгийг техникийн нарийвчлалаар хянан шалгана уу' гэсэн байдаг. Энэ нь маягтын гол онцлог нь зохиогчийн хүлээж буй санал хүсэлтийн төрлийг тодорхой зааж, хянагчийн анхаарлыг шууд чиглүүлдэг болохыг харуулж байна.",
      "question_number": 8,
      "page_reference": "247-269"
    },
    {
      "question_en": "Which of the following marks commonly indicates a deletion during a document review?",
      "question_mn": "Баримт бичгийн хяналтын үед дараах тэмдэглэгээнүүдийн аль нь устгахыг ерөнхийдөө заадаг вэ?",
      "choices": [
        {
          "id": "A",
          "text_en": "Circling text with 'sp' to mark a spelling error.",
          "text_mn": "Үсгийн алдааг тэмдэглэхийн тулд 'sp' гэж дугуйлах.",
          "is_correct": false,
          "source": "Page 218",
          "explanation": "Circling text with 'sp' is used to mark spelling errors, not for deletion."
        },
        {
          "id": "B",
          "text_en": "A transpose symbol (fp7) to reverse the order of elements.",
          "text_mn": "Элементүүдийн дарааллыг өөрчлөх байр солих тэмдэг (fp7).",
          "is_correct": false,
          "source": "Page 218",
          "explanation": "The transpose symbol is used for reversing the order of text, not for deletion."
        },
        {
          "id": "C",
          "text_en": "A caret (^) used to indicate an insertion of new text.",
          "text_mn": "Шинэ текст оруулахыг заадаг карет (^) тэмдэг.",
          "is_correct": false,
          "source": "Page 218",
          "explanation": "The caret is used to indicate an insertion, not a deletion."
        },
        {
          "id": "D",
          "text_en": "A horizontal line (—) drawn through text to delete it.",
          "text_mn": "Текстийн дундуур хөндлөн зураас (—) татаж устгах.",
          "is_correct": true,
          "source": "Page 218",
          "explanation": "The document review form specifically illustrates the use of a horizontal line (—) through text, labeled as 'Poelete', to indicate that the marked text should be deleted."
        }
      ],
      "concept": "Standard basic editing marks useful for reviewers",
      "difficulty": "medium",
      "explanation_en": "The provided document review form clearly lists \"—Poelete\" with a horizontal line through text as the standard basic editing mark for indicating deletion. Other marks like the caret, transpose symbol, and circling with \"sp\" are used for insertion, reversing order, and spelling corrections, respectively, as detailed in the form.",
      "explanation_mn": "Өгөгдсөн баримт бичгийн хяналтын хуудас нь текстийн дундуур хөндлөн зураас (—) татаж, \"Poelete\" гэж тэмдэглэсэн нь устгахыг заах стандарт үндсэн засварлах тэмдэглэгээ болохыг тодорхой харуулсан. Карет, байр солих тэмдэг, мөн \"sp\" гэж дугуйлсан тэмдэглэгээнүүд нь тус тус оруулах, дарааллыг өөрчлөх, үсгийн алдааг засахад ашиглагддаг гэдгийг тус хуудсанд дэлгэрэнгүй тайлбарласан.",
      "question_number": 9,
      "page_reference": "247-269"
    }
  ]
}